package org.boc.db;

public class BaZhai {
  //后天卦数转为先天卦
  public static final int[] hxtg = {0, 6, 8, 4, 5, 0, 1, 2, 7, 3};
  public static final int[] xhtg = {0, 6, 7, 9, 3, 4, 1, 8, 2};
  //男命卦转女命卦
  public static final int[] nlmg = {0, 5, 4, 3, 2, 1, 9, 8, 7, 6};
  //先天八卦数方位，求其对角方位必以10-后天八卦数，再转换成先天八卦数
  public static final String[] fx = {"  ","西北","西","南","东","东南","北","东北","西南"};
  public static final String[] yxp = {"  ","生气","延年","天医","伏位","绝命","五鬼","六煞","祸害"};
  public static final int[][] yxp2 = new int[9][9];
  public static final String[][] yxp3 = new String[9][10];
  public static final int[] yxpwx = {0,YiJing.MU, YiJing.JIN, YiJing.TU, YiJing.MU, YiJing.JIN, YiJing.HUO,YiJing.SHUI,YiJing.TU};
  public static final int[][] fqcw = new int[9][9];
  public static final String[][] jibing = new String[9][9];
  public static final String[][] zaihuo = new String[9][9];
  public static final String[] zixi = new String[9];
  public static final String[] cwfs = {"",
      "金属制瑞兽、时钟。",
      "植物、木制雕刻品为次。",
      "风水轮、金鱼缸。",
      "装饰用吊灯、射灯、神楼。",
      "假山、瓷制瑞兽麒麟狮子貔貅。",
      };
  public static final String[] hunyin = {"","上婚","上婚","上婚","中婚","下婚","下婚","中婚","中婚"};
  public static final String[] zaoweiJX = {"",
      "生气位，人丁不旺，财产受损",
      "延年位，婚姻难成、夫妇不合",
      "天医位，休弱多病",
      "伏位位，无财无寿，一生贫苦",
      "绝命位，健康长寿、人财两旺",
      "五鬼位，横发资财，无火灾、盗贼",
      "六煞位，发丁发财、无病无讼",
      "祸害位，无灾无病"};
  static {
    zixi[1] = zixi[2] = zixi[3] = "主子息多，父母与子女感情好";
    zixi[4] = "主女多子少";
    zixi[5] = zixi[6] = zixi[7] = "有子但父母与子女缘分薄";
    zixi[8] = "主无子，或与子关系极差";

    zaihuo[1][3] = "争执、官灾、因色致祸";
    zaihuo[1][4] = "火灾、窃贼、是非、伤长子";
    zaihuo[1][6] = "官灾、是非、水灾、因色致祸";
    zaihuo[1][5] = "是非、不利长女";
    zaihuo[2][4] = "官灾、口舌、血光之灾、破财";
    zaihuo[2][3] = "火灾、破财、车祸、与女性不和";
    zaihuo[2][5] = "与母不和、因色致祸、金属所伤";
    zaihuo[2][6] = "水灾、破财、父子不和、血症";
    zaihuo[3][1] = "官灾、破财、因色致祸";
    zaihuo[3][2] = "官灾、破财、与女性不和";
    zaihuo[3][8] = "夫妻不和、中毒、水灾";
    zaihuo[3][7] = "是非、不利少男";
    zaihuo[4][2] = "血光、损丁、四肢受伤";
    zaihuo[4][1] = "火灾、贼劫、足伤、争执";
    zaihuo[4][7] = "是非、破财、不利小孩";
    zaihuo[4][8] = "是非、官灾、肠胃病";
    zaihuo[5][7] = "官灾、鼻疾、不利小孩";
    zaihuo[5][8] = "火灾、破财、是非、肠胃病";
    zaihuo[5][2] = "官非、金属所伤、因色致祸";
    zaihuo[5][1] = "父子不利、官灾";
    zaihuo[6][8] = "损丁、妻母不和、肠胃病";
    zaihuo[6][7] = "火灾、破财";
    zaihuo[6][1] = "官灾、刀伤";
    zaihuo[6][2] = "是非、口舌、因色致祸";
    zaihuo[7][5] = "损丁、鼻病";
    zaihuo[7][6] = "水灾、失财";
    zaihuo[7][4] = "是非、不利长子、破财";
    zaihuo[7][3] = "是非、因色致祸";
    zaihuo[8][6] = "损丁、水灾、血光";
    zaihuo[8][5] = "火灾、破财、是非";
    zaihuo[8][3] = "官灾、血光之灾";
    zaihuo[8][4] = "破财、官灾、足伤";

    jibing[1][3]="心火盛，肺病、咳嗽、吐血";
    jibing[1][4]=jibing[1][5]="肝胆之疾、目疾、手足损伤";
    jibing[1][6]="伤寒、肾病、子宫病";
    jibing[2][4]="手足损伤、目疾";
    jibing[2][3]="火伤、血疾、目疾";
    jibing[2][5]="肝病、肝伤";
    jibing[2][6]="伤寒、小产、女性经期不准";
    jibing[3][1]="肺病、头部疾患";
    jibing[3][2]="肺病、目疾、心脏病";
    jibing[3][8]="腹病、肠胃病、足病";
    jibing[3][7]="疮毒、小肠之疾患";
    jibing[4][2]="咳嗽、肺病";
    jibing[4][1]="肺病、头脑之疾";
    jibing[4][7]="疮毒、肠胃之疾";
    jibing[4][8]="胃病、皮肤病";
    jibing[5][7]="疮毒、粮尿";
    jibing[5][8]="腹病、股伤";
    jibing[5][2]="肺病、神经衰弱";
    jibing[5][1]="咳嗽、肺病、头痛、胃病";
    jibing[6][8]="肾病、胃病、小产";
    jibing[6][7]="胃病、肾病";
    jibing[6][1]="伤寒、肾病、子宫疾患";
    jibing[6][2]="肺病、肾病";
    jibing[7][5]="肠胃病、手脚之伤";
    jibing[7][6]="伤寒、肾病、小产";
    jibing[7][4]="中风、手足之疾患";
    jibing[7][3]="疮毒、血症";
    jibing[8][6]="伤寒、女性经期不准";
    jibing[8][5]="疮毒、脚病、腹病";
    jibing[8][3]="心脏病、血症";
    jibing[8][4]="疮毒、肺病、手足之疾";

    fqcw[1] = new int[]{0, 1278, 1278, 3, 73,83, 23, 1278,1278};
    fqcw[2] =  new int[]{0, 1278, 1278, 5, 75,85, 25, 1278,1278};
    fqcw[3] =  new int[]{0, 3, 5, 3456, 3456,3456, 3456, 37,6};
    fqcw[4] =  new int[]{0, 37, 57, 3456, 3456,3456, 3456, 7,67};
    fqcw[5] =  new int[]{0, 38, 58, 3456, 3456,3456, 3456, 8,68};
    fqcw[6] =  new int[]{0, 23, 25, 3456, 3456,3456, 3456, 2,62};
    fqcw[7] =  new int[]{0, 1278, 1278, 73, 7,8, 2, 1278,1278};
    fqcw[8] =  new int[]{0, 1278, 1278, 6, 76,86, 26, 1278,1278};

    yxp2[1] = new int[]{0,4,1,5,6,8,7,3,2};
    yxp2[2] = new int[]{0,1,4,6,5,7,8,2,3};
    yxp2[3] = new int[]{0,5,6,4,3,1,2,8,7};
    yxp2[4] = new int[]{0,6,5,1,4,2,3,7,8};
    yxp2[5] = new int[]{0,8,7,3,2,4,1,5,6};
    yxp2[6] = new int[]{0,7,8,2,3,1,4,6,5};
    yxp2[7] = new int[]{0,3,2,8,7,5,6,4,1};
    yxp2[8] = new int[]{0,2,3,7,8,6,5,1,4};

    yxp3[1] = new String[]{
        "生气位，为贪狼星，运气大好，身体健康、活力充沛、大旺人丁，是升职升官的催官位，小孩聪明的文昌位。如果大门、房、及灶向不在此，需借助风水用品来催吉",
        "综合--若在门窗位，适宜摆放貔貅头向外吸纳旺气",
        "财运--养鱼、放风水轮、安喷水池、放雾化盆景",
        "升职--马上封侯、玉印、文员要升职摆水晶玉或瓷文昌塔",
        "聪明--文昌塔",
        "添丁--麒麟送子、富甲一方的玉山、放花生瓜类、文昌塔",
        "化小人--金龙"};
    yxp3[2] = new String[]{
        "延年位，为武曲星，财运很好，延年益寿、身体健康、夫妻和谐，主管长寿桃花婚姻，旺财不及生气，门房灶宜在此方，没结婚男女宜睡延年方早得配偶，否则要催吉",
        "旺财--铜貔貅为旺财瑞寿，前置水金球，以土生金",
        "姻缘--粉红水晶杆、球、和合二仙雕塑、挂个人相片愈大愈好背面写上八字",
        "长寿--龟形饰物、玉雕寿桃"};
    yxp3[3] = new String[]{
        "天医位，为巨门星，财运不错，疾病痊愈、贵人相扶、健康长寿，主要是治病，即有天乙贵人相助，可在此向熬水煎药，或灶向于此",
        "化病--玉葫芦、木葫芦、玉灵芝",
        "招贵人--福禄寿三星、玉如意",
        "财运--三脚金蟾头向屋内、龙头龟"};
    yxp3[4] = new String[]{
        "伏位，为左辅星，财运小吉、运气中等、健康如常、家运平和，力量弱，趋平稳发展，适合打工人士，经商人士不宜此开门，又生气位主生男，伏位主生女",
        "添千金--紫水晶球或粉晶球、玉山",
        "财运--三脚金蟾头向屋内、安忍水"};
    yxp3[8] = new String[]{
        "祸害位，为禄存星，财运极差、多病损寿、横祸绝嗣、意外伤病，门房灶在此位，损丁破财",
        "化解--放一瓶安忍水、挂一个盛水木葫芦或铜葫芦、波浪形木板漆上黑灰蓝等色"};
    yxp3[7] = new String[]{
        "六煞位，为文曲星，破财败业、火灾失窃、健康甚差、容易招鬼，门房灶在此处要化解",
        "化解--屋内出现阴灵怪事放开光的玉避邪、各种疾病放五粒白玉、想进财则配合飞星布五鬼旺财局"};
    yxp3[6] = new String[]{
        "五鬼位，为廉贞星，财运不好、口舌淫荡、灾祸边边、身体多病，门房灶在此处要化解",
        "化解--水种植物、天然葫芦、八毛笔、木算盘"};
    yxp3[5] = new String[]{
        "绝命位，为破军星，财难积聚、官灾是非、争执被骗、盗贼失窃，门房灶此处最易招惹是非不易与人相处",
        "化解--铜版书、金龙、铜麒麟"};
  }

  public static final String[] dxsz = {"  ","东四宅","西四宅"};
  public static final String[] dxsm = {"  ","东四命","西四命"};
  public static final String[] dxsg2 = {"  ","东四卦","西四卦"};
  public static final int[] dxsg = {0,2,2,1,1,1,1,2,2};

  public static final String[] hj = {"  ","枪煞","冲背煞","斜枪煞","尖射煞","剪刀煞",
  "割脚煞","镰刀煞","刀斩煞","井字煞","环抱水","之字路","漩堂水","穿心煞","火煞","冲天煞",
  "声煞","刺面煞","卷帘水","御街水","冲射煞","悬崖屋","孤峰独秀","风煞","阴煞","背后有靠",
  "天斩煞","飞刃煞","尖射煞","擎拳煞","金字煞", "反光煞","孤阳煞","独阴煞","探头煞","断虎煞",
  "峤煞","光煞","虎强龙弱","龙强虎弱","龙虎抱","生局","煞局","泄局","财局","旺局",
  "天心十道"};
  public static final String[] hj1 = {"",
      "枪煞：一条直一条枪，宅前有直路或死巷相冲主健康衰退、血光之灾",
      "冲背煞：直路不冲前而冲后背，主小人缠绕、努力表现不为上司欣赏",
      "斜枪煞：直路斜冲本宅，主意外破财，左斜伤青龙即男丁，右伤白虎即女性",
      "尖射煞：二左右斜枪煞成三角形冲射，主因财失义破财多病",
      "剪刀煞：三条成Y或四条成X，而房位于剪刀口主破财伤丁意外受伤。放一对玉麒麟或石敢当化解",
      "割脚煞：住宅近高速公路，运气反复，财帛难积",
      "镰刀煞：天桥反弓劈来，主血光之灾或运气反复。有反弓路为小镰刀或印镰刀。可挂葫芦化解",
      "刀斩煞：路成L形辟来，凶小于镰刀，亦主伤人多意外",
      "井字煞：宅内住客运气反复，财来财去",
      "环抱水：宅前有路或河水环形包围，俗称玉带环腰或抱身水，主财运大顺或容易储蓄积蓄",
      "之字路：九曲入明堂，当朝宰相。主宅前路迂回曲折",
      "漩堂水：宅前方有圆盘路，为得明堂水，旺财帛，吉论。亦称四水归堂之局",
      "穿心煞：宅前方对电杆、交通指示牌或大树，主血光之灾、病痛、官灾及是非",
      "火煞：附近有电塔或发射塔等尖锐物件，主血光之灾、火灾、健康差",
      "冲天煞：近工厂大厦上有很多烟囱，主健康差、意外受伤",
      "声煞：附近有打樁声音等，主脾气暴躁",
      "刺面煞：面对石峰岩等山坡山丘，容易做出犯罪行为，或被盗窃",
      "卷帘水：大厦前是向下的斜坡，主财运差、孤寡",
      "御街水：宅前有山坡一级比一级低向自己流来，主财富滚滚，可变格为前方大厦一座比一座低流向自己",
      "冲射煞：宅前见一斜坡上一凉亭，主容易损丁，家人离散",
      "悬崖屋：卖屋莫买悬崖屋，提防家人会痛苦。主家计败退，家人容易发生灾祸",
      "孤峰独秀：宅建山上或比周围高出许多，主性格高傲孤僻没有贵人帮助，运气不稳",
      "风煞：阳宅四周孤独无靠，财运差，无贵人扶助",
      "阴煞：近山森林，主人多病，易招阴邪",
      "背后有靠：背后有山，主贵人扶持。半圆金形山主贵人带来官位，直高木主出文人或贵人带来名誉，波浪水主出智慧的人贵人带来财富，平顶山土主贵人带来财富，三角尖火大凶主血光官灾。须靠明山，若靠山石嶙峋等穷山则任何形皆凶",
      "天斩煞：宅前对两大厦之间一条狭窄空隙，主多病体弱，严重主血光之灾",
      "飞刃煞：宅前一大厦之墙角边，有点同刀斩煞，主健康差",
      "尖射煞：面对大墙角尖成45度相射，主血光之灾",
      "擎拳煞：宅前或窗前对一建筑物凸出，主血光之灾或胸部有毛病",
      "金字煞：宅前见一建筑物顶部成三角形，主血光之灾",
      "反光煞：宅前玻璃幕墙，犯之脾气暴躁、血光之灾",
      "孤阳煞：住宅近庙宇教堂等孤煞之地，主性格孤独，脾气暴躁",
      "独阴煞：近坟场、宾仪馆、医院等阴煞之地，主多暗病、运气差、常做噩梦",
      "探头煞：宅前一大厦，后一大厦稍高探出头，易犯强盗，出不良少年",
      "断虎煞：宅前右方对一人形大厦─┐,主招小人，是非",
      "峤煞：接近一比自己高得多的建筑物，犯之主容易受骗、上司挑剔、事业不成功，如在后则成靠山",
      "光煞：对面有霓虹灯招牌晚上被灯照射，主精神差、脾气暴躁",
      "虎强龙弱：右方有高大建筑物，主多是非小人",
      "龙强虎弱：左方有比自己高大的建筑物，主多贵人帮助、易受上司赏识",
      "龙虎抱：左右各一比自己略小建筑物，吉",
      "生局：对方五形生我，主工作顺利",
      "煞局：主工作不平稳，反覆",
      "泄局：主身体多病，财运耗退",
      "财局：劳而后财，主劳禄，但有一定之收获",
      "旺局：互相助旺，主工作与财位都很平稳，吉论",
      "天心十道：前朱雀、后玄武、左青龙、右白虎。后无楼宇，一般是主不得上司或长辈赏识和提携；左右没大厦，一般主下属阳奉阴违凡事要亲力亲为缺乏助力，明堂之外没有楼宇缺朝山，主财来财去财富难以积聚"
     };
}