package org.boc.db;

public class BaZiKu {
  private final String sep = "\r\n    ";
  public final String[][] bazi = new String[10000][10];
  {
    //甲
bazi[1] = new String[]{"1","1","2","12","6","6","4","4",
    "此造官遇长生，杀逢禄旺，巳亥虽冲破印，喜印木仍能生火，寅运合亥，化木生印，连登甲榜。"+sep+
    "庚辰辛巳制官服煞，失幡皂盖，出守大郡，名利两优。"};
bazi[2] = new String[]{"1","1","2","12","8","8","5","1",
    "此本篇罗状元命。金水伤官，本喜见官，而此则生于小阳春时节，未中藏火，不虞寒冷，"+sep+
    "亥未拱合，透出乙木，则佫官化为财矣。年时两子，仍是食神生财之局，惟日元太弱，"+sep+
    "运喜印比帮身。庚辰辛十五年，最为美境；戊寅、己卯二十年，究嫌财旺身弱。再者金水之局，"+sep+
    "本喜火暖，今原局虽不见官星，而运行东南阳暖之地，和煦之气，可以补助其不足。言运者必须参合研究之地。"};
bazi[3] = new String[]{"1","1","3","1","10","2","3","5",
    "甲丙皆不通根，伤官太轻，宜行食伤运以助财。戊寅己卯运，食伤之地最佳，庚辰非吉。"+sep+
    "此造惜无甲寅、乙卯、丙辰、丁巳等运以助之也。"};
bazi[4] = new String[]{"1","1","3","3","1","1","3","3",
    "身旺用食，两神成象，甲木月令建禄，而丙火亦自寅中透出，此所以为水火通明也。然无子水印绶，"+sep+
    "则火燥木枯。子水者，取以调候，非以为用也。运转南方，宜其大魁天下；庚午煞不通根，丙火回克，"+sep+
    "不足为害；辛金合丙，不免晦滞；壬申煞印之地非吉矣。"};
bazi[5] = new String[]{"1","1","3","3","6","6","8","8",
    "此造天干木生火，火生土，土生金，地支水生木，木生火，火生土，土生金。且由支而生干，"+sep+
    "从地支则以年支子水生寅木为始，至时干辛金为终；从天干亦以年支子水生甲木为始，至时干辛金为终。"+sep+
    "天地同流。正所谓始其所始，终其所终也，是以科甲联登，仕至极品，夫妇齐美，子孙衍，科甲不绝，寿至九旬。"};
bazi[6] = new String[]{"1","1","3","3","6","12","8","8",
    "春土坐亥  财官太旺，最喜独印逢生。财藏生官，财印绶之元神愈旺；气贯生时 ，而日主之气不薄；"+sep+
    "更妙连珠生化，尤羡运途不悖。所以恩分雕绵，宠锡金莲，地近清楚，职居津要。"};
bazi[7] = new String[]{"1","1","4","4","6","12","5","5",
    "此杨增新之造也。亥卯会合，年透官星，好在子水财星生官，官生印，而印生身，"+sep+
    "财官印得纯而不杂也。可惜时上少一点金，及身而止，不免后嗣艰耳。"};
bazi[8] = new String[]{"1","1","5","5","7","9","9","7",
    "此造以俗论之，干透三奇之美，支逢拱贵之荣，且又会局不冲，官星得用，主名利双收。"+sep+
    "然庚申生于季春，水本休囚，原可用官，嫌其支会水局，则坎增其势，而离失其威，官星必伤，"+sep+
    "不足为用。欲以强众敌寡而用壬水，更嫌三奇透戊，枭深夺食，亦难作用。甲木之财，本可借用，"+sep+
    "疏土卫水，泄伤生官，似乎有情，不知甲木退气，戊土当权，难以疏通。纵用甲木，亦是假神，不过庸碌之人。"+sep+
    "况运走西南甲木休囚之地，虽有祖业，亦一败而尽，且不免刑妻克子，孤苦不堪。以三奇拱贵等格论命，而不看用神者，皆虚谬耳。"};
bazi[9] = new String[]{"1","1","8","8","8","10","9","5",
    "论财篇汪学士命，用伤化劫为用者也。盖辰酉合金，生 于六月，土燥金脆。子未虽相害，"+sep+
    "而润土生金，未为不美， 兼以生财，故此造之用伤官，实兼调候通关之意也。财运最 美，"+sep+
    "食伤亦佳，比劫亦可行。丁火七煞，合去壬伤，为最不 宜。官星丙火合辛，印运制伤，皆为破用，非所宜也。"};
bazi[10] = new String[]{"1","1","9","9","6","12","8","8",
    "虽月令伤官，而子申合局，伤化为财，作财旺生官论，不作伤官用官论。行运官印帮身为美。财已旺，"+sep+
    "不宜再见，伤官亦不相宜。此本篇单丞相造也。"};
bazi[11] = new String[]{"1","3","2","12","2","4","10","8",
    "此木局全，混一寅字，然四柱无金，其势从强，谓深得一方秀气。少年科第，惟庚辰辛巳运，"+sep+
    "虽有癸水之化，仍不免刑丧起倒，仕路蹭蹬。至六旬外，运走壬午癸未，由县令而迁司马。履黄堂而升观察，"+sep+
    "直如扬帆大海，谁能御之！由此观之，从强之木局，东南北运皆利，惟忌西方金运克破耳。"};
bazi[12] = new String[]{"1","3","3","3","7","3","5","3",
    "寅中甲丙戊并透，然地支全寅，甲木当旺，当以从财为用。若地支寅午会局，则以丙火为用矣。"};
bazi[13] = new String[]{"1","3","4","4","1","5","3","3",
    "支全寅卯辰，东方一气，化神者，丙丁也。发泄菁华，少年科甲，早遂仕路之光；行财地，"+sep+
    "得过且过有食伤化劫之功；行金运，又得丙丁回克之能；交壬破局伤秀，降职归田不禄。"};
bazi[14] = new String[]{"1","3","4","4","2","8","4","12",
    "此亦木局全，混一寅字，取丁火食神秀气，非前造从强论也。至巳运，丁火临官，登科发甲；"+sep+
    "庚午辛未，南方金败之地，不伤体用，仕途平坦；壬申，木火皆伤，破局，死于军中。前则从强，"+sep+
    "南北皆利；此则木火，西北有害。由此两造观之，局混方之无害也。"};
bazi[15] = new String[]{"1","3","4","4","2","12","10","8",
    "此方局齐来，得月干丁火独透，发泄菁英，何其妙也。惜乎时干癸水透露，通根亥支，"+sep+
    "紧伤丁火秀气，谓干头反复，所以一衿尚不能博，贫乏无子。设使癸水换一火土，名利皆遂矣。"};
bazi[16] = new String[]{"1","3","4","4","5","5","6","8",
    "此木方全，搭一未字为混，然无未字，则日主虚脱，且天干甲木透出作杀耑不作官，必要未字日主气贯，身杀两停，"+sep+
    "名利双辉。鼎甲出身，仕至极品，可知方混局之无害也。"};
bazi[17] = new String[]{"1","3","5","5","3","3","3","9",
    "此坐下印缓，生于季春，印气有余，又年逢甲寅，则太过矣。土虽当令，而木更坚，喜其寅申逢冲，"+sep+
    "财星得用，第嫌比肩盖头，冲之无力。早年运走南方，起倒异常；至壬申癸酉二十年，申冲寅木，"+sep+
    "克去比肩，创业兴家。此谓乘印就财也。"};
bazi[18] = new String[]{"1","3","5","5","9","5","9","3",
    "此造五杀逢五制，土虽当权，木亦雄壮，幸日主两坐库根，又得比肩匡扶。壬申运，日主逢生，"+sep+
    "冲去寅木，名登桂籍，雁塔高标；接连癸酉二十年，由县令履黄堂。名利裕如。"};
bazi[19] = new String[]{"1","3","7","7","2","4","3","1",
    "专禄日主，时支子水生之，年干甲木，亦坐禄旺，用庚金则火旺无土，坐干火地，用丙火则子冲去其旺支，"+sep+
    "即或用火，亦无安顿之运。所以一败如灰，至乙亥运，水木齐来，竟为乞丐。"};
bazi[20] = new String[]{"1","3","7","7","7","7","5","9",
    "此本篇贾平章造，丁巳同禄于午，然寅午会局，刃化为印。年时甲寅，七煞太旺，喜申冲寅，庚制甲，裁制其太过；"+sep+
    "更喜申中壬水润泽，使火不炎，土不燥。虽月令阳刃，而归入煞刃格，稍嫌牵强耳。运行壬申癸酉最美。"};
bazi[21] = new String[]{"1","3","9","9","10","6","10","12",
    "秋水通源，金当令，水重重，木囚逢冲，不足为用。火虽休而紧贴日支，况秋初余气未息，用神必在巳火。"+sep+
    "巳亥逢冲，群劫纷争，所以连克三妻，无子。兼之运走北方水地，以致破耗异常；至戊寅己卯，运转东方，"+sep+
    "喜用合宜，得其温饱；庚运制伤生劫，又逢酉年，喜用两伤，不禄。"};
bazi[22] = new String[]{"1","5","4","4","1","1","5","5",
    "甲子日生卯月，地支两辰，是木之余气也，又辰卯东方，子辰拱水，木太旺者似金也，以丁火为用。"+sep+
    "至巳运，丁火临旺，名列宫墙；庚辛两运，南方截脚之金，虽有刑耗，而无大患；未运克去子水，食廪天储；"+sep+
    "午运子水冲克，秋闱失意；壬申运金水齐来，刑妻克子，破耗多端；癸运不禄。"};
bazi[23] = new String[]{"1","5","6","6","5","5","6","4",
    "戊土生于巳月，日主未尝不旺，然地支两辰，木之余气亦足。喜其合杀留官，官星坐禄，"+sep+
    "更妙运途生化不悖。所以早登云路，掌典籍而知制诰，陪待从而应传宣也。"};
    bazi[33] = new String[]{"1","7","1","11","4","10","10","4",
        "此梅兰芳先生命也。全局木火太旺。喜日坐酉金。时得癸水。财杀清粹。兼带贵人文昌。"+sep+
        "自宜艺术独精。誉满天下。革中国之剧才。作梨园这砥柱。令界大王。当之无愧。惜行运未能媲美命局。"+sep+
        "所以仅享盛名。而无权爵。然晚来庚运资杀。空前绝后。恐不以令官终其身。变化飞腾。未可限量焉。"+sep+
        "今岁乙亥。印得长生。杀得旺地。现赴苏俄演剧。必须一番轰烈。宣扬中国文化。灌输东方艺术。所当厚望于君耳。"};

bazi[24] = new String[]{"1","7","4","4","1","7","4","4",
    "此造木火各半，两气成象，取丁火伤官，秀气为用。四柱金水全无，纯粹可观。巳运丁火临官，"+sep+
    "南宫奏捷，名高翰苑；庚运官杀混局，降知县。夫南方之金，尚有不足，将来西方之水，难言无咎。"};
bazi[25] = new String[]{"1","7","4","4","10","2","3","5",
    "同一身轻，而上造为食重财轻，此造为食轻财重，而身弱则一也。故皆以帮身运为喜。帮身之中，"+sep+
    "食重喜印，财重喜劫。此造得意，必在壬申癸酉运中。又两造比较，沈造格局清，此造格局较杂，"+sep+
    "贵贱高低之分，全在清浊纯杂之间。以其格局夹杂，虽在佳运，不过百里之尊而已。"};
bazi[26] = new String[]{"1","7","10","10","7","3","5","3",
    "月令阳刃，用午火官星制刃，而透癸水伤官破格，喜时上戊土合去癸水，官刃依然成格，"+sep+
    "与上节刃用官相同也。寅午会局，才生官旺，喜行印绶比劫之地，而忌伤食，子水冲午，决非佳运也。"};
bazi[27] = new String[]{"1","9","1","11","1","3","1","11",
    "年支申金，冲去日主寅木，加以戌土乘权重见，生金助杀，谓地支不顾天干。夫四甲一寅，似乎强旺，"+sep+
    "第秋木休囚，冲去禄神，其根已拔，不作旺论。故寅卯亥子运中，衣食颇丰，一交庚辰，杀之元神透出。"+sep+
    "四子俱伤，破家不禄。干多不如支重，理固然也。"};
bazi[28] = new String[]{"1","9","2","12","3","11","7","3",
    "寅戌拱午而透丙，即是火局，寅亥又合木，煞化为印，甲乙并透，印重身强，取财损印为用，"+sep+
    "不以煞论也。戊寅运食伤生财自是美运；寅卯印太旺不利；最佳者为庚辰辛十五年，巳运刑冲合并见，"+sep+
    "不免多事。壬运露煞不忌，而以劫财之乡为最忌也。"};
bazi[29] = new String[]{"1","9","3","1","7","5","5","3",
    "此寒金冷水，木凋土寒，若非寅时，则年月木火无根，不能作用矣，所谓寒虽甚，要暖有气也。"+sep+
    "由引论之，年得者寅也，地气上稓，木火绝处逢生，一阳解冻。然不动丙火高亦不发，妙在寅中遥中，"+sep+
    "谓之动，动则生火矣。凡四柱紧冲为克，遥冲为动，更喜运走东南，科甲出身，仕至黄堂，所谓得气之寒，遇暖而发，此之谓也。"};
bazi[30] = new String[]{"1","9","9","9","2","6","5","3",
    "此为论正官篇薛相公命，月令正官，兼用财印，喜其财印之间，中隔乙木，两不相碍，"+sep+
    "故可兼用也。然秋木凋零，官逢生逢禄，财亦逢生逢禄，财官太旺，所谓身稍轻，宜取助身者也。"+sep+
    "酉运七煞，泄财生印最美，甲运逢身亦吉。若甲申年易以己酉年，行甲运合劫破印，即不美矣。"+sep+
    "所谓因闲神之配合而喜忌不同也。 戌运财旺；然喜其不伤印，故无碍也。乙亥之后，运行北方印地，"+sep+
    "但亥运逢四冲，未必无风浪，所谓因地支配合而异其喜忌也。戌运财星破印，寅运两寅冲官，皆不为美，殆至此终矣。"};
bazi[31] = new String[]{"1","11","3","3","5","3","3","5",
    "戊寅日元，生于立春十五日后，正当甲木司令，地支两寅紧克辰戌之土，天干甲木，又制日干之戊，"+sep+
    "似乎煞旺身弱。然喜无金，则日元之气不泄，更妙无水，则丙火之印不坏，尤羡铁身透丙，化杀生身。"+sep+
    "由甲傍而悬青绶，从副尹以跻黄堂，名利双收也。"};
bazi[32] = new String[]{"1","11","3","3","5","5","7","9",
    "戊辰日元，生于立春后六日，正戊土司令，月透丙火，生化有情，日支坐辰，通根身旺，又得食神制杀。"+sep+
    "俗论比之，胜于前造，不知嫩木寒土皆喜火，况杀既化，不宜再制。所嫌者，申时不但日主泄气，而且丙火临绝，"+sep+
    "以致书香难遂，一生起倒不宁，半世刑丧不免也。"};






//乙
bazi[1001] = new String[]{"2","2","1","9","1","9","8","8",
    "此造地支土金，木无盘根之处，时干辛金，元神发透，木太衰者，似水也，初运癸未壬午，生木制金，"+sep+
    "刑丧早见，荫疪难丰；辛巳庚辰，金逢生地，白手发财数万；己卯运土无根，木得地，遭回禄，破财万余；至寅而亡 。"};
bazi[1002] = new String[]{"2","2","4","12","6","12","2","12",
    "赵侍郎造。喜财藏支而不透，天干煞印相生，以 印化煞为用。甲乙运官煞生印甚美，申酉运虽食伤生财党煞，"+sep+
    "而原局煞有印化，虽非吉运，亦无碍也。癸未运吉，壬运合丁，化煞破用，所谓逢财必忌也。"};
bazi[1003] = new String[]{"2","2","6","4","2","12","9","7",
    "此己土之财，通根在丑，得禄于午，似乎身财并旺，不知己土之财，比肩夺去，丑土之财，卯木克破，午火食神，"+sep+
    "亥水克之。壬水盖之，无从引化，所谓上下无情也。初逢戊寅丁丑，财逢生助，遗业颇丰；一交丙子，冲去午火，"+sep+
    "一败而尽；乙亥运，妻子俱卖，削发为僧，又不守清规，冻饿而死。"};
bazi[1004] = new String[]{"2","2","6","4","2","12","10","8",
    "春木成局，四柱无金，为曲直仁寿格，乃段执政祺瑞命造也。"};
bazi[1005] = new String[]{"2","2","8","6","6","6","7","7",
    "乙木无根，己丑相会，庚辛并见，七煞孤单无助，不能为用；克泄并见，藉印通关，是以印为用也，"+sep+
    "故以身旺印绶为喜。庚金泄秀，食伤自为美运；逢甲为官，合已混煞为嫌，故非吉运。原局火土亢燥，"+sep+
    "遇水则逆其性，故亦不吉。此乃偏枯之造，不可以为例，所喜者乙丑、己巳、庚午同出一旬耳。"};
bazi[1006] = new String[]{"2","2","9","7","3","11","1","7",
    "此丙戌日元，月时两刃，壬水无根，又逢木泄。火太旺者，似水也。初运庚辰辛巳，金逢生地，"+sep+
    "孔怀无辅助之人，亲党少知心之辈；己卯得际遇，戊寅全会火局，及丁丑二十年，发财四五万，至子运而亡。"};
bazi[1007] = new String[]{"2","4","3","11","10","10","3","5",
    "此徐东海命造也。初视之，财得食生而已，然癸贵在卯，丙贵在酉，辰卯酉戌，东西对峙，两合解冲，"+sep+
    "水火相争，而得乙卯贵人，调和其间，宜其终身善为和事老也。"};
bazi[1008] = new String[]{"2","4","4","12","4","8","7","11",
    "化官为印而透财，正官章金状元命也。亥卯未三合，官为印，乙木透出，身旺印重。用财损印，"+sep+
    "时逢庚戊，财星有根。初行申酉西方财地，甲不通根，乙从庚化，自为美运。癸未之后，运转南方，"+sep+
    "日元太旺，壬癸官煞泄财生印，亦不为美。此所谓身旺佩印，喜食伤财乡也。"};
bazi[1009] = new String[]{"2","6","4","4","8","4","2","8",
    "此春金虚弱，木火当权，年印，月杀，未得相通，时支未土，又会卯化木，只有生杀之情，而无辅主之意，"+sep+
    "兼之一路运途无金，一派水木，仍滋杀之根源，以致破败祖业。一事无成，至亥运会木生杀而亡。"};
bazi[1010] = new String[]{"2","8","1","9","3","9","7","3",
    "寅中丙火长生，甲木得禄，而庚金禄于中，甲庚并透而隔丙火，此为财印不相碍，然究嫌身轻印弱。"+sep+
    "庚金秉令而旺，故运帮身为美，所以最喜印旺也。然何以又喜官煞耶？盖财生官而官生印，亦通关之意也。"};
bazi[1011] = new String[]{"2","8","6","4","7","3","8","6",
    "乙己财印并透而相并，则财破印，日元庚金又弱，当以劫为用。运以劫财扶身为美，印运亦佳。"+sep+
    "官煞可行，食伤 财运则不相宜。虽四柱格局清，而有相当之成就，不过小富而已，不能贵也。"};
bazi[1012] = new String[]{"2","10","5","3","9","7","7","11",
    "壬水生于立春二十二日，正当甲木真神司令，而天干土金并透，地支通根戌酉，此谓真神失势，"+sep+
    "假神得局，用以庚金化煞，法当以假作真，纯粹可观。虽嫌支全火局。克金灼水，喜其火不透干，"+sep+
    "又得戊土生化更妙。运走西北，所以早登云路，甲第蜚声，仕至封疆，有利民济物之志，禀秀德真儒之器。"+sep+
    "总嫌火局为病，仕路未免起倒耳。"};
bazi[1013] = new String[]{"2","10","5","3","10","10","10","2",
    "癸水生于寅月，正水木伤官。地支印星并旺，酉丑拱金，必以寅木为用，才能有余。"+sep+
    "乙亥运，木逢生旺，中乡榜；甲戌癸运，出仕县令；酉运支逢三酉，木嫩金多，诖误落职。"+sep+
    "前造与此造皆因少火，有病无药之故，若有火虽行金地，则无大患矣。"};
bazi[1014] = new String[]{"2","10","7","5","1","7","5","5",
    "天干乙从庚化，地支辰合酉来，财生煞旺，当以午中丁火 制煞为用，财当煞攻身，岂可为用乎？"+sep+
    "喜得生于辰月，又得 辰时，甲木余气犹存，然究嫌身弱。运行寅卯身旺之地，丙 丁制煞之方，"+sep+
    "宜其贵也。乙亥甲三运，亦帮身助旺，唯子运 冲午，恐有出死入生之难，虽子辰相会，恐未易解。"+sep+
    "身弱宜 印，而制煞之格不宜印地者，恐其制伤夺食也。"};
bazi[1015] = new String[]{"2","10","8","6","5","7","3","5",
    "此火土当权，乙木无根，以辛金为用。辛丑年入泮，后因运程不合，屡困秋闱。至丑运暗拱金局，"+sep+
    "科甲连登；丙子乙亥，地支之水，本可去火，天干木火不合，所以仕途蹭蹬，未能显秩耳。"};
bazi[1016] = new String[]{"2","12","2","10","2","4","4","2",
    "为身强煞旺，用食制煞之格也。运行南方，食神得地，金水不通根为美。但壬运合丁去食，巳运会酉丑煞强，"+sep+
    "必有不足，庚辰合乙酉助煞，均非美运也。"};
bazi[1017] = new String[]{"2","12","6","4","1","9","2","12",
    "此湖北都督萧耀南之造。月令阳刃，申金制之，煞刃格成也。申中庚金，见卯中乙木暗合，"+sep+
    "气协情和，正所谓甲以乙妹妻庚，凶为吉兆是也。阳刃合煞，煞不克身，至甲运而开府两湖；戌运生金合卯，格局尽破，不禄。"};
bazi[1018] = new String[]{"2","12","6","4","4","10","9","3",
    "此本篇临淮侯命也，亦是用印制食护官，与上制伤相同。 所异者食伤运为忌。朱造行食伤运，"+sep+
    "有印回克，此造则乙印在年，救护有所不及也。丑运虽会酉化金，而无防碍，盖官星不旺，且与印相隔，"+sep+
    "财虽旺而不破印，并解酉之冲 为美也。子亥官乡，甲乙印地，均为美运。"};
bazi[1019] = new String[]{"2","12","7","5","1","11","9","9",
    "以俗论之，甲以乙妹妻庚，凶为吉兆，含合忘冲，较之前造更佳，何彼则翰苑，此则寒袷？"+sep+
    "不知乙庚合而化金，反助其暴。彼则甲辰，辰乃湿土，能生木，此则甲戌，戌燥土不能生木；"+sep+
    "彼则申辰拱化，此则申戌生杀；彼则甲木进气，而庚金退，此则庚金进气，而甲木退。推此两造，"+sep+
    "天渊之隔，进退之机，不可不知也。"};
bazi[1020] = new String[]{"2","12","7","5","5","11","4","6",
    "戊戌日元，生于辰月巳时，木退气，土乘权，印绶重逢。用官则被庚金合坏，用食则官又不从化，"+sep+
    "而火又克金，无奈何而用财，又有巳时遥冲，又不当令；若邀庚金生助，贪合忘生，且遥隔无情，"+sep+
    "所以起倒不一，幸而财官尚有余气，至乙亥运，补起财官，遂成小康。"};
bazi[1021] = new String[]{"2","12","10","8","6","12","8","8",
    "己土日元，通根月令，年上乙木微弱，乃用神太弱而扶之也。交通总长曾毓隽造。"};






//丙
bazi[2001] = new String[]{"3","1","1","7","8","12","8","4",
    "若官格杂煞而去官留煞，不能如是之清矣。子冲午而克煞，是去煞留官也。"};
bazi[2002] = new String[]{"3","1","2","8","3","5","2","8",
    "丙日未月，火土伤官。四柱无金，子水枯干，未土为用。第嫌乙木并透根深，功名难遂。"+sep+
    "初运丁酉丙申，制化乙木，财喜称心；戊戌十年，熙熙攘攘，日炽日昌；己运土无根，木回克，刑耗并见；"+sep+
    "一交亥运，木得生火，逢劫，得恶病而亡。"};
bazi[2003] = new String[]{"3","1","3","9","3","1","3","9",
    "两申两子，水逢生旺，金作水论；天干四丙，地支无根，离衰坎旺，须以木运和之也。惜乎五行不顺，"+sep+
    "五十年西北金水之地，故艰难险阻，刑伤颠沛；五旬外运走壬寅，东方木地，财进业兴，及癸卯甲寅，发财数万。"};
bazi[2004] = new String[]{"3","1","5","11","9","1","7","1",
    "月令七煞，地支阳刃，煞刃格成也。是干透庚，偏印化煞，化煞本为美事，而在煞刃格，需要七煞抑刃，"+sep+
    "则偏印为破格，因成得败矣。"};
bazi[2005] = new String[]{"3","1","6","12","2","2","9","7",
    "此造初看，一无可取，天干壬丙一克，地支子午遥冲，且寒木喜阳，正遇水势泛滥，火气克绝，"+sep+
    "似乎名利无成。余细推之，三水二土二火，水势虽旺，喜无金；火本休囚，喜有土卫，谓儿能救母；"+sep+
    "况天干壬水生乙木，丙火生己土，各立门户，相生有情，必无争克之意。地支虽北方，然喜己土原神透出，"+sep+
    "通根禄旺，互相兹护，其势足以止水卫火，正谓有病得药。且一阳后万物怀胎，木火进气，以伤官秀气为用。"+sep+
    "中年运走东南，用神生旺，必是甲第中人。交寅，火生木旺，运登甲榜，入翰苑，是以青云直上。"};
bazi[2006] = new String[]{"3","1","6","12","2","10","9","7",
    "此全酉、亥、子西北之阴寒。寒木更宜向阳，以丙火为用，壬水即其病也。然喜壬水远隔，与日主紧贴，"+sep+
    "日主本衰，未尝不喜其生，又有己土透干，亦能砥定中流。且喜天干水木火土，各立门户，相生有情；"+sep+
    "地支午火紧制七杀，年月火土，通根禄旺。更喜行运东南阳暖之地，不但四柱有情，而且行运光亨，"+sep+
    "早年联登甲第，仕至封疆，皆阴阳配合之妙也。"};
bazi[2007] = new String[]{"3","1","6","12","3","3","5","1",
    "丙火生于孟冬，又逢两子，天干离衰，地支坎旺，用寅木以升之也。至壬寅，东方木地，采芹折桂；"+sep+
    "卯运出仕，一路运走东南，仕至观察。"};
bazi[2008] = new String[]{"3","1","6","12","8","10","6","12",
    "此造以俗论之，寒金喜火，金水伤官喜见官，且日主专禄，必用丙火无疑。不知水势猖狂，"+sep+
    "病窃去命主无元神，不但不能官，即或用官，而丙火全无根气，必须用己土之印，使其止水生金卫火。"+sep+
    "丙入亥宫临绝，欲使丙火生土，而丙火先受水克，焉能生土？所以己土反被水伤，真神无情，假神虚脱。"+sep+
    "初运庚子辛丑。比劫帮身，叨荫之福，衣食颇丰：壬运丁艰；一交寅运，东方木地，虚土受伤，破荡祖业，"+sep+
    "刑妻克子，出外不知所终。"};
bazi[2009] = new String[]{"3","1","8","4","9","1","10","4",
    "壬子日元，支逢两刃，干透癸辛，五行无土，年干丙火临绝，合辛化水，最喜卯旺提纲，泄其菁英，"+sep+
    "能化劫刃之顽。秀气流行，为人恭而有礼，和而中节。至甲运，木之元神发露，科甲连登；"+sep+
    "午运得卯木泄水生火，及乙未丙运，官至郡守，仕途平顺。以俗论之，子卯为无礼之刑，且伤官羊刃逢刑，"+sep+
    "必至傲慢无礼，凶恶多端矣。"};
bazi[2010] = new String[]{"3","1","9","5","9","9","2","6",
    "此财政部长王克敏造也。壬生三月，本为墓地，戊土七煞秉令，然辰中不透戊而透壬乙，"+sep+
    "申子辰三合水局，则土旺变为水旺， 春木余气，泄水之旺气，丙火又得禄于巳，变为伤官生才格。"};
bazi[2011] = new String[]{"3","3","1","7","3","11","2","8",
    "支全火局，木从火势，格成炎上。惜木旺克土，秀气有伤，书香难就，武甲出身，仕至副将。行申酉运，"+sep+
    "运亦有戌未之化，所以无咎；亥运，幸得未会寅合，不过降职；交庚子，干无食伤，支逢冲激，死在军中。"};
bazi[2012] = new String[]{"3","3","1","7","3","7","10","6",
    "此火长夏令，月支坐刃，年支逢生，时支得禄，年月两支，又透甲丙，烈火焚木，旺之极矣，"+sep+
    "一点癸水熬干，只得从其强势。运逢木火土，财喜频增；申酉运中 ，刑耗多端；至亥运，激火之烈，"+sep+
    "家业破尽而亡。所谓旺极者，抑之反激而有害也。"};
bazi[2013] = new String[]{"3","3","5","11","8","10","5","1",
   "官露印重，官之气尽泄于印，身旺印强，其佳处 全在时上子水，泄金之秀，昌当以金水伤官取用也。"+sep+
   "且 其金水伤官，并不喜见官星，盖生于九月，未届金寒水 冷之时，而原局已有丙火暖局，不必再行火运矣。"+sep+
   "既以 金水伤官为用，自以财及食伤运最利，比劫运亦可行。 此造从亥至辰五十五年，一路金水木运，诚不易得也。"};
bazi[2014] = new String[]{"3","3","5","11","9","11","8","2",
    "本篇何参政命造，日主弱而煞重，以时上辛印化煞为用，妙在丙财生煞而不破印，两不相碍，"+sep+
    "为煞印有情也。以庚子辛丑为最美，壬寅、癸卯、甲辰亦吉。盖不伤印，总无妨碍也。"};
bazi[2015] = new String[]{"3","3","7","3","1","9","2","2",
    "甲木生于立春后四日，春初木嫩，天气寒凝，日主坐申，月透庚金，丑土贴生申金，木嫩金坚，用火以攻之。"+sep+
    "喜得年于透丙，三阳开泰，万象回春，何其妙也！初运辛卯壬辰，有伤丙火，蹭蹬芸窗；癸巳运转南方，"+sep+
    "丙火禄旺，纳粟入监，运捷南宫；甲午乙未，宦海无波，申运不禄。"};
bazi[2016] = new String[]{"3","3","10","6","10","8","9","11",
    "论财篇林尚书造。寅午戌为火局，午易为巳，虽不成局， 而有会合之意，未又暗合午火，"+sep+
    "地支财旺而透丙，固当以财 为用也。但财旺身轻，运宜劫印扶身之地。早年甲午乙未， 必然困苦；"+sep+
    "丙申之后，气转西北，火不通根，印绶得地，其贵宜矣。"};
bazi[2017] = new String[]{"3","5","2","8","9","7","10","4",
    "此火土当权，又逢木助，五行无金。水太衰者，似金也。初交丙申丁酉，盖头是火，使申酉不能生水，"+sep+
    "财喜并旺；戊戌运中，家业饶裕；己亥土无根，还喜支会木局，虽有破耗而无大患；一交庚子，家破人亡。"};
bazi[2018] = new String[]{"3","5","3","9","3","7","9","5",
    "丙坐午刃，申辰拱合，而透壬，固弃财而用煞矣。然 其佳处，全在午刃，身强方能敌煞也。"+sep+
    "壬水生申，为秋水 通源，用神进气，运行己亥、庚子、辛丑、壬寅金水之地， 煞所以贵也。"};
bazi[2019] = new String[]{"3","5","4","10","7","7","5","3",
    "此造杀逢生，官得禄，喜其秋金秉令，更妙辰土泄火生金，不失中和之象；尤喜运走北方水地。"+sep+
    "庚子运冲去官根，鹿鸣方宴饮，雁塔又题名；辛丑壬寅运，横琴而歌解愠，游刃而赋烹鲜。"};
    bazi[2020] = new String[]{"3","5","7","3","2","4","4","12",
        "此支类东方，火明木秀，最喜丙火紧克庚金之浊，然春初木嫩，必得亥时生助。为人风流潇洒，学问渊深。"+sep+
        "丁亥生木助火，采芹攀桂；巳运南宫报捷，名高翰苑；午运拱寅合卯，采梁栋于邓林，是难哲匠，搜琳琅于瑶圃；"+sep+
        "爰藉宗工；至酉，乙木无根，金得地，冲破东方秀气，犯事落职，若无亥水化之，岂能免大凶！"};
        bazi[2036] = new String[]{"3","5","7","3","3","7","9","5",
            "此造财绝无根，官又无气，兼之运走东南之地，幼年丧父，依母转嫁他姓；"+sep+
            "数年母死，牧牛度日，稍长则卖力佣工；后双目失明，不能佣作，求乞自活。"};

bazi[2021] = new String[]{"3","5","8","2","7","5","3","1",
    "此造以俗论之，以为寒金喜火，干透两丙，独杀留清，推其木火运中，，名利双全，少右支中重重湿土，"+sep+
    "年干丙火，合辛化水，时干丙火无根，只有寒湿之气，并无生发之意，只得用水，不能用火矣。所以初运壬寅癸卯，"+sep+
    "制土卫水，衣食颇丰；天地丙午丁未二十年，妻子皆伤，家业破尽。削发为僧。"};
bazi[2022] = new String[]{"3","5","8","4","2","12","7","5",
    "乙亥日元，坐下逢生，又月令建禄归垣，足以用财。喜丙辛金弱，而去乙庚，木旺不从。"+sep+
    "乡榜出身，至丙申丁酉，火盖天干，未能显秩；究竟方金地，亦足以琴堂解愠，花院征歌也。"};
bazi[2023] = new String[]{"3","5","8","4","7","9","4","2",
    "此造春金虽不当令，喜其坐禄逢印，弱中变旺；丙辛一合，丁火独清，不但去杀，而且去劫，"+sep+
    "财无劫夺，官有生扶。尤妙运走东南木火，所以早遂表钱之选，兆人镜之芙蓉，作春官之桃李也。"};
bazi[2024] = new String[]{"3","5","10","6","2","2","3","1",
    "此木火伤官，印绶通奶禄支，格局未尝不美。虽嫌财星坏屯，而丑辰皆湿土，能蓄水晦火。"+sep+
    "惜乎运途无水，以致一介寒儒，至申运火绝水生，名列泮宫，后九赴秋闱不捷。"};
bazi[2025] = new String[]{"3","5","3","9","8","4","3","9",
    "三丙争合一辛，又不能化。多夫之象，女命最忌。"};
bazi[2026] = new String[]{"3","7","5","11","3","7","5","11",
    "此火土各半，两气成象，取戌土食神，秀气为用。辛丑运湿土晦火，秀气流行，登乡榜；壬运壬年，"+sep+
    "赴会试，死于都中，盖水激丙火，则火灭也。如两戌换以两辰，不致燥烈，虽逢水运，亦不至大凶也。"};
bazi[2027] = new String[]{"3","7","7","3","3","7","7","6",
    "此本篇赵知府造。寅午一合，印化为劫，不以印论，用庚金之财，生癸水之官，不易之法。"+sep+
    "唯财官太轻，喜行金水旺地。壬辰癸十五年最美，丙午日元坐刃，壬运七煞助制刃，不以为忌也。"+sep+
    "巳运之后，一路木火之地，恐难行矣。"};
bazi[2028] = new String[]{"3","7","7","3","9","7","3","7",
    "逊清宣统造，印比皆无根，则不得不从。"};
bazi[2029] = new String[]{"3","7","10","6","1","1","3","3",
    "木火伤官用印，亦调候之意。印轻则专用印劫，如此造癸印得禄，气象中和，故丙申丁酉皆为美运。"+sep+
    "若戊戌财运，破印恐不能免也。"};
bazi[2030] = new String[]{"3","9","5","11","4","4","2","6",
    "此火土伤官，劫印重叠，旺可知矣，以申金财星为用。遗业本丰，辛丑壬运，经营获利，"+sep+
    "发财十余万；至寅运，金临绝地，劫遇长生 ，又寅申冲破，所谓旺者冲衰衰者拔，不禄宜矣。"};
bazi[2031] = new String[]{"3","9","7","3","7","9","8","6",
    "此造天干三透庚辛，地支两坐禄旺，丙火虽挂角得禄，无如庚辛元神透露，非火之禄支，"+sep+
    "是金之长生，用财滋杀明矣。辰运木之余气，采芹生色；巳运火之禄旺，科甲联登；甲午乙未，"+sep+
    "木火并旺，仕至藩臬。若以八字观之，此造不及前造，只因前造运行西北，此造运走东南。"+sep+
    "富贵虽定于格局，穷通全在运限，所谓命好不如运好？，信然也。"};
bazi[2032] = new String[]{"3","11","4","10","7","9","9","7",
    "此丁壬合官煞也，合官则煞清而纯。愈现其美；煞重，运宜制煞之乡，身旺亦美。但戊已印绶则不为吉，"+sep+
    "因其克制壬水，去春取清之物也。若壬水不透；而用官煞，则印绶为美运矣。此其不同之点也。"};
bazi[2033] = new String[]{"3","11","5","11","8","8","9","5",
    "此造与上张造不同之点，张造子水在支，酉金下生，戊 不能克，此造伤官透干，为印所制，"+sep+
    "故不能以泄秀为用也。 官伤并透，以印制伤，兼以护官。用神虽在印，而有土重 埋金之惧，故以寅卯甲财运，"+sep+
    "制印泄伤生官为美。若印轻 则忌财运破印矣。"};
bazi[2034] = new String[]{"3","11","8","2","9","5","5","9",
    "戊土七煞，透于时干，土居中央，寄生于寅申，是申亦土之土 生地也。以长生歌诀论，当有四子。丙辛相合，"+sep+
    "壬水通源，身旺敌煞，而壬日坐午，禄马同乡，取财生煞为用神。时干有用，可为多子之征；财为喜神，亦内助得力之征。"+sep+
    "然倍之亦仅得八。今王君子女多至三十余人，更从何处看之乎？"};
bazi[2035] = new String[]{"3","11","9","5","3","9","3","9",
    "杂气七煞，干不透财，即不能以财滋煞，亦不可以食制煞；乙木余气藏辰，又落空亡，化煞无力，"+sep+
    "但以配合需要，仍当取印为用，即通关是也。印如有力，亦可取贵。干头不透财清用，固不限于杂气。"};







//丁
bazi[3001] = new String[]{"4","2","3","7","3","7","9","5",
    "此火焰南离，重逢刽刃，暖之至矣。一点壬水，本不足以制猛烈之火，喜其坐辰，通根身库；"+sep+
    "更可爱者，年支丑土，丑乃北方湿土，能生金晦火而蓄水，所谓暖虽至而寒有根也。"+sep+
    "科甲出身，仕至封疆，微嫌运途欠畅，多于起伏也。"};
bazi[3002] = new String[]{"4","2","3","7","6","10","8","8",
    "此造土荣夏令，金绝火生，四柱水木全无，最喜金透通根。惜乎运走东方，生火克金，"+sep+
    "不但功名增蹬，而且财源鲜聚。交辛丑运，年逢戊辰，晦火生金，食神喜劫地，秋闱得意，名利裕如。"};
bazi[3003] = new String[]{"4","2","7","11","7","1","1","9",
    "此秋金坚锐，官星虚脱，不能相制，财星临绝，何暇生官！初运土金，晦火生金，形伤破髦，无所不见；"+sep+
    "丁未丙午助起官星，家业鼎新；乙巳晚景优游，所谓伤之有功也。"};
bazi[3004] = new String[]{"4","2","9","3","6","6","3","3",
    "官格用印 ，本忌见财，此造丁壬相合，财化为官，忌神变为喜神，格局亦因合而清，宜为大贵之格。"+sep+
    "己丑中之金，藏而不露，气又休囚，本可不论，唯值庚辛运，将金引出为不宜，喜得原局有丙火回克，"+sep+
    "印可护官也。用印不宜见财，子亥运亦不利，喜其在支， 不伤丙火而生官星，则为吉矣。己戊丁帮身助印，"+sep+
    "皆为吉运，至酉三合会齐，伤克官星，为不利也。丙运最吉。此正官篇范太傅命也。"};
bazi[3005] = new String[]{"4","2","10","4","2","4","6","4",
    "乙卯日，生于卯月卯时，旺之极矣，最喜丁火独发，泄其精英。惜癸水克丁，仍伤秀气，时干己土为湿土临绝，"+sep+
    "不能去其癸水，因之书香不继，初中运逢水木之地刑丧破耗，家业渐消：戊戌丁运，大遂经营之愿，发财巨万，"+sep+
    "若以飞天禄马论之，则戊戌运大破矣。"};
bazi[3006] = new String[]{"4","4","1","5","1","3","2","12",
    "此亦方局齐来，干头无水，丁火秀气流行，行运不甚反悖。中乡榜，仕至州牧，子多财旺，赋性仁慈，"+sep+
    "品行端方，寿越八旬，夫妇齐眉。所谓木主仁，仁者寿，格名曲直仁寿者，信斯言也。由此两造观之，"+sep+
    "干头反复与全顺得序者，天渊也。"};
    bazi[3029] = new String[]{"4","4","1","5","8","12","10","6",
        "此春金逢火，理宜印化杀，财星坏印，癸水克丁，亥水冲巳，似乎制杀有情，不知春水休囚，木火并旺，"+sep+
        "不但不能克火，反去生木泄金；财官本可荣身，而日空不能胜任，虽心专必欲求之。亦何盖哉！出身未属微贱。"+sep+
        "初习梨园，后因失音随官；人极伶俐，且极会趋逢，随任数年，发财背主，竟损纳从九品出仕，作威作福，无所不为；"+sep+
    "后因犯事革职，依然落魄。"};

bazi[3007] = new String[]{"4","4","2","6","4","4","2","6",
    "此亦木火各半，两气成象，非前伤官之比。日主是火，长于夏令，木从火势，格成炎上，更不宜见金运。"+sep+
    "火逢生助。巡抚浙江；至辛运水年，木火皆伤。故不能免祸。所谓二人同心，可顺而不可逆也。"};
bazi[3008] = new String[]{"4","4","3","7","7","7","6","4",
    "虞和德造，庚金虽弱，透印有根，即不能从，身弱自为其弱，运行扶身之地，自然富贵，特劳苦耳。"};
bazi[3009] = new String[]{"4","4","4","8","7","7","6","4",
    "此造大略观之，财生官，官生印，印生身，似乎清美，无如午未南方，火烈土焦，能脆金，"+sep+
    "不能生金；且木从火势，又坏印绶，无生化之情，非清枯而何？更嫌运走东方，一生未遂，"+sep+
    "所谓明月清风谁与共，高山流水少知音也。"};
bazi[3010] = new String[]{"4","4","9","1","9","9","1","5",
    "本为水木伤官用财，无如丁壬一合，火失其焰，水旺木浮，只能顺其旺势而行金水之地也。"};
bazi[3011] = new String[]{"4","4","10","2","3","9","5","1",
    "丑中癸水官星透出，子申会局助之，水旺火弱，用劫帮身为用神。此为蔡孑民先生命造。"};
bazi[3012] = new String[]{"4","6","6","10","7","1","4","12",
    "朱古薇命造。月令阳刃用官，然重官不贵，妙在年上官星隔以己印，官生印，印生身，专用时上官星，"+sep+
    "运行助官，回翔台阁，则因己土为救应之神也。"};
bazi[3013] = new String[]{"4","6","4","8","4","4","10","4",
    "虽有癸水七煞透出，而有卯木化之，亦宜顺其旺势。此前清戚杨知府命造。"};
bazi[3014] = new String[]{"4","6","10","2","4","4","3","7",
    "丁火虽生季冬，比劫重重，癸水退气，无力制劫，不足为用。必以丑中辛金为用，得丑土包藏，泄劫生财，"+sep+
    "为辅用之喜神也。所嫌者，卯木生劫夺食为病，以致早年妻子刑伤。初运壬子辛亥，暗冲巳午之火，荫庇有余。"+sep+
    "庚戌运暗来拱合午火，刑伤破耗；至己酉会金局冲去卯木之病，财发十余万。由此观之，暗冲其忌神，"+sep+
    "暗会其喜神，发福不浅；暗冲其喜神，暗会其忌神，为祸非轻。暗冲暗会之理，其可忽乎？"};
bazi[3015] = new String[]{"4","8","1","5","6","10","5","5",
    "此舍侄某造，甲己化土格也。戊土元神透出，年上丁火助化，格局极真，以丁火偏印为用神。"+sep+
    "初运寅卯，化神还原，壬癸伤用，皆非美运。然壬癸有戊土回克，卯运有酉金回冲，原局有救应，逢凶化吉。"+sep+
    "至寅运，甲木得禄，化神还原，四柱无救，一败涂地。可见行运救应之一斑。"};
bazi[3016] = new String[]{"4","8","9","1","7","11","3","11",
    "此造如以水势论之，此则仲冬水旺，所喜者支中重重燥土，足以去其湿气。只为相克，使子不能助壬；"+sep+
    "丁壬一合，使壬不能克丙。中运土金，入部办事，运筹挫折，境遇违心；"+sep+
    "丁未南方火旺，议叙出仕，至丙午二十年，得奇遇，仕至州牧。"};
bazi[3017] = new String[]{"4","8","9","3","2","4","6","4",
    "乙木身旺，丁火泄秀，以丁为用神，壬水为病，己土制壬水为药。惜丁壬合而化木，去水虽美，"+sep+
    "去火则不相宜。用神在年被损，故出身寒微。己土在时为救，故帮夫与家，子嗣继美。运行南方得地，福泽悠长。"};
bazi[3018] = new String[]{"4","8","10","2","1","5","1","11",
    "此造支全四库逢冲，俗作杂气财官也，不知丑未逢冲，不特官星受伤，而且冲去库根；日主坐下余气，"+sep+
    "亦是根盘，更嫌戌冲，微根巳气，财多身弱；且旺土愈冲愈旺，则癸水必伤。初运壬子辛水旺之地，"+sep+
    "荫疪有余；一交庚戌，财煞并旺，椿萱并逝，刑妻克子；己酉戊申土盖天干，使金不能生水，家业破尽，无子而亡。"};
bazi[3019] = new String[]{"4","10","2","6","5","7","3","5",
    "此与前造只换一辛字，八字不及前造，而运途却胜于前，亦以辛金为用，非官印论也。"+sep+
    "丁丑年湿土生金晦火，又全会金局，发甲入词林，盖运在辛丑，正岁运皆宜也。"};
bazi[3020] = new String[]{"4","10","3","7","4","6","9","3",
    "此本篇李知府造，喜巳酉会，引财而近之，以生壬水官星，更喜时逢寅，为官印相随也。"+sep+
    "壬寅官印，辛丑庚子财官之地最美，己亥尚可无妨，戊戌则不能行，所谓伤食相侮也。"};
bazi[3021] = new String[]{"4","10","3","7","4","10","6","10",
    "火金相战，取土通关为富格，盖无土则金不能用也。名会计师江万平君造。"};
bazi[3022] = new String[]{"4","10","6","10","5","1","9","1",
    "一都统制命，财多身弱，喜其财印不相碍（参阅论伤官节），为财旺用印扶身，兼以调候。"+sep+
    "运行丁未丙午印地固美，乙巳甲辰官煞之地亦佳，盖官煞生印，并通财印之气也。"};
bazi[3023] = new String[]{"4","12","2","6","4","10","1","5",
    "清光绪十三年闰四月初十日辰时，为招商局督办赵铁桥之造。财格佩印，巳酉合而化财，甲乙透干，财不碍印也。"+sep+
    "行运辛金从酉中透清，辛为柔金，不伤甲木；丑巳酉，三合金局，贵为招商督办。"+sep+
    "此所谓因会而动，能作祸福也。至庚，合乙伤甲，而印均破，被刺遇害。"};
bazi[3024] = new String[]{"4","12","3","7","9","3","6","10",
    "财旺身弱，月令己土官星透出，财官两旺而身弱，故用印而不用官，以印扶助日元为用神。"+sep+
    "为前外交部长伍朝枢命造。"};
bazi[3025] = new String[]{"4","12","7","11","1","5","9","9",
    "甲木休困已极，庚金禄旺克之，一点丁火，难以相对，加之两财生杀，似乎杀重身轻，不知九月甲木进气，"+sep+
    "壬水贴身相生，不伤丁火。丁火虽弱，通根身库，戌乃燥土，火之本根，辰乃湿土，木之余气。"+sep+
    "天干一生一制，地支又遇长生，四柱生化有情，五行不争不妒。至丁运科甲连登，用火敌杀明矣。虽久任京官，"+sep+
    "而宦资丰存，皆一路南方运也。若思按，此初看似要用印，然局有印，则身已滋，必用伤官制杀也。"+sep+
    "妙在甲木进气，则足以任泄任制，否则不堪。"};
    bazi[3029] = new String[]{"4","12","7","11","6","6","7","7",
        "此蒋介石之命也。庚金伤官，既得九秋余气，矧复双透干头，妙有火印制伤，天生康壮之体。"+sep+
        "三命通会所载：金神入火乡，夫以伤官佩印为用。虽火金藏于戌但丁火一露则金虚，亥水被土克则水气全无，格成从旺。"+sep+
        "运喜逢印，不必再见伤食。早年申酉，有骏骨牵监之叹。"+sep+
        "丁未运为火力不足。龙潜于渊。迨丙午运。火候功深。风去际会。乙已运木炎媲美，仍是从心所欲，"+sep+
        "甲辰运伤官见官。解组归田，是为上策。"};

bazi[3026] = new String[]{"4","12","9","1","8","6","4","10",
    "金水食神用煞，与金水伤官用官相同，皆调候之意也。用神为官星，运亦喜财官。"+sep+
    "如此造己酉戊申印劫之地，无荣辱可言，而丁未丙午最美，乙巳甲辰三运亦佳。盖原局金寒水冷，非可以当理取也。"};
bazi[3027] = new String[]{"4","12","10","2","1","1","8","8",
   "甲子日元，生于丑月，支类北方；天干辛癸，官印元神发露，克去丁火，丑未遥隔；"+sep+
   "又水势乘权，不能冲丑，正得中和之象。所以土金水运，皆得生化之情，早游泮水，战胜秋闱。"+sep+
   "只因格局清寒，仕路未居显职，芹泮日长鸣孔铎，杏坛春暖奏虞弦也。前则逢冲，官印两伤，"+sep+
   "名利无成，此则不动，名成利遂。可知墓库逢冲必发者，谬也。"};
bazi[3028] = new String[]{"4","12","10","4","10","4","1","3",
   "癸水虽通根于亥，而亥卯合局，日时寅卯而透甲，食伤旺而生财，为身轻泄气太重。"+sep+
   "支行印绶之乡为最美，比劫帮身亦佳，但宜支而不宜干，见壬则合去丁财，见癸亦不免争财之嫌。"+sep+
   "亥子丑北方劫地，则甚美也。"};






//戊

bazi[4001] = new String[]{"5","1","1","3","5","7","1","3",
    "戊土生寅月寅时，土衰木盛，最喜坐下午火，生拱有情，正谓众杀横行，一仁可化。"+sep+
    "子水之财，生寅木不冲午火，其情协，其关通。尤羡运走南方火土，所以早登黄甲，出仕驰名。"};
bazi[4002] = new String[]{"5","1","5","7","5","11","5","7",
    "此满局火土，子衰午旺，冲则午发而愈烈，熬干滴水，是谓天干不覆。初交已未，孤苦万状；"+sep+
    "至庚申辛酉运，引通戊土之性，大得际遇，娶妻生子，立业成家；一交壬戌，水不通根，暗拱火局，"+sep+
    "遭祝融之变，一家五口皆亡。如天干透一庚辛，或地支藏一申酉，岂至若是之结局乎？"};
    bazi[4045] = new String[]{"5","1","7","9","2","2","9","7",
        "此为杜月笙先生命造。有以乙庚化金论者。窃以时上见午火。格局仅成其半。且远不符其声价。"+sep+
        "乙生申月。干透戊庚壬。财官印既同藏于申宫。又并藏于干头。斯乃贵征。侠义豪爽。固是不凡。"+sep+
        "前运日新月盛。五十一之丑运。更进一步。造福社会。奚啻万家生佛。亦原于财。故有利人而利己也。"+sep+
        "再后丙运虽克庚金。幸有壬水制之。不足为虑。寅运以冲申为岂可许子不惮烦劳。趋吉避凶。建策终莫妙于退隐。"+sep+
        "今年岁运皆乙。妒合庚金。能者多劳。其奈无功何。"};

bazi[4003] = new String[]{"5","1","8","10","2","8","3","1",
    "此商震造，辛金透，丁火刚，秋木盛也。然须注意者，辛金必须透出，方为有力而成贵格。乙为柔木，"+sep+
    "不怕煞旺也，不透则不贵，丙丁亦以透出为美。阎商陆三造，丙火伤官制煞，不知丁火食神制煞为有力何则？"+sep+
    "丙火逢辛反怯，不能显其力。此商陆两造，所以不及阎造也。"};
bazi[4004] = new String[]{"5","1","8","10","5","7","4","6",
    "此土金伤官，日主禄旺，劫印重逢，一点财星，秋水通源。子赖酉生，酉伏子护，遗业小康；"+sep+
    "甲子乙丑二十年，制化皆宜，自创数万；至丙寅运，生助火土，克泄金水，不禄。"};
bazi[4005] = new String[]{"5","3","1","3","1","5","4","4",
    "此成方，干透元神，四柱不杂金水，时干丁火吐秀，纯粹可观。初中行运火土，中乡榜，出宰名区；"+sep+
    "惜木多火炽，丁火不中以泄之，所以运至庚申，不能免祸。"};
bazi[4006] = new String[]{"5","3","2","4","1","5","8","8",
    "此造支类东方，劫刃肆逞，一点微金，成之不足，故书香不继，初运火土，，不失化之情，财源通裕；至庚申辛酉，"+sep+
    "辛金得地，而成之异路，加捐仕至州牧；癸运生木泄金，不禄。"};
bazi[4007] = new String[]{"5","3","2","2","3","3","7","3",
    "丙寅日元，虽支遇三寅，最喜丑土乘权，财星归库。若运走西北土金，财业必胜前造，惜一路东南木火之地，"+sep+
    "祖业破尽，遍历数省，奔驰不遇，至午运暗会劫局，死于广东。一事无成，莫非运也。"};
bazi[4008] = new String[]{"5","3","4","6","3","3","1","7",
    "此造丙火生孟夏，地支两坐长生而逢禄旺。火旺极者，似土也。初运虽不逢木，喜其南方火地，"+sep+
    "遗绪丰盈，读书过目成育；一交庚运，即弃诗书，受嬉好游，挥金如土；申运家破身亡。此造若逢木运，名利两全也。"};
bazi[4009] = new String[]{"5","3","6","8","1","3","2","12",
   "年戊日甲，同以未为贵人；甲本身旺任财，月令己土真贵透出为用神；更喜四柱无金，寅未藏火，食伤生才，清纯之极。"+sep+
   "年月为祖基，其贵出于遗荫，未贵直接为用，本身受贵人之提携。此为合肥李国筠造，"+sep+
    "受项城总统之知遇，民国初年曾任广东巡按使者也（袁项城造为己未命尤奇）。"};
bazi[4010] = new String[]{"5","3","10","12","4","8","8","12",
    "此癸水临旺，贴峰相克，被戊土合去，反作帮身。月支亥水本助杀，得年支寅亥合来生身，寅本遥隔，"+sep+
    "反为亲近。时支之亥，又逢未会，以杂为恩。，一来一去，何等情协，一往一会，通关无阻。所以科甲联登，仕至黄堂。"};
bazi[4011] = new String[]{"5","5","1","3","4","4","5","9",
    "林主席森命造，戊土伤官，年时两透，用甲克去年上伤官，而留时上伤官以生财损印，格局反清，"+sep+
    "其意一也。无食伤则财无根，两透则嫌其重，去一留一，适以成格。"};
bazi[4012] = new String[]{"5","5","2","2","5","11","8","10",
    "此造重重厚土，乙木无根，伤官又旺，其势足以敌官星之寡。故初交丙寅丁卯，官星得地，刑耗多端；"+sep+
    "戊辰得际遇，捐纳出仕，及已巳二十年，土生金旺，从佐二而履琴堂。至未运破金，不禄。"};
bazi[4013] = new String[]{"5","5","2","4","8","2","4","10",
    "此春金气弱，时杀紧克，年逢印绶，远隔不通。又被旺木克土坏印，不但戊土不能生化，即日支之丑土，"+sep+
    "亦被卯木所坏。此局内无可通之理。中运南方杀地，碌碌风霜，奔驰未遇；交庚申克去木神，得奇遇，"+sep+
    "分发陕西，屡得军功；及辛酉二十年，官至副尹，盖金能克木帮身，印可化杀而通也。"};
bazi[4014] = new String[]{"5","5","5","7","9","5","1","5",
    "此造四柱皆杀，喜支坐三辰，通根身库，妙在无金，时透食神制杀。辰乃木之余气，"+sep+
    "正谓一将当关，群凶自败。至癸亥运，食神逢生，日主得禄，科甲连登；甲运仕县令；子运衰神冲旺，不禄。"};
bazi[4015] = new String[]{"5","5","6","10","2","12","1","9",
    "乙木生于八月，财生官杀，弱之极矣。所喜者，坐下印绶引通官杀之气，更妙甲木透出，谓藤萝系甲。"+sep+
    "出身虽寒微，至亥运入泮，壬子联登甲第，及壬癸运，早遂仕路之光；丑运丁艰，甲寅克土扶身，"+sep+
    "不次升迁；乙卯仕至侍郎。此造之所喜者，亥水也，若无亥水，不过庸人耳。然亥水必要坐下，"+sep+
    "如在别支，不得生化之情，功名不过小就耳。"};
bazi[4016] = new String[]{"5","5","7","9","1","1","1","1",
    "此造木凋金锐，厚土生金，原可畏也，然喜支全水局，化其肃杀之气，生化有情。"+sep+
    "至癸亥运，科甲连登，早蒙仕路之光；丙寅丁卯，制化皆宜。仕路封疆，官途平坦，生平履险如夷。"};
bazi[4017] = new String[]{"5","5","7","9","6","10","10","10",
    "此亦伤官用劫，嫌其辰为湿土，生金拱水，未足帮身；更嫌运走西北金水之地，以致一败如灰，"+sep+
    "不成家室。因运无帮助之故耳。由此推之，非人之无为，实运途困之耳。"};
bazi[4018] = new String[]{"5","5","8","10","3","7","10","6",
    "此造旺财当令，加以年上食神生助，日逢时禄，不为无根，所以身出富家。时透癸水，巳火失势，逢酉邀而拱金矣。五行无木，全赖午火帮身，"+sep+
    "则癸水为病明矣。一交子运，癸水得禄，子辰拱水，酉金党子冲午，四柱无解救之神，"+sep+
    "所谓旺者冲衰衰者拔，破家亡身。若运走东南木火之地，岂不名利两全乎？"};
bazi[4019] = new String[]{"5","5","9","11","8","8","6","2",
    "此满局印绶，土重金埋，壬水用神伤尽，未辰虽藏乙木无冲，或可借用，以待运来引出，乃被丑戌冲破，"+sep+
    "藏金暗相砍伐，以至克妻无子。由此论之，四库必要冲者，执一之论也，全在天干调剂得宜，更须用神有力，"+sep+
    "岁运辅助，庶无偏枯之病也。"};
bazi[4020] = new String[]{"5","7","2","4","9","1","7","1",
    "生于清咸丰八年二月初六日子时，为庚有为造。水木伤官，而水旺木浮，戊土制水，所以生木，故取煞制刃为用神。"+sep+
    "午运冲子，以一冲而引起两冲。喜神冲忌，声名扬溢，己未均土地；然己有助 煞制刃之功，未运会卯化木，喜化为忌，"+sep+
    "伤官动而制煞。戊戌政变，年四十一，正入未运，犹幸戊戌流年为美，得死里逃生也。"};
bazi[4021] = new String[]{"5","7","3","5","5","5","8","10",
    "此重重火土，最喜酉时，伤官透露，泄其菁华。三旬之前，运走火土，蹭蹬芸窗，一交庚申，"+sep+
    "云程直上。及辛酉壬戌癸亥四十载，体用合宜，由署郎出为巡使，从藩臬而转封疆，宦海无波。"};
bazi[4022] = new String[]{"5","7","3","5","7","3","3","11",
    "此造干透两杀，支全杀局，所喜戊土原神透出，是以化杀；寅木本要破甲印，尤喜会火，"+sep+
    "反培土之根源，巧借栽培，。至己未运中，科甲连登；庚申辛酉，帮身有情，驰名宦海,裕后光前后。"};
bazi[4023] = new String[]{"5","7","6","8","9","9","8","12",
    "此造官杀并旺当令，喜日坐长生，时逢禄旺，足以敌官挡杀。坐下印绶 ，引通财杀之气，"+sep+
    "运走西北金水之乡。所以少年科甲，裕经纶于管库，人推黼黻之工，乘抚宇于催科，世让文章之焕。"};
bazi[4024] = new String[]{"5","7","8","10","2","4","3","11",
    "此陆荣廷造，辛金透，丁火刚，秋木盛也。然须注意者，辛金必须透出，方为有力而成贵格。乙为柔木，"+sep+
    "不怕煞旺也，不透则不贵，丙丁亦以透出为美。阎商陆三造，丙火伤官制煞，不知丁火食神制煞为有力何则？"+sep+
    "丙火逢辛反怯，不能显其力。此商陆两造，所以不及阎造也。"};
bazi[4025] = new String[]{"5","7","9","11","4","4","10","4",
    "此伤官当令 ，印星并见，官煞虽透无根，势在去官。初年运走北方，官星得势，一事无成；丙寅丁卯，"+sep+
    "生助火土，经营发财巨万；戊辰己巳，去尽官煞，一子登科，晚景峥嵘。此造戌午拱火，日时逢印，"+sep+
    "日主旺极，莫作用印而推，亦不可作去官留杀论也。"};
bazi[4026] = new String[]{"5","7","10","12","3","11","9","5",
    "丙戌日元，生于辰时，冲去库根，壬癸并透。喜其戊合，去官留杀；更喜年逢刃助，火虚有焰；"+sep+
    "更妙无金，稍胜前造。科甲出身，宿映台垣，重藉旬宣之职，猷分禹服，特隆锁钥之权。"};
bazi[4027] = new String[]{"5","9","1","1","7","7","4","2",
    "本篇一丞相造，以伤生财，以财生官，若伤下官星并透，则不足取矣。以官为用，运喜财乡，而行印运亦美。"+sep+
    "所以丙寅、丁卯、戊辰、已巳、庚午均为美运也。"};
bazi[4028] = new String[]{"5","9","3","5","4","4","1","5",
    "丁卯日元，生于季春。伤官生财，嫌其木盛土虚，书香难就。土得其伤官化劫，使丙火无争财之意，"+sep+
    "所以运至庚申辛酉，承先人事业虽微，而自创规模颇大，财发十余万。"};
bazi[4029] = new String[]{"5","9","5","7","4","6","2","6",
    "此火土伤官，日主旺极，喜其伤官发泄菁华，更妙财星得用。庚申辛酉运，少年创业，发财十余万；"+sep+
    "壬戌幸而水不通根 ，虽有刑耗而无大患；至癸亥运，激火之烈，泄财之气，不禄。"};
bazi[4030] = new String[]{"5","9","5","7","5","11","5","7",
    "此与前造只换一申字，而天干之气下降，地支之水有源，午火虽烈，究不能伤申金，用金明矣，"+sep+
    "况有子水为去病之喜神。交申运，戊辰年四月入学，九月登科，盖得太岁辰字，暗会水局之妙。"+sep+
    "惜将来壬戌运中，天干群比争财，地支暗会火局，未见其吉矣。"};
bazi[4031] = new String[]{"5","9","6","8","3","11","6","2",
    "此四柱伤官，若生丑戌月，为从儿格，甸利皆遂。生于未月，火有余气，必以未中丁火为用。"+sep+
    "惜运走西北金水之地，以致破败祖业；至癸亥运，贫乏无聊，削发为僧。"};
bazi[4032] = new String[]{"5","9","9","11","7","9","2","10",
    "此造乙从庚化，官星不见，支类西方，又坐禄旺，权在一人。从其强势，虽有壬，戊土紧克，不能引通泄其杀气。"+sep+
    "初交癸亥财喜如心一交丙寅、触其旺神，一败如灰，衣食难度，自缢而死。所谓泄之有益，伤之有害也。"};
bazi[4033] = new String[]{"5","9","10","12","3","7","9","5",
    "此造日主虽坐旺刃，生于亥月，究竟休囚；五行无木，壬癸并透，支逢生旺，各立门户。"+sep+
    "喜其合去癸水，不致混也；更妙运走东南木火，乡榜出身，宠赐传来紫闼，承宣协佐黄堂。"};
bazi[4034] = new String[]{"5","11","1","1","4","8","7","11",
    "周丞相命，用财去印存食，乃病药取用法也。戌未中均藏丁火，日元不弱，八字四土一水，制煞太过，"+sep+
    "其病一也；子水孤军，见甲更嫌泄气，其病二也。甲木无根，弃印就财，泄土之气，滋生弱煞，"+sep+
    "诚为两得其用。书云，有病方为贵，有解救之药，即贵之征也。"};
bazi[4035] = new String[]{"5","11","1","1","6","6","5","5",
    "财生官旺，丙火调候为用。月令天乙，贵由祖荫。贵人为财以生官，其贵为间接，更以腊月财官，须火调候，"+sep+
    "用神在巳，而非子，贵为间接之用。此亦为合肥李某某君之造。运至丙寅丁卯继承大宗，而本身之贵，"+sep+
    "则较上造稍次。更以己甲合官以护财，戊不能争，所以独得继统，拥产甚巨也。"};
bazi[4036] = new String[]{"5","11","2","2","3","5","6","2",
    "此四柱皆土，命主元神，泄尽月干，乙木凋枯，所谓精气枯索。运逢壬戌，本主受伤；年逢辛未，"+sep+
    "紧克乙木，卒于九月患弱症而亡。"};
bazi[4037] = new String[]{"5","11","2","4","3","7","6","12",
    "丙火坐刃，乙卯印星专旺，戊己食伤并透，是以食伤为 用也，故食伤财运均吉。官运反见其灾者，"+sep+
    "以癸能合戊化 劫也。煞运反能为福者，火木印绶，火旺木焦，与木火伤 官喜印相似，喜壬水滋润池。"+sep+
    "用食伤者，不忌比劫，而此 造则忌比劫，盖火太旺，则土焦木焚耳。此八字取运所以 各个不同也。"};
bazi[4038] = new String[]{"7","11","2","10","1","3","7","7",
    "此造干透两庚，正当秋令，支会火局，虽制杀有功，而克泄并见。且庚金锐气方盛，制之以威，"+sep+
    "不若化之以德。化之以德者，有益于日主也；制之以威者，泄日主之气也。由此推之，不喜会火局也，"+sep+
    "反以火为病矣。故子运辰年大魁天下。子运冲破火局，去午之旺神也，引通庚金之性，益我日主之气；"+sep+
    "辰年湿土，能泄火气，拱我子水，培日主之根源也。"};
bazi[4039] = new String[]{"5","11","3","5","6","6","6","6",
    "此造四柱火土，全无克泄。土旺极者，似金也。初运南方，遗业丰盈，午运入泮，己未棘闱，拔而不举；"+sep+
    "一交庚申，青蚨化蝶，家业渐消；辛酉财若春后霜雪，事业萧条；壬运克丙不禄。"};
bazi[4040] = new String[]{"5","11","6","8","3","1","7","3",
    "丙火通根戌未而时寅，带印也。戊戌己未，土居其四，食伤太旺，运最利财，盖庚申辛酉，泄土之气也。"+sep+
    "官煞不利，火土枯燥，加入滴水，不足以润燥，而反激其焰也。泄气已重，食伤未必为福，印绶未必为祸，"+sep+
    "唯非佳运则可知也。八字各个配合不同，为喜为忌，羌无一定此合肥李君命造。"};
bazi[4041] = new String[]{"5","11","7","9","10","12","2","4",
    "此造土生金，金生水，水生木，干支同流，但有相生之谊，而无争妒之风、戊戌中财星归库，"+sep+
    "官司清印正分明，食神吐秀逢生。乡榜出身，仕至黄堂，一妻二妾，子有十三，科第连绵，富有百万，寿过九旬。"};
bazi[4042] = new String[]{"5","11","8","10","5","11","8","10",
    "此土金各半，两气成象，取辛金伤官为用。喜其一路北方运，秀气流行，少年科甲，仕至黄堂；"+sep+
    "交丙破辛金之用，不禄。凡两气成象者，要日主去生，或食或伤。谓英华秀发，多致富贵；所不足者，"+sep+
    "运破局，不免于祸。如金水水木之印绶格，无秀可取，故无富贵，试之屡验。"};
bazi[4043] = new String[]{"5","11","9","11","3","1","5","11",
    "此食神制煞太过也。甲乙印运为美，癸亥子丑官煞运反吉，丙寅丁卯劫印帮身，最为美运，戊辰最忌。"+sep+
    "盖丙为太阳之火，水猖显节，不畏水也；土众成慈，遇土反晦也。"};
bazi[4044] = new String[]{"5","11","10","12","5","11","10","12",
    "此水土各半，两气成象，喜其通根燥土，财命有一。然气势稍寒，所以运至丙寅，寒逢阳，运登科甲，"+sep+
    "更妙亥中甲木暗生，仕至郡守，宦途平坦。"};













//己
bazi[5001] = new String[]{"6","2","3","1","4","12","7","1",
    "此造支类北方，地旺极矣；天干火虚，无木生扶，又有湿土晦火，天衰极矣。人皆论其杀重身轻。"+sep+
    "取火帮身敌杀。戊寅岁，金绝火生，又合去亥水，必有大凶，果卒季夏。此地支官星乘旺，又类官方，"+sep+
    "天干无印，己土泄丙，未足帮身，此为天地合而从官也。甲戌运生火克水，刑丧破耗，家业已尽；"+sep+
    "癸酉壬申克尽丙火，助起财官，获利五万；未运丙子年遭回禄，破去二万。人皆取其火土帮身，"+sep+
    "以午未运为美，殊不知比劫夺财，反致大凶。"};
bazi[5002] = new String[]{"6","2","8","8","3","3","6","2",
    "火土伤官重叠，幸在季夏，火气有余，又日坐长生，寅中甲木为用。至丁卯运，克去辛金，破其丑土，"+sep+
    "所谓有病得药，腾身而登月殿，庆集琼林；接运丙寅，体用皆宜，仕至黄堂。"};
bazi[5003] = new String[]{"6","2","9","9","4","8","3","7",
    "此造以大势观之，官得清地彼，何彼则富贵，此则困穷 ？不知此造无印，官紧克，午未虽是余气禄旺，"+sep+
    "丑中蓄水，暗伤午未之火，壬水逢生，又克丙火；更嫌己土一透，不能制水，反能晦火；兼之中运逢土，"+sep+
    "又泄火气，谓克泄交加。因之功名未遂，耗散资财，尚不免刑妻克子。细究皆己丑两字之患，幸格局顺正，"+sep+
    "气象不偏，将来运至木水之地，虽然屈抑于前，终必奋亨于后。"};
bazi[5004] = new String[]{"6","4","3","1","3","1","4","10",
    "此党国元老胡汉民造。月令官星，年印时财，两不相碍，格成三奇。惟官重宜行印劫，惜运不肋耳。"+sep+
    "此造为生于光绪五年十一月初七日酉时，或有传其为十月廿六日申时者，则成中有败矣。此胡汉民造。"+sep+
    "惜癸水不透，庚金不露，而申冲寅，伤丙火之根，虽怀宝迷邦，名高天下，而用神不显，辅助无力，"+sep+
    "主持中枢，霖雨苍生，尚有待于岁运之抶助也。盖官逢财印，无刑冲，为官格之成，冲官则破格。"+sep+
    "此造财印相冲，虽不破格，而究嫌辅佐受损也。"};
bazi[5005] = new String[]{"6","4","3","1","3","3","3","9",
    "月令官星，财印为辅，格之成也。惜寅申相冲，财印两伤，主虽正，奈辅佐冲突，"+sep+
    "不得力何？为成中有败也。又浙西盐商周湘舲造，为甲子、丙子、丙寅、丙申，两造相似，均主辅佐倾轧，晚年寥落不得意也。"};
bazi[5006] = new String[]{"6","4","3","1","7","3","8","6",
    "此申报馆主人史量才造。伤官带煞而透印，格之成也。印坐财地，不能制伤化煞，成中有败。"+sep+
    "所以仅为无冕帝王也。 煞通根寅巳而旺，只能用伤官制煞。财为忌神，居于年支，早年必困苦。"+sep+
    "至未运，会卯化财，泄伤党煞，被刺。"};
bazi[5007] = new String[]{"6","4","4","2","3","3","7","3",
    "此亦伤官生财格，身旺财轻，与上造适相反。丑为金库，已庚并透，为财伤有情也。酉申辛三运为最美；"+sep+
    "壬癸运为伤官见官，虽身旺不甚为忌，究非美运。财为最喜，而食伤则有分别，戊戌未为燥土，"+sep+
    "不及己丑辰湿土，以湿土能泄火之气而生金也。"};
bazi[5008] = new String[]{"6","4","4","2","10","2","2","4",
    "此前行政院长谭延闿命造也。食神制煞，而中隔以财，格之败也。喜乙丁隔癸，木不生火，"+sep+
    "煞坐食地，为败中有成。将煞安置一旁，不引生则无碍。丁火藉以调候，不可为用，盖丁火动则生煞也。"+sep+
    "用神专取食神，非但泄秀，兼以制煞。下救应节云，财逢煞而食神制煞以生，有救应，即是败中有成，"+sep+
    "为贵也。申运庚午年，乙卯两官均伤，又午年丁巳得禄，煞旺攻身，突然脑冲血逝世。"};
bazi[5009] = new String[]{"6","4","7","7","1","3","4","4",
    "甲木生于午月，木火伤官。年月两干，土金无根，置之不用；地支两卯一寅，日元强，必以丁火为用，"+sep+
    "故人权谋异众。丁卯运，入泮登科，仕县令；丙寅运，克尽庚金，宦资大丰；乙丑合庚，晦火生金，落职。"};
bazi[5010] = new String[]{"6","4","7","7","8","4","1","7",
    "辛金生于促夏，地支皆逢财杀。金太衰者，似土也。初运己巳戊辰，晦火生金，求名多滞，作事少成；"+sep+
    "一交丁卯，木火并旺，如枯苗得雨，勃然而兴，似鸿毛遇风，飘然而起，家业丰裕交丑生金泄火，不禄。"};
bazi[5011] = new String[]{"6","4","8","8","3","1","8","4",
    "丙火生于未月，火气正盛，坐下官星，被未土伤尽，只得用天干辛金。所嫌者，未为燥土，"+sep+
    "不能生金，又暗藏劫刃；年干己土，本可生金，又坐下印地，所谓吉神显露，凶物深藏者也。"+sep+
    "初运己巳戊辰土旺之地，财喜辐辏，事事称心；交丁卯，土金两伤，连遭回禄三次，又伤丁七人，丙寅妻子皆克，出外不知所终。"};
bazi[5012] = new String[]{"6","4","8","8","9","3","8","12",
    "此正官篇宣参国命。亥卯未三合木局，官化为伤，日元又坐寅木，寅亥又合而化木，伤官重重。"+sep+
    "日元泄气太甚，以辛印制伤滋身为用。己巳戊辰二十年，官煞旺地，滋生辛印，自是美运；"+sep+
    "交入丁字之后，财星破印，不能行矣。"};
bazi[5013] = new String[]{"6","6","6","6","2","10","3","11",
    "此造地支皆逢克泄，天干又透火土，全无水气。木衰极者，似土也。初交戊辰丁运，获丰厚之荫疪，"+sep+
    "美景良多；卯运椿萱并谢；丙运大遂经营之愿，获利万金；寅运克妻破财，又遭回禄；乙丑支全金局，"+sep+
    "火土两泄，家业耗散；甲子北方水地，不禄宜矣。"};
bazi[5014] = new String[]{"6","6","7","7","3","7","1","7",
    "此造俗论，丙午日支全三年，四柱滴水全无，中年又无水运，必作飞天禄马，名利双辉，不知此造午中己土，"+sep+
    "巳中庚金，元神透出年月两干，真火土伤官生财格。初交己巳戊辰，汇火生金，遗业颇丰；丁卯丙寅，"+sep+
    "土金喜用皆伤，连遭回禄三次，又克两妻四子，家业破尽；至乙丑运，北方湿土，晦火生金，又合化有情，"+sep+
    "经营获利，纳妾生子 ，重振家园；甲子癸亥，北方水地润土养金，发财数万若以飞天合禄论，大忌水运矣。"};
bazi[5015] = new String[]{"6","6","8","8","3","7","4","10",
    "此造火长夏天，支类南方，旺之极矣，火土伤官生财。格所嫌者，丁火羊刃透干，局中全无湿气，"+sep+
    "劫刃肆逞，祖业无恒，父母早亡，幼遭孤苦，中受饥寒。六旬之前，运走东南木火之地，妻财子禄，"+sep+
    "一字无成。至丑运，北方湿土，晦火生全，暗会金局，从此得际遇，立业发财，至七旬又买妾，连生二子。"+sep+
    "及甲子癸亥，北方水地，获利数万，寿至九旬。谚云：有其运，必得其福，为人岂可限量哉！"};
bazi[5016] = new String[]{"6","6","8","8","9","7","2","6",
    "支类南方，乘权当令，地旺极矣；火炎土燥，脆金难滋水源，天衰极矣，故日干之情，不在辛金，"+sep+
    "其意向必在午中丁火而合从矣。己巳戊辰运，生金泄火，刑耗有之；丁卯丙寅，木火并旺，克尽辛金，"+sep+
    "经营发财巨万。依我看，地支全火局，而干上下达全在木通关也，故水喜木用。则金忌土仇也。"};
bazi[5017] = new String[]{"6","6","10","10","3","3","7","3",
    "此日主两坐长生，年支又逢禄旺，足以用官。癸水官星被己土贴身一伤，喜得官临财位，尤妙巳酉拱金，"+sep+
    "则己土之气已泄，而官星之根固矣。所以一生不遭凶险，名利两全也。"};
bazi[5018] = new String[]{"6","6","10","10","10","8","7","9",
    "茅状元造，己土七煞，气泄于金，印绶太旺，而四柱无财以破印，即《滴天髓》母慈灭子之反局也。"+sep+
    "只能顺母之性，反以金水为吉，与上节临淮侯造适相反，盖一有财一无财也。"};
bazi[5019] = new String[]{"6","8","1","11","8","8","10","6",
    "引本篇所谓合财存食为贵者，然细按之，殊未尽然。盖印太旺，土重埋金，甲已一合，制印以存食，"+sep+
    "使癸水用神不伤，所以为贵也。癸酉壬申二十年，金水相生，最为美利，辛未庚午亦尚可行。"+sep+
    "午运之后，官印旺地，土重埋金，用神伤尽，难以继矣。"};
bazi[5020] = new String[]{"6","8","3","1","7","1","3","1",
    "庚金气泄而弱，用印制伤扶身。十一月金水，气肃而寒，用火调候，即金水伤官喜见官之意，"+sep+
    "兼以和印也。年上印绶得用，而幼年必极孤苦；甲合己土，财化为印，戌运印地，此十年为最美也。"+sep+
    "癸壬食伤运，有印回克无碍；申酉帮身运，自可行也。杂官有印化，尚无妨碍，逢财破印则身必危也。"};
bazi[5021] = new String[]{"6","8","4","2","5","1","6","8",
    "费中堂造，天干戊已逢丁，地支重午丑未。子丑化土，斯真格象，已成稼穑。所不足者，丑中辛金无从引出，"+sep+
    "且局中丁火三见，辛金暗伤，未得生化之妙，所以嗣息艰难。若天干透一庚辛，地支藏一申酉，必多子矣。"};
bazi[5022] = new String[]{"6","8","6","6","1","3","3","3",
    "甲木坐寅，时又逢寅，日元甚旺，旺而泄秀，亦可用也，唯火多则木有自焚之患。此造妙在食轻财重，"+sep+
    "火泄其气，唯究嫌偏要，贵多就武。行运仍宜印劫之地，乙丑、甲子、癸亥、壬戌三十五年，最为美利，"+sep+
    "虽命造本佳，亦运助之也。"};
bazi[5023] = new String[]{"6","8","6","6","4","8","8","2",
    "此造财食皆通根，日元亦不弱，胜于张造多矣。更喜巳丑拱合而透辛，劫化为财，"+sep+
    "运喜印绶而不忌比劫。丁卯丙寅二十年劫印之地最美。乙甲克去己土，子癸官煞，不为吉也。"};
bazi[5024] = new String[]{"6","8","9","9","5","1","7","5",
    "土寄四隅，申亦土之长生也（见阴阳生死节）。年逢己未，日元弱而不弱；时上庚辰，食神专禄，"+sep+
    "壬水生于申，子申合局，身强财食并旺。庚金透露，已巳戊辰帮身运甚美，印运亦吉。"};
bazi[5025] = new String[]{"6","8","10","10","4","6","4","8",
    "此袁项城命造也。初视之，身强食神制煞而已，细辨之，以年为主，己未年命，未酉夹申，为贵；"+sep+
    "以日为主，丁贵在酉，以煞为用，煞贵在巳，身煞互换得贵。七煞者敌对之神，为受清廷知遇，而清廷亦受覆育之兆。"+sep+
    "地支巳未酉夹禄夹贵，全盘禄贵拥护，宜为元首。至卯运，敌对之煞，临贵得势，而冲本身之贵，众叛亲离，至为显然也。"};
bazi[5026] = new String[]{"6","8","10","10","5","11","7","9",
    "此土金伤官，支类西方，金气太重，以劫为用。喜其当头克癸，故书香继志 ；更妙运走南方火地，"+sep+
    "拔贡出身，由县令而迁州牧，荐莅黄堂。一生逢凶化吉，宦海无波也。"};
bazi[5027] = new String[]{"6","10","2","12","9","11","7","1",
    "此为本篇王总兵命。乙庚相合，喜其化而为印，去伤存官，名符其实，去病为贵，此之谓也。"+sep+
    "运至辛未庚午为美，盖运喜财官，而去官则为忌。午未财地，支不伤干，而有生官之益。"+sep+
    "庚辛之卯，干不通根，而生助日元，故为美也。"};
bazi[5028] = new String[]{"6","10","3","1","7","5","1","9",
    "此亦寒金冷水，土冻木凋，与前大同小异，前则有寅木，火有根，此则无寅木，火临绝，"+sep+
    "所谓寒甚而瞹无气，反以瞹为美，所以初运乙亥，北主水地，有喜无忧；甲戌暗藏丁火，为丙火之根，"+sep+
    "刑丧破耗；壬运克去丙火，入申运食廪，癸酉财业日增，辛未运转南方，丙火得地生根，破耗多端；"+sep+
    "庚午运逢寅年，木火齐来，不禄。"};
bazi[5029] = new String[]{"6","10","3","1","9","9","3","7",
    "。财旺生官也，虽月令阳刃而财更旺，喜得己酉官印相生，财官印刃，周流不滞。运行印绶比劫之方，"+sep+
    "皆为美运，官运亦吉，如癸酉壬申辛未三十年是也。甲木食神合官，乙木伤碍官星，均非吉地耳。"};
bazi[5030] = new String[]{"6","10","3","1","10","8","5","7",
    "此王观察造，癸日子月 ，似乎旺相，不知财杀太重，旺中变弱，局中无木，混浊不清，阴内阳外之象。"+sep+
    "月透财星，其心意必欲爱之；时逢官杀，其心志必欲合之。所以权谋异众，才干过人，出生末微，心术不端。"+sep+
    "癸酉得逢际遇，由佐二至观察，奢华逢迎，无出其右；至未运不能免祸。所谓欲不除，似蛾扑灯，焚身乃止，如猩嗜洒，鞭血方休。"};
bazi[5031] = new String[]{"6","10","3","3","7","9","7","5",
    "此造以俗论之，春金失令，旺财生杀，杀坐长生，必要扶身抑杀，不知春金虽不当令，"+sep+
    "地支两逢禄旺，又得辰时印比帮身，弱中变旺，所谓木嫩金坚。若无丙火，则寅木难存；"+sep+
    "若无寅木，则丙火无根，必要用财滋杀，木火两字，缺一不可也。甲运入泮；子运会水生木，补廪；"+sep+
    "癸运有己土当头，无咎；亥运合寅，丙火绝处逢生，棘闱奏捷；壬戌支类西方，木火并伤，一阻云程，刑耗并见；"+sep+
    "辛酉劫刃肆逞，不禄，此造惜运走西北金水，若行东南木火，自然科甲联登，仕路显赫矣。"};
bazi[5032] = new String[]{"6","10","4","4","7","5","1","9",
    "丁火官星为用，地支亦载以卯木财星，与前造大同小异。只为卯酉逢冲，克败丁火之根，支中少水，财星有克无生。"+sep+
    "虽时透甲木临于申支，谓地支不载，虽有若无。故身出旧家，诗书不继，破耗刑伤；一交戌运，支类西方，贫乏不堪。"};
bazi[5033] = new String[]{"6","12","3","1","2","2","9","7",
    "此与前只换一酉子。以俗论之，酉换丑更美，酉乃七杀克我，丑乃偏财我克，又能止水，何其妙也。"+sep+
    "不知丑乃湿土，能泄火不能止水，酉虽七杀，午火紧克，不泄火之元神；彼则丙火在年，壬水遥远，"+sep+
    "又得己土一隔，此则丙火在月，壬水相近，已土不能为力，子水又逼近相冲。而且运走西北阴寒之地，"+sep+
    "丙火一无生扶，乙木何能发生？十干体象去：虚湿之地，骑马亦忧，斯言不谬也。所以屈志芸窗，"+sep+
    "一贫如洗，克妻无子，至壬申运，丙火克尽而亡。所谓阴乘阴位阴气盛也。"};
bazi[5034] = new String[]{"6","12","3","3","1","3","9","9",
    "甲木生寅月而透丙，本有木火通明之象。时上枭印夺食，透己土财以解之，惜病重药轻。运喜旺，"+sep+
    "食伤亦吉，印与官煞均忌。此造惜运行西北官煞印绶之乡，否则，前程未可限量也。"};
bazi[5035] = new String[]{"6","12","3","3","5","1","1","3",
    "此造观格局似胜前造，此财印坐长生，前则印逢财冲。不知前则坐下印绶，七杀皆来生拱，"+sep+
    "而日主坚固，此则财坐日下，反去生杀，助纣为虐。兼之运走西北，戊午年中乡榜，己丑中进士，"+sep+
    "此两年比劫帮身，冲去财星之妙也。壬运劫丙坏印；丁运外艰，遭回禄；戌过拱印虽稍有生色，"+sep+
    "亦是春月秋花。将来辛酉运中，木多金缺，泄土生水，合去丙火，灾祸岂能免耶？"};
bazi[5036] = new String[]{"6","12","4","4","7","3","3","1",
    "此造木旺乘权，又得水生，四面皆逢财杀。金衰极者，似木也。所以乙丑运中，土金暗旺，家业破尽；"+sep+
    "至甲子运，北方水旺，财源通裕；癸亥出仁，名利两全壬戌水临绝地， 罢职而归。"};
bazi[5037] = new String[]{"6","12","4","4","7","9","7","5",
    "庚金虽生春令，支坐禄旺，时逢印比，足以用官。"+sep+
    "地支载以卯木财星，又得亥水生扶有情，丁火之根愈固，所谓天地顺遂而精粹者昌也。"+sep+
    "岁运逢壬癸亥子，干有己印卫官，支得卯财化伤，生平履险如夷，少年科甲，仕至封疆。"+sep+
    "经云：日主最宜健旺，用神不可损伤，信斯言也。"};
bazi[5038] = new String[] { "6", "6", "4", "12", "2", "12", "2", "10",
    "此乃坤命。为海上某闻人之女公子。庚午孟春既望。举归汤饼。大江南北。各界名流均往道贺。极一时这盛。" + sep +
    "所收礼份。传有十五万元之鉅。固足豪矣。然亦有命焉。非可偶致也。盖寒木。逢丁而暖。得已而培。得乙而盛。" + sep +
    "干上一无废物。支全已酉丑。则偏官会局。夫星更昌。从德之美满。何待言哉。或病水浅印缺。殊不知丑月丑日。" + sep +
    "为虚湿之地。正喜壬癸未透。庶不飘浮为患。故行运一路土金木炎。福禄绵互。肖明昌炽方兴未艾。" + sep +
    "直至壬癸两运。始见逊色耳。夫寒弱之木。不宜多水。祇喜木火，尝见冬木孤寒之命。走水运而倾家荡产。" + sep +
    "走木火运而仓满库勇者。不知凡几。若泥于衰则喜帮。而以印为喜见者。失诸毫厘。差以千里矣。"};







//庚
bazi[6001] = new String[]{"7","1","1","9","7","1","1","9",
    "此本篇高尚书命。子申会局，禄劫化为伤官，喜得生于七月，气候未寒，所以金水伤官不见官煞，"+sep+
    "不损其贵也。更以原局无火，气偏金水，运宜金水本地，再行官煞火运，反不相宜。土运有甲木回克，"+sep+
    "无碍，所谓顺其气势以取运也。"};
bazi[6002] = new String[]{"7","3","2","10","10","12","3","5",
    "此牛监薄命，乙合庚而不生癸，所以为贵，何知其人富，财气通门户；何知其人贵，官星有理会数语，"+sep+
    "最为精审。财与食相生，轻而不轻者，即财气通门户之谓也。然牛监薄命，仍当以食神生财取用，"+sep+
    "以乙庚合不生癸为贵征，似未尽然，盖印未曾合去也。丙火通根于寅，身旺财印皆有根，宜乎富与贵兼。"};
bazi[6003] = new String[]{"7","3","6","4","2","12","10","8",
    "此造正合本文成局，干透官星，左右皆空，四柱一无情致，用财则财会劫局，用官则官临绝地，"+sep+
    "用神无所着落，为人少恒一之志，多迁变之心，以致家业破耗。读书未就，而学医；医又不就，又学堪舆；"+sep+
    "自以为仲景再世，杨赖复生，而人终不信；又学巫，学易，学命，所学甚多，不能尽述。"+sep+
    "不但一无所就，而且财散人离，削发为僧矣。"};
bazi[6004] = new String[]{"7","3","7","5","1","3","4","4",
    "此亦寅、卯、辰东方。旺神不是提纲，辰土归垣，庚金得载，力量足以克木，丁火虽透，非庚金之敌，用杀明矣。"+sep+
    "至甲申运，庚金禄旺暗冲寅木，科甲联登，仕至郡守；一交丙运制杀，降职归田。"};
bazi[6005] = new String[]{"7","3","8","6","3","3","8","4",
    "丙火生于孟夏，地支两寅一卯，巳火乘权，引出寅中丙火，天干虽逢庚辛，皆虚浮无根。"+sep+
    "初运壬午癸未无根之水，能泄金气，地支午未南方，又助旺火，财之气克泄已尽，祖业虽丰，"+sep+
    "刑丧早见。甲运临申，本无大患，因流年木火，又刑妻克子，家计萧条。一交申字，暗冲寅木之病，"+sep+
    "天干浮财通根，如枯苗得雨，勃然而兴。及乙酉十五年，自财数倍于祖业，申运驿马逢财，出外大利，"+sep+
    "经营得财十余万。丙戌运丙子年，凶多吉少，得风疾不起，比肩争财，乃临绝地，子水不足以克火，反生寅卯之木故也。"};
bazi[6006] = new String[]{"7","3","9","7","4","4","10","4",
    "此财官虚露无根，枭比当权得势，以四柱观之，贫夭之命。前造身财并旺，反遭破败无寿，"+sep+
    "此则财官休囚，劫业有寿，不知彼则无木，逢水冲则拔，此则有水，遇火劫有救。至甲申乙酉运，庚金禄旺，"+sep+
    "壬癸逢生，又冲去寅卯之木，所谓衰神冲旺旺神发，骤然发财巨万。命好不如运好，信斯言也！"};
bazi[6007] = new String[]{"7","3","9","7","5","7","4","6",
    "此以火为源头，年支寅木主节，月干壬水隔之，不能流至金。初运土金之地，冲化阻节之神，"+sep+
    "业同秋水春花盛，人被尧天舜日恩；一交丙戌，支会火局，枭神夺食，破耗异常，又克一妻二妾四子；"+sep+
    "至丁亥运，干支皆合化木，茕茕只影，孤苦不堪，削发为僧。"};
    bazi[6029] = new String[]{"7","5","5","1","3","9","6","2",
        "雷锋之命：1、丙火冬生少生助，身弱。地支三合水局，官煞旺。食伤生财助官煞。"+sep+
        "2、45年乙酉，偏财庚金处大运己丑墓库之地，父病逝；46年丙戌，比肩遇流年墓库之地，兄、弟病饿而亡；47年丁亥，正印乙木遇流年死地，母亲自尽。"+sep+
        "3、62年8月15日（壬寅、戊申、乙酉），所行大运庚寅同日柱天克地冲；流年太岁同日柱天克地冲；七煞壬水旺克丙火弱身，雷锋因公殉职。"+sep+
        "4、雷锋生前酷爱学习，写下大量日记，因其坐申金文昌星。且庚见辰、丙见丑为国印，故为人诚实可靠，办事公道，礼仪仁慈，助人为乐。"+sep+
        "5、庚寅运中，寅为驿马，故当汽车兵，东奔西跑。寅又为天乙贵人、太极贵人、福星贵人，故殉职后有中央许多领导人为其题词。"};
bazi[6008] = new String[]{"7","5","5","1","5","3","1","3",
    "戊寅日坐长生，干得此助，身旺以食神制煞为用，财泄食神而生煞，非可为用也。子辰相会，土金水木，"+sep+
    "一气流通，确为贵征。行运食伤身旺之地固美，印地亦吉，但行支而不行干，见丙火，不免克去庚金，为伤用也。"};
bazi[6009] = new String[]{"7","5","6","4","9","5","7","1",
    "壬水生于卯月，正水木伤官格。天干己土临绝，地支两辰，乃木之余气，一生金，一拱水，"+sep+
    "又透两庚，不但辰土不能制水，反生金助水，必以卯木为用，所谓一神得用，此象匪轻。初运庚辰辛巳，"+sep+
    "金之旺地，功名不遂；至壬午运，生财制金，名题雁塔；癸未生拱木神，甲申支全北方水局 ，木逢生助，"+sep+
    "仕版连登，由令尹而升司马，荐至黄堂，擢观察而履臬藩，入座封疆；一交酉，冲破卯木，诖误落职。"+sep+
    "所谓用神不可损伤，信斯言也。"};
bazi[6010] = new String[]{"7","5","7","5","7","9","7","5",
    "天干皆庚，又坐禄旺，印星当令，刚之极矣，谓权在一人。行伍出身，壬午癸未运，水盖天干地支之火，"+sep+
    "难以克金，故无害；一交甲申，西方金地及乙酉合化皆金，仕至总兵；丙运犯其旺神，死于军中。"};
bazi[6011] = new String[]{"7","5","9","7","1","5","4","4",
    "甲木生于仲夏，时干丁火透出，用水以润之，然水亦赖金生，金亦赖水养；更妙支逢两辰，"+sep+
    "泄火生金蓄水，一气相生，五行俱足。是以早游泮水，科甲联登，仕至观察，一生惟丙戌运金水两伤不利，其余皆顺境。"};
bazi[6012] = new String[]{"7","5","10","8","2","8","10","8",
    "此造支中三未通根，尚有余气，干透两癸，正三伏生寒，贴身生扶，亦通根身库。官星独发而清，"+sep+
    "癸水润土养金，生化不悖，财旺生官，中和纯粹。科甲出身，仕至藩臬，官境安和。"};
bazi[6013] = new String[]{"7","7","5","1","10","4","4","6",
    "王少师造，为财官印三奇格也。喜春印通根巳，财星得禄于午，支藏干透，天覆地载。若仅露干而不藏支，亦不足贵。"+sep+
    "更喜年印时财，两不相碍，戊癸相合，其情专向日主，宜其贵为少师矣。运喜财官而印亦美，与财生喜印相同。"};
bazi[6014] = new String[]{"7","7","6","4","9","9","6","10",
    "壬水生于卯月，水木伤官。喜其官印通根，年支逢财，伤官有制有化，日元生旺，足以用官。"+sep+
    "巳运 ，官星临旺，采泮水之芹，折蟾宫之桂；壬午癸未，南方火地，出宰名区，莺迁州牧；"+sep+
    "甲申乙酉金得地，木临绝，虽退归，而安享琴书，其乐自如也。"};
bazi[6015] = new String[]{"7","9","2","10","4","2","7","11",
    "本为火炼真金格局，乙庚相合，印为财破，虽生富厚之家，而天生哑子，终身残废也。"};
bazi[6016] = new String[]{"7","9","2","10","7","11","7","5",
    "此造支类西方，又逢厚土，金旺极者，似水也。初运火，祖业无恒；至戊子运获厚利，"+sep+
    "纳房出仁已丑庚运，名利皆遂；一交寅运，犯事落职，大破财利；至卯不禄。"};
bazi[6017] = new String[]{"7","9","5","3","3","9","6","8",
   "故甲用子印，己先癸后，是虽逢财破，仍得印生。若癸先而己在时，是印之结局，为财所破也。"+sep+
   "然亦须看四柱之配合，如浙西某富翁子造，财星坏印，虽乙印在时，财先印后，而乙庚化合，"+sep+
   "得气于申，有救应而不解，如中年后运佳，尚有结局，再行财运，必无善果也。"};
bazi[6018] = new String[]{"7","9","5","3","5","3","7","9",
    "此两杀逢四制，幸春木得时乘令，克不尽绝。至午运，补土之不足，去金之有余，登科擢县令："+sep+
    "至甲申支，又逢食制，死于军功。与其制杀太过，不若官杀混杂之美也。何也？盖制杀太过，"+sep+
    "杀既伤残，再行制煞之运，九死一生。官杀混杂，只要日主坐旺，印绶不伤，运程安顿，未有不富贵者也。"+sep+
    "如日主休囚，财星坏印，即使独杀纯清，一官不混，往往忧多乐少，屈志难伸。"};
bazi[6019] = new String[]{"7","9","5","3","9","1","9","5",
    "此造日临旺地，会局帮身，不当弱论。喜其时干甲木，真神发露；所嫌者，年遇庚申，冲克甲寅，"+sep+
    "又逢戊土之助，谓假乱真。虽然早采芹香，屡困秋闱；至壬午运，制化庚金，秋桂高攀，加捐县令；"+sep+
    "申运冲寅，假神得助，不禄。"};
bazi[6020] = new String[]{"7","9","7","5","1","11","3","3",
    "此造甲木生辰，虽有余气，但庚金并透，通根斫伐，最喜寅时禄旺，更妙丙火独透，制杀扶身。"+sep+
    "午运暗会火局，中乡榜；甲申乙酉杀逢禄旺，刑耗多端；直至丙戌运，选知县。"};
bazi[6021] = new String[]{"7","9","7","5","5","5","5","7",
    "董中堂造，日干戊土，生于季春午时，似乎旺相，第春时虚土，非比六九月之实也。且两辰蓄水为湿，"+sep+
    "足以泄火生金，干透两庚，支会申辰，日主过泄，用神必在午火。喜水木不见，日主印绶不伤，精神旺足，"+sep+
    "纯粹中和。一生宦海无波，三十余年太平相业，直至子运会水局不禄，寿已八旬矣。"};
bazi[6022] = new String[]{"7","9","9","7","8","10","1","7",
    "此亦用午中丁火之杀，壬水亦覆之于上，亦有庚金紧贴之生。所喜者午时一助，更妙天干覆以甲木，则火之荫盛。"+sep+
    "且壬水见甲木而贪生，不来敌火，四柱有相生之谊，无争克之风，中乡榜，仕至观察。"+sep+
    "与前造只换得先后一时，天渊之隔，所谓毫厘千里之差也。"};
bazi[6023] = new String[]{"7","9","9","7","8","10","10","6",
    "此庚辛壬癸，金水双清，地支申酉巳午，煅炼有功，谓午火真神得用，理应名利双辉。所惜者五行无木，金虽失令而党多，"+sep+
    "火虽当令而无辅；更嫌壬癸覆之，紧贴庚辛之生，而申中又得长生，则壬水愈肆逞矣。虽有巳火助午，无如巳酉拱金，"+sep+
    "则午火之势必孤。所以申酉两运，破耗异常；丙戌运中，助起用神，大得际遇；一交亥运，壬水得禄，癸水临旺，火气克尽，家破身亡。"};
bazi[6024] = new String[]{"7","11","1","9","1","11","2","2",
    "甲木生于孟秋，财生杀旺，虽天干三透甲乙，而地支不载，木凋金锐，用土以从之也。格成从杀。"+sep+
    "戌运武甲出身；丁亥运生木克金，刑耗多端；戊子己丑，财生杀旺，仕至副将。"};
bazi[6025] = new String[]{"7","11","5","1","1","11","2","12",
    "此造财旺，煞印均弱，取乙木制戊土，以存煞印，盖财为病，劫为药也。仍以印化煞取用，唯忌财地，"+sep+
    "余均呆行，所谓印轻不宜见财也，更喜丁火藏库，气势不寒，有病有药，中和之造也。"};
bazi[6026] = new String[]{"7","11","5","1","5","1","3","5",
    "年以庚金闲神，财旺不须食生，食亦不能伤暗官，得时上丙火去之，乃附带耳之作用耳。仲冬水寒土冻，焉能生木？"+sep+
    "得丙火照暖，水得活动，木有生机，是以调侯为急，而用丙火，即无食神，亦当用印，岂以不相碍而用印哉？"};
bazi[6027] = new String[]{"7","11","5","1","10","10","10","12",
    "月令建禄，戊土官星，通根于戌，为官有根也。庚金为辅，然身旺无劳印生，惟行运至食伤之地，取以护官耳。"+sep+
    "庚寅辛卯壬辰运，均平平，癸巳之后，运转南方，财生官旺，其得意当在晚年也。"};
bazi[6028] = new String[]{"7","11","5","3","10","8","10","2",
    "癸水生于立春二十六日，正当甲木真神司令，而天干土金并透，地支丑戌通根。伤官虽当令，"+sep+
    "而官杀之势纵横，即使伤敌杀，而日主反泄，况未能敌乎？庚金虽是假神，无如日主爱假憎真，"+sep+
    "用以庚金，有两歧之妙：一则化杀官之强暴，二则生我之日元，时干比肩帮身，又能润土养金。"+sep+
    "第中运南方，生杀坏印，奔驰不遇；至甲申，运转西方，用神得地，得军功飞升知县：乙酉更佳，"+sep+
    "仁至州牧：一交丙，坏庚，不禄。"};





//辛
bazi[7001] = new String[]{"8","2","2","8","7","5","4","2",
    "财官亦通根有气。更嫌丑时，丁火熄灭，则年干辛金肆逞，冲去未中木火微根，财官虽有若无。"+sep+
    "初运甲午，木火并旺，荫庇有余；一交癸巳，克丁拱丑，伤劫并旺，刑丧破耗；壬辰运，妻子两伤，"+sep+
    "家业荡然无存，削发为僧。以俗论之，丑未冲开财官两库，名利两全也。"};
bazi[7002] = new String[]{"8","2","10","6","5","9","3","5",
    "此以火为源头，流至水方，更妙月时，两火之源，皆得流通，至金水归局，所以富有百万，贵至一品，"+sep+
    "一生履险如夷，所谓景星庆云，仰众吉之拱向；花攒锦簇，盼五福之絣致。"};
bazi[7003] = new String[]{"8","4","3","9","10","4","1","3",
    "此亦以申金为用，以丙火为病，与前只换一寅字，不但有病无药，而且生助病神。彼则青钱万选，名利两全，"+sep+
    "此则机杼空抛，守株待兔。更嫌寅申遥冲，卯木助之，印绶反伤，木旺金缺，且月建乃六亲之位，"+sep+
    "未免分荆破斧，资财耗散。壬运帮身去病，财源稍裕；辛卯庚寅，东方无根之金，功名未能进取，"+sep+
    "家业不过小康。然格正局真，印星秉令，所以襟怀旷达，八斗才夸，争似元龙意气，五花笔吐，"+sep+
    "浑如司马文章。独嫌月透秋阳，难免珠沉沧海，顺受其正，莫非命也。"};
bazi[7004] = new String[]{"8","4","3","9","10","4","9","11",
    "此印绶格，以申金为用，以丙火为病，以壬水沩药，中和纯粹，秋水通源。运至癸巳，金水逢生得助，"+sep+
    "科甲联登；壬辰药病相济，由部属出为郡守。盖辛卯庚寅盖头，逢金不能生火环印，名利两全也。"};
bazi[7005] = new String[]{"8","4","4","10","5","1","5","7",
    "伤官用印，喜神即是官星，非俗论土金伤官忌官星也。卯酉冲，则印绶无生助之神；子午冲，"+sep+
    "使伤官得以肆逞。地支金旺水生，木火冲克已尽，天干火土虚脱，以致读书未遂，碌碌经营。"+sep+
    "然喜水不透，为人文采风流，精于书法。更兼中运天干金水，未免有志难伸。凡伤官佩印喜用在木火者，忌见金水也。"};
bazi[7006] = new String[]{"8","4","4","10","7","7","3","1",
    "更有喜其冲克者，如逊清乾隆皇帝造。阳刃格局，以煞制刃为用。但秋金无印，不作旺论，"+sep+
    "而官煞通根卯午，制刃太过。妙在卯酉冲，使卯木不能生火，子午冲，使午火不破酉金，而丙丁官煞仍得通根。"+sep+
    "抑其太过，入于中和，是则玄之又玄，更难猝喻者矣。"};
bazi[7007] = new String[]{"8","4","5","11","3","5","6","12",
    "时逢独杀，四食相制，年支卯木被辛金盖头，况秋木本不足疏土，所赖亥中甲木卫杀，"+sep+
    "至乙未运暗会木局，捷报南宫，名高翰苑：甲午运木死于午，合已化土，丁外艰：已巳年又冲去亥水，不禄。"};
bazi[7008] = new String[]{"8","4","5","11","3","5","9","5",
    "此亦一杀逢四制，所不及前造者，无亥卯之会也。虽早采芹香，以致蹭蹬秋闱纳捐瞩，"+sep+
    "仁路亦不能通达。喜时杀透露，行甲午运，无化土之患，然犹刑耗多端，而己身无咎。"};
bazi[7009] = new String[]{"8","4","5","11","3","5","6","12",
    "戊戌辰己四土，伤官重，而时逢亥水独煞，以煞为用，申运泄土生水为美。至局未支，"+sep+
    "亥卯未暗合木局，制土而卫煞，科甲连登；至甲午支，甲已合土化伤。流年已巳冲去亥水，不禄。"};
bazi[7010] = new String[]{"8","4","7","3","1","5","3","3",
    "此寅卯辰东方，兼之寅时，旺之极矣。年月两金临绝，旺神在提纲，休金难克，而且丙火透时，木火同心，"+sep+
    "谓强众而敌寡，势在去庚辛之寡。早行土运生金，破耗异常，进京入部办事；至丙戌运，分发广东，得军功，"+sep+
    "升知县，喜其克尽庚辛之美；至酉、庚辛得地，不禄宜矣。"};
bazi[7011] = new String[]{"8","4","8","4","3","1","1","7",
    "此以木为源头，五行无土，不能流至金；财官又隔绝，冲而逢泄，无生化之情。初运庚寅，叼上人之福；"+sep+
    "己丑运合子，泄火生金财福骈臻；戊子土虚水旺，暗助木神，刑耗端；丁亥克金会木，家破人亡。"};
bazi[7012] = new String[]{"8","4","8","4","8","4","8","4",
    "此造四木当权，四金临绝，虽曰反克地支，实无力克也。如果能克，可用财矣，若能用财，岂无成立乎？"+sep+
    "彼此母腹，数年间父母皆亡，与道士为徒；己丑戊子运，印绶生扶，衣食无亏；"+sep+
    "一交丁亥，生火克金，即亡其师，所有微业，嫖赌扫尽而死。"};
bazi[7013] = new String[]{"8","4","8","4","10","10","6","8",
    "常国公造乙木虽为月令，而两卯为两辛所制，食被枭夺，不能用矣。以印化煞为用，煞主威权，"+sep+
    "格局清纯，故主显赫。印旺而身不强，故财最忌，食伤运亦一尘不染 宜也。印劫最为美运，"+sep+
    "官煞有印化亦无碍，如己丑、戊子、丁亥，皆佳运也。丙戌运，戌合卯刑未，此十年皆财运，恐难为继。"};
bazi[7014] = new String[]{"8","6","1","7","10","4","10","12",
    "癸卯日元，生于亥时，日主之气已贯，喜其无土，才旺自能生官。更妙巳亥遥冲，去火存金，伅星得用，"+sep+
    "木火受制，体用不伤，中和纯粹。为人智识深沉，器重荆山荆山璞玉，才华卓越，光浮览水珠玑。庚运助辛制甲，"+sep+
    "自应台曜高躔，朗映紫薇，徽嫌亥卯拱木，木旺金衰，未免嗣息艰难也。此莫宝斋先生造。"};
bazi[7015] = new String[]{"8","6","4","10","4","10","8","2",
    "丁火生于八月，秋金秉令，又全金局。火衰者，似木也。初运己未甲午，火木并旺，骨肉如同画饼，"+sep+
    "六亲亦是浮云；一交癸巳，干透水，支拱金，出外经营，大得际遇；壬辰运中，发财十余万。"};
bazi[7016] = new String[]{"8","6","8","2","7","9","8","6",
    "寒月土金，宜用火调候。而巳丑会合，巳申刑合，格局转换。气全金水，反宜顺其旺气，"+sep+
    "以行土金水运为美。此为合肥李国杰命造。辛金杂出而庚金独得贵，所以昆仲甚众，而彼独得袭爵，"+sep+
    "贵由遗荫，故年月合贵。幼行未运，两贵相冲，加以甲戌流年，三刑会合，刑伤两贵，而受牢狱之灾。"+sep+
    "此造如时透一水，晚运即不致颠沛。可见星辰不尽无稽也。又李氏之贵，始于文忠公，文忠造癸未、"+sep+
    "甲寅、乙亥、己卯，曲直仁寿格，至李国杰金局而贵绝，袭爵至此而终，亦一奇也。此为贞元之运，八字研究不尽，附志于此。"};
bazi[7017] = new String[]{"8","6","9","5","2","12","9","7",
    "此江苏省长陈陶遗造。乙生辰月，日坐长生，用午中丁巳，食神生财格也。年透辛金七煞为破格，"+sep+
    "喜得辰中透壬水，化煞生身，以壬为救应之神也。虽用食神生财而运喜食忌财，则以食能泄秀而财破印也。"+sep+
    "凡八字多风浪起伏者，大多如此。"};
bazi[7018] = new String[]{"8","8","1","7","3","9","5","11",
    "月令阳刃，而丙临申位，旺而不旺，虽以食神为用，究嫌气势不足。至寅运，格局突然变换，"+sep+
    "寅午戌三合，身旺泄秀，为阳刃用食，气势回殊，格局顿清。因原局午戌半会而隔申，逢寅冲而会齐火局，"+sep+
    "否则，不能去申而代之也。姚君在此运中，一跃而为两淮盐运使。特此类命造，须原局本美，成而未全，"+sep+
    "逢运成之也。既可以变格为贵，亦可以变格为贱，其为福为祸，自较常理为尤重。若原局不佳，则暴兴暴落，殊不足取耳。"};
bazi[7019] = new String[]{"8","8","2","8","7","5","4","12",
    "庚辰日元，生于季夏，金进气，土当权，喜其丁火司令，元神发露而为用神，能制辛金之劫。"+sep+
    "未为火之余气，辰乃木之余气，财官皆通根有气，更妙亥水润土养金而滋木，四柱无缺陷。"+sep+
    "运走东南，金水虚，木火实，一生无凶无险。辰运午年，财、印皆有生扶，中乡榜，由琴堂而迁司马。寿至丑运。"};
bazi[7020] = new String[]{"8","8","8","2","5","5","9","11",
    "此造非支全四库之美，所喜者辛金吐秀，丑中元神透出，泄其精英，更妙木火伏而不见，纯清不混。"+sep+
    "至酉运，辛金得地，中乡榜；后因运行南方，木火并旺，用神之辛金受伤，由举而进，而不能选。"};
bazi[7021] = new String[]{"8","8","8","4","2","8","4","12",
    "此乙木归垣，亥卯未全，木势旺盛，金气虚脱，最喜时透丁火，制煞为用。故初运土金之乡，奔驰未遇；"+sep+
    "至于亥运，生木制煞，军前效力，得县佐；丙戌运中帮丁克辛，升县令。此所谓强众而敌寡，"+sep+
    "势在去其寡，非煞旺宜制而推也。至酉运，煞逢禄旺，冲破木局不禄。"};
bazi[7022] = new String[]{"8","8","8","4","2","8","5","3",
    "此乙木归垣，虽无全会，然寅时比亥之力量胜数倍矣。以大象观之，局中三土两金，似乎财生煞旺，"+sep+
    "不知卯旺提纲，支中皆木之根旺，非金之在地也。初运土金之乡，采芹食廪，家业丰裕：一交丁亥，"+sep+
    "制煞会局，刑妻克子，破耗异常，犯事革名，忧郁而死。"};
bazi[7023] = new String[]{"8","8","8","4","9","5","6","10",
    "壬水生于卯月，水木伤官，天干两辛，支逢辰酉，益水之源，官之根固，伤之荫泄，必以己土官星为用。"+sep+
    "己丑运，采芹食廪；戊子虽然蹭蹬秋闱，而家业日增；丁运亦无大患；至亥运会木局，伤官肆逞。刑耗并见而亡。"};
bazi[7024] = new String[]{"8","10","3","9","9","9","8","12",
    "财轻印重，必须行财地，及食伤生财之地，方为美耳。初运乙未甲午，木火相连癸巳水不通根，"+sep+
    "丙水得禄，均为美运。壬辰十年，即不死必有大起倒，过此之后辛卯庚寅，东方木地，金不通根，又可重起矣。"};
bazi[7025] = new String[]{"8","10","4","10","2","8","4","2",
    "乙木生于八月，木凋金锐，幸日主坐下库根，干透两丁，足以盘根制杀，祖业丰盈，芹香早采。"+sep+
    "但此造之病，不在杀旺，实在丑土；丑土之害，不特生金晦火，其害在丑未之冲也。天干木火，"+sep+
    "全赖未中一点微根，冲则被丑中金水暗伤，以致秋闱难捷。至癸巳运，全无金局，癸水克丁，遭水厄而亡。"};
bazi[7026] = new String[]{"8","10","4","10","5","7","8","10",
    "此土金伤官重叠，喜其四柱无财，纯清气象。初运木火体用皆宜，所以壮岁首登龙虎榜，"+sep+
    "少年身到凤凰池。惜中运癸巳壬辰，金生火克，所以生平志节从何诉，半世勤劳只自怜。"};
bazi[7027] = new String[]{"8","10","7","1","1","1","3","3",
    "甲木生于仲冬，木衰金寒，用火以暖之，金亦得其制矣；况平时逢禄旺，一阳解冻，"+sep+
    "所谓得气之寒，遇暖而发。故寒木必得火以生之也。所以科甲联登，仕至侍郎。"};
bazi[7028] = new String[]{"8","10","7","1","3","3","10","6",
    "此造癸水透庚金露也。妙在日坐长生，时逢归禄，身旺能任财官，而财生官旺也。丙生子月而癸水透，正官格也。"+sep+
    "支坐寅午禄刃之地，丙火身旺也。庚金露则官有财之生，财为官之引，官以财为根。运行财乡，必然大贵，以日元与财官皆有力也。"};
bazi[7029] = new String[]{"8","10","8","2","6","10","3","3",
    "此造与上造异曲同工之妙，日干己土，虽诞丑月，然冬土寒湿，非比六九月之温煦。且丑中蓄水含金，"+sep+
    "干透两辛，支会丑酉，日主过泄，用神必在丙火。喜时中寅木，九寒回阳，丙火有根。人极纤美灵秀，"+sep+
    "早运壬癸，书香有阻，将来巳午未南方火地，前程未可限量。"};
bazi[7030] = new String[]{"8","12","7","1","1","5","2","12",
    "虽云乙庚合煞留官，然无关系，完全以印为用也。官煞之气，已泄于印，食伤运泄日元之秀，"+sep+
    "气势流通不滞，自为美运，非取其制官煞也。身印旺地均利，印如透干，再见官煞运，亦无大碍，"+sep+
    "唯断不能行财运耳。如此造戊戌十年，必有风波也。"};
bazi[7031] = new String[]{"8","12","9","5","3","9","6","12",
    "此财生杀，杀功身，丙临申，申辰拱水。火衰极者，似金也。初运辛卯庚寅，东方木地，萱椿凋谢，"+sep+
    "祖业无恒；至己丑运，出外经营，青蚨衬辇，白镪随舆；及戊子二十年，春风吹枊，红绫易公子之裳，"+sep+
    "杏露沾衣，膏雨沐王孙之袖。所谓有其运，必得其福也。"};




//壬
bazi[8001] = new String[]{"9","1","3","7","9","1","3","7",
    "此造水火交战于干支，火当令，水休囚，喜其无土，日和不克。初交丁未，年逢戊午，天克地冲，"+sep+
    "财杀两旺，父母双亡，流为乞丐；交申运逢际遇，己酉运发财数万，娶妻生子成家。"};
bazi[8002] = new String[]{"9","1","8","12","2","12","3","1",
    "壬水乘权坐亥子，所谓昆仑之水，冲奔无情，丙火克绝，置之不论，遗业颇丰，乙卯甲寅，顺其流，"+sep+
    "纳其气，入学补廪，丁财并益，家道日隆。一交丙运，水火交战，刑妻克子，破耗异常；辰运蓄水无咎；"+sep+
    "丁巳运连遭回禄两次，家破身亡。"};
bazi[8003] = new String[]{"9","1","8","12","9","1","10","4",
    "六水乘权，其势泛溢，全赖卯木泄其精英。初交水运 ，仍得生助木神，平宁无咎；"+sep+
    "甲寅乙卯，正得用神之宜，采芹食禀，丁财并益；一交丙辰，群比争财，三子克二，夫妇皆亡。"};
bazi[8004] = new String[]{"9","1","8","12","10","2","9","1",
    "地支亥子丑，干透壬癸辛，局成润下。喜行运不背，书得早遂；甲寅运气流行，登科发甲；"+sep+
    "乙卯宦途平坦，由县令而迁州牧；丙辰原局无食伤之化，群劫争财，不禄。"};
bazi[8005] = new String[]{"9","1","9","1","3","11","5","11",
    "此造年月两逢壬子，杀势猖狂。喜而日时坐戌，通根身库，更妙戊土透出，足以砥定汪洋，"+sep+
    "尤羡运走东南，扶身抑杀。至乙卯运中，水临绝，火逢生，鹿鸣宴罢琼林宴，桂花香过杏花香，仕至郡守。"};
bazi[8006] = new String[]{"9","1","10","2","3","7","9","5",
    "此造满局官星，日主孤弱，虽食伤未见，但丑辰皆湿土，能蓄水，不能止水。初交甲寅乙卯，"+sep+
    "化杀生身，早游泮水，财炡有余：后交丙辰，不但不能帮身，反受官杀回克，刑妻克子，家业耗散；"+sep+
    "申年暗拱杀局而亡。所谓助之则吉，帮之反害也。"};
bazi[8007] = new String[]{"9","1","10","4","3","1","6","12",
    "丙火无根，湿木无焰，己土微弱，岂能制冲奔之水？所谓土能制水，水多土荡也（见论五行生克节）。"+sep+
    "但丙火阳刚之性，有印为根，即不能从，仍当以印为用。所喜者丙寅丁卯二十年木火运耳。戊已制煞之运，"+sep+
    "反入二乘，若再见官煞财运，立见其灾矣。"};
bazi[8008] = new String[]{"9","3","1","5","4","12","6","10",
    "年干壬水为始，是支亥水为终。官生印，印生身，食神发用吐秀，财得食之覆，官逢财星之生。"+sep+
    "伤官虽当令，印缓制之有情，年月不反背，日时不妒忌，始终得所。贵至二品，富有百万，子孙济美，寿至八旬。"};
bazi[8009] = new String[]{"9","3","4","8","3","3","9","5",
    "此本篇夏言夏阁老造（参观《命鉴》），虽煞印并见，而身强印旺，未为木库，"+sep+
    "丁壬又合而化木（参观十干配合性情节），夏月火土，非用水润土，调和气候不可。更喜需用为水库，又属湿土，"+sep+
    "可以泄丙火之燥，为壬水之根，故可用也。运西庚戌、辛亥、壬子、癸丑金水财煞之乡，自然富贵，劫印食伤，均不宜也。"};
bazi[8010] = new String[]{"9","3","5","9","9","5","9","3",
    "马参政命，此身重印轻也，壬水虽通源，而两寅泄气，以煞生印为用神，重在于印，不可见财，见财则破格矣。"};
bazi[8011] = new String[]{"9","3","8","12","9","1","8","2",
    "此造壬水生于孟冬，支类北方，干皆金水。水太旺者，似土也，喜其寅木吐秀。至甲寅运，早遂青云之志，"+sep+
    "可谓才藻翩翩，辉映杏坛桃李，文思弈弈，光腾药笼参芩，乙卯运官途顺遂，交丙而亡。"};
bazi[8012] = new String[]{"9","3","9","3","7","5","8","6",
    "此论财篇杨待郎命，食神生财格也。日元财食相均，行食伤财运为美，如癸卯、甲辰、乙巳是也。"+sep+
    "丙火煞运不忌，以有食伤回克，又得暖局。春初水木得火而发荣也。何以官 印反晦？盖丁火官星，"+sep+
    "合壬用神。戊土印缓，克制壬水，则用神被伤，故反以为晦也。"};
bazi[8013] = new String[]{"9","5","1","5","3","11","5","11",
    "杂气透煞，四柱土多，制煞太过，喜得三月甲木，制食卫煞，兼以化煞，为食重透印也。行官煞运，"+sep+
    "有甲木引化，反为美运，最忌财旺破印也。乙巳、丙午、丁未为印绶身旺之地，均吉，丁壬合煞无害，戊申之后无佳运矣。"};
bazi[8014] = new String[]{"9","5","3","7","3","7","9","5",
    "此杀逢四制，柱中印虽不见，喜其杀透食藏， 通根身库。总之夏火当权，水无金滋。至酉运，"+sep+
    "合去辰土，财星滋杀，发甲点中书；庚运仁版连登，入参军机；戌运，燥土冲动壬水之根，又逢戊土透出，紧制壬水，不禄。"};
bazi[8015] = new String[]{"9","5","6","10","1","9","1","1",
    "合官留杀，功名仕路，无所高下，殊不知有天渊之隔。夫制者克而去之，合者有去有不去也。"+sep+
    "如以辰土为财，则化金而助杀；以酉金为官，仍化金而党杀。由此观之，清中带浊，且以财为病者，"+sep+
    "不但功名蹭蹬，而且刑耗难辞。惟亥运逢生，可获一衿（秀才），壬子如逢木，秋闱（秋天的乡试）有望；"+sep+
    "癸丑合去子印，一阻去程，有凶无吉；甲寅运被申冲破，寿元有碍矣。"};
bazi[8016] = new String[]{"9","5","8","12","5","1","10","2",
    "此造支类北方，水势汪洋，天干又透金水。土太衰者，似火也。运至甲寅乙卯，干支皆木，名成利遂；"+sep+
    "一交丙运，刑妻克子，破耗多端；至于巳运，岁运火土，暗伤体用，得风疾而亡。"};
bazi[8017] = new String[]{"9","5","9","1","3","3","10","6",
    "此造壬癸当权，杀官重叠，最喜日坐长生，寅能纳水，化杀生身，时归禄旺，足以敌官；"+sep+
    "更妙无金，印星得用，煞势虽强，不足畏也。至丙运帮身，又逢己巳流年，去官之混，捷报南宫，出宰名区。"};
bazi[8018] = new String[]{"9","5","9","1","3","9","10","6",
    "日禄归时也。王君月令正财太旺，归禄帮身，运至比劫而致富，所谓四柱没官星，青云得路也。"+sep+
    "黄君官煞太旺，恃巳禄为日元之根，尚须通关用印，运至印地最美。比劫帮身敌煞虽为美运，"+sep+
    "巳落二乘归禄，以见官为破格者，正以身煞相敌，故以不见为美也。"};
bazi[8019] = new String[]{"9","5","9","1","9","1","10","4",
    "此天干皆水，支逢旺刃，喜其支合卯辰，精英吐秀，所以书香早遂。但木之原神不透，"+sep+
    "未免蹭蹬秋闱；更嫌运逢火地，犹恐寿元不永。交丙运庚午年，水火交战而亡。"};
bazi[8020] = new String[]{"9","5","9","3","1","3","7","7",
    "同邑王姓造。俗以身强杀浅论，取庚金为用，谓春木逢金，必作栋梁之器，劝其读书必发；"+sep+
    "至三旬外，不但读书未售，而且家业渐销，嘱余推之。观其支坐两寅，乘权当令，干透两壬，"+sep+
    "生助旺神，年支之辰土，乃水之库，木之余气，能蓄水养木，不能生金，一点庚金，休囚已极，"+sep+
    "且午火敌之，壬水泄之，不惟无用，反为生水之病。大凡旺之极者，宜泄而不宜克，宜顺其气势，"+sep+
    "弗悖其性也。以午火为用，将来运至火地，虽不贵于名，定当富于利，如再守芸窗，终身误矣。"+sep+
    "彼即弃儒就经营，至丙午运，克尽庚金之病，不满十年，发财十余万，则庚金为病明矣。"};
bazi[8021] = new String[]{"9","7","2","6","4","2","3","7",
    "丁火生于孟夏，柱中劫旺逢枭，天干壬无根，置之不用。最喜丑中一点财星，深藏归库，丑为湿土，"+sep+
    "能泄火气，不但不争无争夺之风，反有生生之谊。因初交丙午丁未，所以身出寒门，书香不继；"+sep+
    "喜中运三十载西土金地，化劫生财，财发十余万。所谓吉神深藏，终身之福也。"};
bazi[8022] = new String[]{"9","7","3","7","7","9","5","3",
    "日坐禄旺，壬水亦紧制杀，何则终身不发？盖彼则壬水逢申之生地，制杀有权，此则壬水坐午之绝地，敌杀无力；"+sep+
    "彼则时干比劫帮身，又可生水，此则时上枭神克水，而不能生食。所谓左右不能同志者也。"};
bazi[8023] = new String[]{"9","7","6","10","1","9","1","1",
    "甲申日元，生于八月，官杀当权，喜其午火紧制酉金，子水化其申金，所谓去官留煞。煞印相生，"+sep+
    "木凋金旺，印星为用，甲第联登，由郎署出为观察，从臬宪而转封疆。"};
bazi[8024] = new String[]{"9","7","6","10","5","7","7","9",
    "庚申时逢戊日，亦专禄格也（见食格谢阁老造），而日元坐印，己土透干，亦可作刃论，较谢造尤强。"+sep+
    "壬水之财，虽生于申，而隔离太远。运喜食伤财地，辛亥、壬子、癸丑三十年，花团锦簇，洵不易遇，"+sep+
    "正符身强财浅，运喜财地，伤官亦宜之说也。"};
bazi[8025] = new String[]{"9","7","9","3","9","11","7","11",
    "壬水生于孟春，支全火局，虽年月两透比肩，皆属无根。天干坎衰，地支离旺，用庚金以降之也。"+sep+
    "惜乎运途东南，在外奔驰四十年，一无成就；至五旬外，交戊申，娶妻三，年已六旬矣。连生三子，至戌运而终。"};
bazi[8026] = new String[]{"9","9","1","5","3","3","3","9",
    "此坐下印绶亦在季春，印绶未尝无余气，年干壬杀生印有情，不足畏也，所嫌者，两申冲寅，甲木之根拔。"+sep+
    "还喜壬水泄金生木，运走丙午劫去申财，入学补廪登科；丁未合去壬水，三走春闱不捷；戊申克去壬水，"+sep+
    "三冲寅木而死于途。此造之壬水，乃甲木之原神，断不可伤，壬水受伤，甲木必孤。凡独杀用印者，最忌制杀也。"};
bazi[8027] = new String[]{"9","9","2","6","10","6","8","10",
    "平江伯造，癸水日元，年有壬申，时逢辛酉，虽四月水临绝地，而印旺身强，乙木无根，枭印夺食，"+sep+
    "自当以巳中之财破印为生官为用。乙木生才，并不碍官，何用枭印去食护官乎？"};
bazi[8028] = new String[]{"9","9","3","7","1","7","9","9",
    "如本篇孛罗平命造，兼制伤扶身与调和气候二者之用，加倍得力。申酉庚辛反美者，以其生印也。"+sep+
    "戊已运为凶，幸为西方之土，临于申酉，原局偏印又旺，尚无大碍，而戌运必不美也。食伤火运，有壬水回克无碍。"};
bazi[8029] = new String[]{"9","9","3","7","7","7","3","11",
    "此造两杀当权临旺，原可畏也。喜赖年干壬水临申，足以制杀；更妙无木，则水不泄，火无助。"+sep+
    "申运金水得助，发轫宫墙；酉运支类西方，早充观国之光，高豫南宫之选；后运金水，体用皆宜，由署郎出为郡守。"};
bazi[8030] = new String[]{"9","9","3","7","7","7","7","5",
    "此丙火之杀虽旺，壬水之根亦固，日主有比肩之助，辰土之生，谓身杀两停。用壬制杀，天干之同志者；"+sep+
    "地支之同志者，辰土也，一制一化，可谓有情。运喜金水之乡，仕途显赫，位至封疆。"};
bazi[8031] = new String[]{"9","9","4","8","4","8","10","4",
    "此造日月皆丁未，时杀无根，喜其壬水官星助杀，不宜合也。幸而壬水坐申，合而不化，"+sep+
    "申金为用，更妙运走西北金水，助起官杀，乡榜出身，仕榜连登，由县令而迁司马，位跻黄堂。"};
bazi[8032] = new String[]{"9","9","6","10","7","1","7","5",
    "此造秋金秉令，木火全无。金太旺者，似火也。亥运壬水坐禄，早游泮水，壬子运用神临旺，撞破烟楼，"+sep+
    "高攀月桂；癸丑合去壬水旺地，囊内青蚨成蝶舞，枝上子规月下啼；甲寅乙卯，"+sep+
    "尚有制土卫水之功，仁路清高，枫叶未应毡共冷，梅开早觉笔先香。"};
bazi[8033] = new String[]{"9","9","8","12","8","10","7","3",
    "此金水伤官，四柱比劫，虽用寅木之财，却喜亥水，泄金生木，使比劫无争夺之风，又得亥解申冲。"+sep+
    "若无亥水，一生起倒无宁，终成画饼。亥水者，生财之福神也。交甲寅乙卯，白手成家致富；"+sep+
    "后行火运，战克不静，财星泄气，无甚生色；至巳运，四孟冲，劫又逢生，不禄。"};
bazi[8034] = new String[]{"9","9","9","1","5","7","2","4",
    "论财篇葛参政造，用在乙大官星，月令财旺生官也。甲运七煞混，不利；寅运则会午成火局，"+sep+
    "解子午冲，亦帮身美运也；乙卯十年，官星清，虽旺无碍；丙辰、丁巳、戊午、己 未皆美运，唯忌金水之地耳。"};
bazi[8035] = new String[]{"9","9","9","3","3","1","2","8",
    "铁制军造，杀逞财势，嫩木逢生，最喜寅木真神当令，时干透出乙木元神。寅申之冲，谓之有病。"+sep+
    "运至南方火地，去申金之病，仕至封疆，声名赫弈。有润泽生民之德，怀任重致远之才也。"};
bazi[8036] = new String[]{"9","9","10","2","6","2","1","11",
    "本杂气财旺生官也，而以为乙亥时，作时上偏官论，岂知旺财生煞，将救死之不暇，于何取贵？"};
bazi[8037] = new String[]{"9","11","4","8","5","9","2","4",
    "此为论正官篇中杂气正官造，虽财印并透，而丁壬一合，财印两失其用（参阅十干配合性情节），"+sep+
    "故以孤官无辅论。加以卯申相合（乙庚暗合），戌未相刑，官星之根被损，此为八字根本之弱点。"+sep+
    "论运则日元当旺，官星稍轻，宜取助官。庚戌之前无佳运，壬亥、癸子二十年财地，生助官星，为一生得意时也。"};
bazi[8038] = new String[]{"9","11","5","9","7","3","3","11",
    "庚金生于七月，支类土金，旺之极矣，壬水坐戌逢戊，枭神夺尽，时透丙火，支拱寅戌，"+sep+
    "必以丙火为用。惜运走四十载土金水地，所以五旬之前，一事无成：至甲寅运克制枭神，生起丙火，"+sep+
    "及乙卯二十年，财发巨万，所谓蒲柳望秋而凋，松柏经冬而茂也。"};
bazi[8039] = new String[]{"9","11","6","10","4","2","1","5",
    "此南浔刘澄如造。月令财星生官，格之成也，而干透己土，官星被伤，成中有败。时干透甲印，而财印不相碍，"+sep+
    "印绶制食，格局以成。年上官星破，故不贵；丁己同宫，财星有情，故为浙西首富。行官煞运有印化，为败中有成也。"};
bazi[8040] = new String[]{"9","11","6","10","5","7","4","6",
    "一丞相命，为印多用财（参观论印节）。喜得丁壬不合，用财损印，用神在财，运行辛亥壬子癸丑财地最美，"+sep+
    "甲寅惭印官煞之地不佳，盖官煞泄财生印也。"};
bazi[8041] = new String[]{"9","11","6","10","5","11","2","4",
    "戊日酉月，土金伤官，地支两戌，燥而且厚，妙在年干壬水，润土泄金而生木，足以用官。"+sep+
    "亥运，财官皆得生扶，功名顺遂；壬子，早遂仕路之志；癸丑，支拱金局，服制重重；甲寅乙卯二十年，仕至侍郎。"};
bazi[8042] = new String[]{"9","11","9","1","1","1","5","5",
    "此造水势猖狂，独戊土以培之，以作砥柆之功，不致浮泛也。然戊土亦赖有戌土而根固，"+sep+
    "若有辰而无戌，辰乃湿土，见水则荡，戊土不能植根而虚矣。无根之土，岂能止百川之源？故此造所重者，"+sep+
    "戌之燥土也。但寒木无阳，必须火以温之，则木方可发荣，所以运至南方火旺之乡，发财数万，名成异路也。"};
bazi[8043] = new String[]{"9","11","9","1","7","5","6","4",
    "此金水伤官当令，喜支藏暖土，足以砥定中流。因时财为病，兼之初运水木，以致书香不继；至三旬外，"+sep+
    "运逢火土，异路出身，仕至州牧；午运衰神冲旺，台省几时无谪宦，郊亭今日倍离愁。"};










//癸
bazi[9001] = new String[]{"10","2","4","6","1","5","7","7",
    "此与前造只换辰丑二字，丑乃北方湿土，晦火蓄水，癸水通根而载丑；辰亦湿土，"+sep+
    "又是木之余气，日元足盘根；庚金虽不能生水辅用，而癸水坐下余气，竟可作用。初运木旺，帮身护用，"+sep+
    "和平迪吉；至癸丑北方水地及壬子辛亥三十年，经营得意，事业称心。"};
bazi[9002] = new String[]{"10","2","5","7","3","7","9","5",
    "此造火长夏天，旺之极矣。戊癸合而化为忌，还喜壬水通根身库；更妙年支坐丑，足以晦火养金而蓄水，"+sep+
    "则癸水仍得根，虽合而不化也。不化反喜其合，则不抗呼壬水矣。是以乙卯甲寅运，克土卫水，云程直上；"+sep+
    "至癸丑运，由琴堂而迁州牧；及壬子运，由治中而履黄堂，名利裕如也。"};
bazi[9003] = new String[]{"10","2","5","7","6","6","4","4",
    "此南通张季直造。火炎土燥，赖癸水滋润，戊癸一合，去才为败；然因戊癸合化，"+sep+
    "格成专旺，此因败得成也。"};
bazi[9004] = new String[]{"10","2","9","11","3","7","7","3",
    "丙火生于九月，日主本不及时，第坐阳刃会火局，谓之强寡。年干癸进气，癸水通根余气丑土，泄其火局，"+sep+
    "庚金生助壬癸为众也。势在成乎众，故交辛酉庚申，金生水旺，遗业丰盈，其乐自如；一交己未，火土并旺，"+sep+
    "父母双亡；及戊午二十年，破败家业 ，妻子皆伤，至丙辰流落外方而亡。"};
bazi[9005] = new String[]{"10","4","2","4","1","3","2","12",
    "此造四支皆木，又逢水生，六木两水，别无他气。木旺极者，似火也，出身祖业本丰。惟丑运刑伤，"+sep+
    "壬子水势乘旺，辛亥金不通根，支逢水旺，此二十年经营，获利数万；一交庚戌，土金并旺，破财而亡。"};
bazi[9006] = new String[]{"10","4","3","5","1","5","3","3",
    "此造财旺提纲，丙食生助，当以财星为用，丙火为喜，癸水为忌。身旺用财，遗业十余万初年水木运，"+sep+
    "一败如灰：至辛亥运，火绝木生，水临旺，冻饿而死。以此观之，不论成方成局，必先察财官之势。"+sep+
    "若财旺提纲，则以财为用；或官得财助，则以官为用；如财不通月支，官无旺财生，必须弃其寡而从其众也。余皆仿此。"};
bazi[9007] = new String[]{"10","4","4","6","7","3","7","5",
    "岳统制命，去官留煞也。夫官为贵气，去官何如去煞？岂知月令偏官，煞为用而官非用，各从其重。"};
bazi[9008] = new String[]{"10","4","5","7","9","3","3","7",
    "此造丙火当权，戊癸从化，枯干壬水。水衰极者，似火也。初运逢火，从其火旺，丰衣足食；"+sep+
    "乙卯甲寅 ，名利双全；癸丑争官夺财，破耗而亡。"};
bazi[9009] = new String[]{"10","4","7","9","7","1","7","5",
    "此为本篇一状元命造，金水相涵也。认庚日全逢润下，为井栏叉格。其实申子辰三合水局，"+sep+
    "乃食神生财格局也，但原局无火，气偏金水，行官煞火运必不见美，故《喜忌篇》云，忌丙丁巳午之方也。"+sep+
    "印劫食财皆吉，其大魁天下，必在辰运之后矣。"};
  bazi[9010] = new String[]{"10","6","1","1","4","10","1","5",
      "此东南之阳暖。天干金水，似乎无根，喜月支辰土，泄火蓄水而生金，庚金挂角逢生，则庚金可用。癸水即庚金之喜神。"+sep+
      "初运乙卯甲寅，金绝火生而水泄，孤苦不堪；一交癸丑北方阴湿之地，金水通根，又得巳丑拱金之妙，"+sep+
      "出外大得际遇，骤然发财十余万。阳暖逢寒，配合之美也。"};
bazi[9048] = new String[]{"10","6","1","1","4","10","1","5",
      "毛泽东命造：日元丁火生仲冬，天寒地冻，最妙两甲木正印从中通关。"+sep+
      "一来可以逢凶化吉，二来印绶主求知欲，所以一生酷爱读书，手不释卷。"+sep+
      "丁酉日为文昌星，且八字中子为墨池、辛为文笔，所以文章盖世，又为一代书法家。"+sep+
      "年柱七杀坐刃，且七杀癸水通根月支，贵不可言，必掌生杀之权，威镇乾坤。"+sep+
      "早年行西北金水运，运途多蹇，中年以后行南方火土运，势不可挡。"+sep+
      "1949年运交戊午，丁火通根，流年己丑与命局巳酉丑合成财局生助七杀，杀旺身旺，"+sep+
      "又大运午火与提纲子水对冲，子为帝座、午为端门，真是风云际会、气象万千。"+sep+
      "所以于己丑年癸酉月甲子日壬申时开国。1976年大运丙辰，流年丙辰，岁运并临，辰为水库，熄灭丁火，溘然长逝。"};
bazi[9011] = new String[]{"10","6","3","5","9","9","10","4",
    "此杨杏佛命造。时逢癸卯，身旺泄秀，干透丙火，通根于巳，为伤官生才，格之成也。"+sep+
    "只因申辰会水，则杀印不论？年时两癸，群劫争财， 成中有败也。行运到子，申子辰比劫会局，流年癸酉，冲去卯木，被刺。"};
bazi[9012] = new String[]{"10","6","4","6","4","4","3","7",
    "日元太旺，取年上癸水抑制日元为用，行官煞运大发。为交通部长朱家骅命造。"};
bazi[9013] = new String[]{"10","6","5","7","3","7","9","5",
    "此铁樵自造。夫丑乃北方之湿土，能晦丙火之烈，能收午火之焰，又能蓄水藏金。巳乃南方之火火，"+sep+
    "癸临绝地，杯水舆薪，喜其混也。不喜其清也。彼则戊癸合而不化，此则戊癸合而必化，不但不能助杀，"+sep+
    "抑且化火为劫，反助阳刃猖狂。巳中庚金，无从引助，壬水虽通根身库，总之无金滋助，清枯之象，"+sep+
    "兼之运走四十载木火，生助劫刃之地，所以上不能继父志以成名，下不能守田园而创业，骨肉六亲，直同画饼，"+sep+
    "半生事业，亦似浮云。至卯运，壬水绝地，阳刃逢生，遭骨肉之变，以致倾家荡产。犹忆未学命时，请人推算，"+sep+
    "一味虚褒，以为名利自如，后竟一毫不验。岂不痛哉！且予赋性偏拙，喜诚实不喜虚浮，无谄态，多傲慢，交游往来，"+sep+
    "每落落难合，所凛凛者，吾祖吾父，忠厚之训，不敢失坠耳。先严逝后，家业凋零，潜心学命，为糊口之计。"+sep+
    "夫六尺之躯，非无远图之志，徒以末技见哂，自思命运不济，无益于事，所以涸辙之鲋，仅邀升斗之水。"+sep+
    "限于地，困于时，嗟乎！莫非命也！顺受其正云尔！"};
bazi[9014] = new String[]{"10","6","8","10","7","9","3","11",
    "此石友三命造，阳刃格。时透七煞，制刃为用，格之成也。无如月干辛金合丙，年上癸水制煞。为成中有败也。"};
bazi[9015] = new String[]{"10","6","9","11","9","7","9","3",
    "壬午日元，生于戌月，支会火局，年支坐巳，天干皆饮，地支皆离，必须金运以解之也。"+sep+
    "初交辛酉庚申，正得成其既济，解其财杀之势，叨化日之光，丰衣足食；一交己未，"+sep+
    "刑耗异常，戊午财杀并旺，出外遇盗丧身。"};
bazi[9016] = new String[]{"10","6","10","12","1","3","9","9",
    "甲寅日元，生于孟冬，寒木必须用火。柱中四逢旺水伤用，无土砥定，似乎不美，妙在寅亥临合，"+sep+
    "巳火绝处逢生，此即兴发之机。然初运西方金地，有伤体用，碌碌风霜，奔驰未遇；四旬外运转南方火土之地，"+sep+
    "助起用神，弃印就财，财发数万，娶妾，连生四子。由是观之，印绶作用，逢财为祸不小，不如就财，发福最大。"};
bazi[9017] = new String[]{"10","8","1","1","3","3","4","10",
    "官坐伤地，兼之子未相贴，不但天干之官受克，即地支之官亦伤。更嫌劫入财乡，所谓财劫官伤，"+sep+
    "纵使芹香早采，仍蹭蹬秋闱。辛酉庚申运干支皆财，财如放稍春竹，利如蔓草生枝，家业丰裕；"+sep+
    "一交己未，伤妻克子，遭回禄，家业大破。可知穷通在运也 。"};
bazi[9018] = new String[]{"10","8","1","1","3","11","8","4",
   "此梁鸿志之造也。月令官星透出，然月令子水，为戌未所包围，而癸未又官坐伤地，丙辛相合，"+sep+
   "日元之情向财而不向官，各不相谋，似乎夹杂。但细按之，丙火合辛，使财不伤印，"+sep+
   "印制伤以存官，浊中有清，所以贵也。转辗救应，非细辨不知耳。"};
bazi[9019] = new String[]{"10","8","2","4","1","11","2","12",
    "此造柱中，未土深藏，戌土自坐，谓财来就 ，未尝不美。只因四柱无金以成之，五行无火以行之，"+sep+
    "再加亥时，癸水通根生劫，亥卯未全，助起劫刃猖狂。查其岁运，又无成地，以致祖业消磨，克妻无子。"+sep+
    "由此推之，命之所重在运，运其可忽乎谚云：人有凌云志，无运不能自达也。"};
bazi[9020] = new String[]{"10","8","2","4","3","5","7","3",
    "此造以大势观之，官印相生，偏财时遇，五行不缺，四柱纯粹，俨然贵格，不如财官两字休囚，"+sep+
    "又遥隔不能相顾，支全寅、卯、辰。春土克尽，不能生金，金临绝地，不能生水，水之气尽泄于木，"+sep+
    "木之势愈旺而火炽，火炽则气毙，气毙则神枯。行运北方，又伤丙火之气，反助取木之精；即逢金运，"+sep+
    "所谓过于有余，损之反角其触，以致终身碌碌 ，名利无成出。"};
bazi[9021] = new String[]{"10","8","2","4","3","7","8","4",
    "此官清印正格，喜其未卯拱木，纯粹之象，故为人品超群，才华卓越，文望若高山北斗，"+sep+
    "品行似良玉精金。异印星太重，官星泄气，神有余而精不足，以致功名蹭蹬，纵有凌去之志，"+sep+
    "难遂青钱之选，还喜格正局清，财星逢合，虽然大材小用，究竟名利两全，仕路清高。"+sep+
    "施菁莪(培育人材)之雅化，振古木之人才也。"};
bazi[9022] = new String[]{"10","8","4","6","1","7","7","7",
    "甲午日元，支全巳午未，燥烈极矣。天干金水无根，反激火之烈，只可顺火之气也。"+sep+
    "初运木火，顺其气势，财喜频增，至癸丑，叹刑丧，遭挫折，破耗多端；壬子冲激更甚，犯人命，遭回禄，破家而亡。"};
bazi[9023] = new String[]{"10","8","4","6","3","7","10","6",
    "此支类南方,又生巳时，暖之至矣。天干丙癸，地支全无根气，所谓暖之至，寒无根，反以无寒为美。"+sep+
    "所以初运丙辰，叨荫庇之福；乙卯甲寅，泄水生火，家业增新；癸丑寒气通根，叹椿萱之并逝，"+sep+
    "嗟壮桂之摧残；壬子运，祝融之变，家破而亡。"};
bazi[9024] = new String[]{"10","8","8","10","1","9","3","3",
    "此为安徽主席刘镇华之造，丙辛相合，而官旺通根，合而不失其用。此为官多同煞，以丙火制官为用也。"};
bazi[9025] = new String[]{"10","8","8","10","2","10","4","12",
    "此阎锡山造，辛金透，丁火刚，秋木盛也。然须注意者，辛金必须透出，方为有力而成贵格。"+sep+
    "乙为柔木，不怕煞旺也，不透则不贵，丙丁亦以透出为美。阎商陆三造，丙火伤官制煞，"+sep+
    "不知丁火食神制煞为有力何则？丙火逢辛反怯，不能显其力。此商陆两造，所以不及阎造也。"};
bazi[9026] = new String[]{"10","10","1","1","3","3","2","8",
    "丙生子月，坐下长生，印透根深，弱中之旺。喜其官星当令，透而生财，所谓一清到底有精神也；"+sep+
    "更妙源流不悖，纯粹可观。金水运中，登科发甲。名高翰苑；惜中运火土，以致终老于词林。"};
bazi[9027] = new String[]{"10","10","1","1","3","3","5","11",
    "此造以甲木为精，衰木得水滋，而逢寅禄为精足，以戊土为神，坐戌通根，寅戌拱之为神旺。"+sep+
    "官生印，印生身，坐下长生为气贯流通，生化五行俱足。左右上下情协不悖，官来能挡，劫来有官，"+sep+
    "食来有印，东西南北之运，皆可行也，所以一生富贵福寿 ，可谓美矣。"};
bazi[9028] = new String[]{"10","10","1","1","4","4","3","7",
    "子午卯酉，四冲也，而此造则非但不冲，反为四助。卯酉之间，隔以子水，子午之间隔以卯木，"+sep+
    "金水木火，以次相生，以印化煞为用。遇水得木引化，遇金得水引化，不伤印绶用神，虽冲而不冲也。"};
bazi[9029] = new String[]{"10","10","1","1","5","1","5","7",
    "此四柱皆水，又得金生。土衰极者，似水也。初运癸亥，平宁之境；壬戌水无根，土得地，"+sep+
    "刑丧破耗，家业消亡；辛酉庚申二十年，大得际遇，白手发财十余万；己未运破去数万，寿亦在未而止。"};
bazi[9030] = new String[]{"10","10","1","1","7","5","1","9",
    "庚辰日元，支逢禄旺，水本当权，又会水局，天干枯木无根，置之不论，谓金水二人同心，"+sep+
    "必须顺其金水之性。故癸亥壬运，荫庇有余；戌运制水，还喜申、酉、戌全，虽见刑丧地而无大患，"+sep+
    "辛运入泮，酉运补廪，庚运登科，申运大旺财源；一交已未，运转南方，刑妻克子，家业渐消。戊午触水之性，家业破尽而亡。"};
bazi[9031] = new String[]{"10","10","1","1","10","12","8","10",
    "此福建人不知姓氏，庚午冬，余推之，大取金水运，不取火土。彼曰：金水旺极，何以又取金水？"+sep+
    "则命书不足凭乎？书曰：旺则宜泄宜伤，今满局金水，反取金水，是命书无凭矣。余曰：命书何为无凭？"+sep+
    "皆因不能识命中五行之奥妙耳。此造水旺逢金，其势冲奔，一点甲木枯浮，难泄水气，如止其流，反成水患，"+sep+
    "不若顺其流为美。初运癸亥，助其旺神，荫庇有余；一交壬戌，水不通根，逆其气势，刑耗并见；"+sep+
    "辛酉庚申，丁财并旺；己未戊午，逆其性，半生事业，尽付东流，刑妻克子，孤苦无依。此所谓昆仑之水，"+sep+
    "可顺而不可逆也。顺逆之机，不可不知也。"};
bazi[9032] = new String[]{"10","10","2","2","7","3","3","1",
    "此浙江省长张载阳造。时上七煞透出，用年上癸水伤官制煞，中隔乙木，则伤官生财，财生煞，"+sep+
    "为格之败。妙在乙从庚合，则癸水不生乙木而制煞，以本身之合为救应也。"+sep+
    "此造虽非月令伤官，而十二月余气，时子年癸，亦作杂气伤官论也。丙火七煞，通根于寅，为根重，"+sep+
    "癸亥至己未伤印比劫均美，而以辛酉庚申身旺之地为尤佳。特不可再行财乡煞地耳。"};
bazi[9033] = new String[]{"10","10","4","6","6","4","1","11",
    "民初浙江省长褚辅成造。己土生于四月，丁火透出，火炎土燥，得年上癸水破印生官，以癸水为救应之神也。"+sep+
    "巳酉会局，食伤碍官，妙在癸水透，则食伤之气生财，故动亦仅癸运为美也。此造粗相之，财印相碍，官伤相碍，"+sep+
    "官伤相碍，不知贵在何处，细按方知，《滴天髓》云，澄浊求清清得净，时来寒谷也回春，正谓此也。"};
bazi[9034] = new String[]{"10","10","4","6","9","7","3","7",
    "淞沪护军使何丰从造。月令才煞，日元弱极，妙在巳酉一合，财化为印，癸克去丁，使丁不合于壬，亦不伤印， 所谓用劫护印也。" + sep +
    "时上丙火透出，财旺生官，而财印不相碍，遂成贵格。设有癸水之救应，而无巳酉之变化，亦不成也。"};
bazi[9035] = new String[]{"10","10","6","8","3","7","10","6",
    "丙午日元，支类南方，未土秉令，己土透出，火土伤官，藏财受劫，无官则财无存，"+sep+
    "无财则官亦无根；况火焰土燥，官星并透，以官为用。运至火土，破耗刑丧；乙卯甲寅运，"+sep+
    "虽能生火，究竟制伤卫官，大获财利，纳粟出仕；癸丑壬子运，由佐贰而升县令，名利两全。"};
bazi[9036] = new String[]{"10","10","8","10","2","2","8","6",
    "许世英造，巳酉丑三合化金,十九误作从煞，不知印绶有根，即不嫌身弱，仍喜制煞之运。"+sep+
    "虽乙木无根但杀有食伤制，故不从。乙木太弱，虽印透通根，不作从论，究嫌秋木不盛，"+sep+
    "丙火藏巳，三合牵绊，制煞无力。虽为贵格，但有高低之分。如若丁火透出，而辛金不透，"+sep+
    "则制过七煞，庸碌之人耳。非秋木不作此论。"};
bazi[9037] = new String[]{"10","10","8","10","6","4","2","12",
    "此本篇刘提督造也。虽癸与乙之间，隔以已辛，财不党煞，但身弱克泄两忌。幸所行之运己未、"+sep+
    "戊午、丁巳、丙辰，印绶比劫相连，故能贵为提督。否则，格局虽清，无益于事，若非运助，安能望贵乎？"};
bazi[9038] = new String[]{"10","10","10","12","5","1","4","6",
    "日禄归时也。王君月令正财太旺，归禄帮身，运至比劫而致富，所谓四柱没官星，青云得路也。"+sep+
    "黄君官煞太旺，恃巳禄为日元之根，尚须通关用印，运至印地最美。比劫帮身敌煞虽为美运，"+sep+
    "巳落二乘归禄，以见官为破格者，正以身煞相敌，故以不见为美也。"};
bazi[9039] = new String[]{"10","12","1","3","10","12","1","3",
    "此水木伤官，喜其无财，故继志书香，嫌其地支寅亥化木，伤官太重，难遂青云。辛运入泮，"+sep+
    "亥运补廪，庚戌加捐出仕。己酉戊申二十年土金，生化不悖，仕至别驾，宦资丰厚。"};
bazi[9040] = new String[]{"10","12","2","4","9","9","2","6",
    "此水木伤官，日主坐长生，年支禄旺，日主不弱 ，足以用巳火之财。嫌其中运金水，"+sep+
    "半生碌碌风霜，起倒万状。至戊运，紧制亥水之劫，合起卯木化财，骤然发财数万；至酉冲破伤官，生助劫印，不禄。"};
bazi[9041] = new String[]{"10","12","5","7","9","7","6","10",
    "此造旺杀逢财，喜其合也。妙在癸水临旺，合而不化，则有情戊土，不抗壬水也。合而化，则无情化火，"+sep+
    "仍生土也。由此以推，运走东方木地，早遂青云之志；运走北方水地，去财护印，翔步天衢，置身日舍也。"};
bazi[9042] = new String[]{"10","12","6","8","3","7","6","2",
    "火长夏令，原属旺论，然时在季夏，火气稍退，兼之重叠伤官泄气，丑乃湿土，能晦丙火之光，"+sep+
    "以旺变弱。浊气当权 ，清气失势，兼之先行三十年火土运，半生起倒多端。至乙卯甲寅，"+sep+
    "木蔬厚土，扫除浊气，生扶日元，卫护官星，左图右史，财茂业成。"};
bazi[9043] = new String[]{"10","12","6","8","10","12","6","8",
    "此土水相克，两气成象，纯杀无制，日主受伤。初走火土之乡，生助七杀，正是明月清风谁与共，"+sep+
    "高山流水少知音；一交乙卯，运转东方，制杀化权，得奇遇，飞升县令。由此观之，生局必须食为美，"+sep+
    "印局无秀气，不足为佳。财局身财均敌，日主本气无伤，然又要运程安顿得好，斯为全美，一遇破局，则祸生矣。"};
bazi[9044] = new String[]{"10","12","8","10","5","9","6","8",
    "此土金伤官，财星太重，以致拂意芸窗。幸喜未时，劫财通根为用；更妙运途却佳，"+sep+
    "捐县佐出仕。至丁巳丙辰运，旺印用事，仕至州牧，宦资丰厚；乙卯冲克不静，罢职归田。"};
bazi[9045] = new String[]{"10","12","10","12","3","5","1","7",
    "此官杀乘旺，原可畏也，然喜午时生食制煞，时干透甲，生火泄水。旺杀半化为印，衰木两遇长生，"+sep+
    "赖此木根愈固，上下情协，不诬也。白手成家发财数万。"};
bazi[9046] = new String[]{"10","12","10","12","4","4","10","4",
    "此造干透三癸，支逢两亥，乘权秉令。喜其无金，两印拱局，生化不悖情而纯粹，辛酉庚申运中，"+sep+
    "蹭蹬功名，刑耗并见，已未交运，干制杀，支会印，功名层叠而上；接行戊午、丁巳、丙运，仕至观察，名利双辉。"};
bazi[9047] = new String[]{"10","12","10","12","9","1","7","1",
    "此造四柱皆水，一无克泄，其势冲奔，不可遏也。初运壬戌，支逢土旺，早见刑丧；辛酉庚申，"+sep+
    "干支皆金，所谓月印午江银作浪 ，门临五福锦铺花；交己未，妻子皆伤，家业破尽；戌午运，贫乏不堪，忧郁而卒。"};
    bazi[9049] = new String[]{"10","8","2","4","2","12","5","3",
            "此命不识其姓氏。亦由平翁告我行。据云。乃上海工部局小工头目。已积资成富。生活歽优。余曰乙诞仲春。"+sep+
            "支全亥卯未。为曲直仁寿格。所喜四柱绝金。格局无破。时落戊寅。寅为火土生地。木之禄旺，则流通秀气坚固格局。"+sep+
            "更如锦上添花。是宜由渐入丰。空拳致富者也。前行之运。都属水乡。颇见安顺。现行庚金。不利于格。顺中防逆。"+sep+
            "还增流年无金。滞而不凶。戍运为火库。为燥土。豪富无疑已运有乙木之夺。盖即美中不足，狗尾续貂矣。平翁质余曰。"+sep+
            "命局既如是隽美。何以不和名公鉅卿。岂必好命。熙来攘往。宁及此群之优游稳固。且驾手数午千工人之上，鹤立对外开放群。"+sep+
        "亦不失无冕帝持之乐也。西汉黄霸月云。无官在职。一身爽轻。若此命造。虽少印绶之掌绾。讵不愈于会高堂。骑大马之显达耶。"};

  }
}