package org.boc.db;

public class ChengGu {
  private String sep = "\r\n    ";

  public final int[][] yz = new int[11][13];
  public final int[] mz = {0, 6, 7, 18, 9, 5, 16, 9, 15, 18, 8, 9, 5};
  public final int[] dz = {0, 5, 10, 8, 15, 16, 15, 8, 16, 8, 16,
                                  9, 17, 8, 17, 10, 8, 9, 18, 5, 10,
                                  10, 9, 8, 9, 15, 18, 7, 8, 16, 6};
  public final int[] hz = {0, 16, 6, 7, 10, 9, 16, 10, 8, 8, 9, 6, 6};

  {
    yz[1]= new int[]{0, 12,0,12,0,8,0,15,0,5,0,15,0};
    yz[2]= new int[]{0, 0,9,0,8,0,7,0,6,0,15,0,9};
    yz[3]= new int[]{0, 16,0,6,0,8,0,1,0,5,0,6,0};
    yz[4]= new int[]{0, 0,8,0,7,0,6,0,5,0,14,0,16};
    yz[5]= new int[]{0, 15,0,8,0,12,0,19,0,14,0,14,0};
    yz[6]= new int[]{0, 0,7,0,19,0,5,0,6,0,5,0,9};
    yz[7]= new int[]{0, 7,0,9,0,12,0,9,0,8,0,9,0};
    yz[8]= new int[]{0, 0,7,0,12,0,6,0,8,0,16,0,17};
    yz[9]= new int[]{0, 5,0,9,0,10,0,8,0,7,0,10,0};
    yz[10]= new int[]{0, 7,0,12,0,7,0,7,0,8,0,6,0};
  }

  public String[] desc = new String[100];
  {
    desc = new String[]{"","","","","","","","","","",""
        ,"","","","","","","","","","",""
        ,"◆身寒骨冷苦伶仃，"+sep+"◆此命推来生乞人；"+sep+"◆碌碌巴巴无度日，"+sep+"◆终年打拱过平年。"
        ,"◆此命推来骨自轻，"+sep+"◆求谋作事事难成；"+sep+"◆妻儿兄弟应难许，"+sep+"◆别处他乡作散人。"
        ,"◆此命推来福禄无，"+sep+"◆门庭困苦总难营；"+sep+"◆六亲骨肉皆无靠，"+sep+"◆流到他乡作老翁。"
        ,"◆此命推来祖业微，"+sep+"◆门庭营度似稀奇；"+sep+"◆六亲骨肉如冰炭，"+sep+"◆一生勤劳自把持。"
        ,"◆平生衣禄苦中求，"+sep+"◆独自经营事不休；"+sep+"◆离祖出门心在外，"+sep+"◆晚来衣禄自无忧。"

        ,"◆一生作事少商量，"+sep+"◆难靠祖宗作主张；"+sep+"◆独马单枪空做去，"+sep+"◆早来晚岁部无长。"
        ,"◆一生作事似飘蓬，"+sep+"◆祖宗产业在梦中；"+sep+"◆若不过房并改姓，"+sep+"◆也当移徙两三通。"
        ,"◆初年运限未曾享，"+sep+"◆纵有功名在梦中；"+sep+"◆须过四旬绕可上，"+sep+"◆移居改姓始为良。"
        ,"◆劳劳碌碌苦中求，"+sep+"◆东走西奔何日休；"+sep+"◆若使终身勤与俭，"+sep+"◆老来稍可免忧愁。"
        ,"◆忙忙碌碌苦中求，"+sep+"◆何日云开见日头；"+sep+"◆难得祖基家可立，"+sep+"◆中年衣食渐无忧。"

        ,"◆初年运蹇事难谋，"+sep+"◆渐有财源如水流；"+sep+"◆到得中年衣食旺，"+sep+"◆那时名利一齐来。"
        ,"◆早年做事事难成，"+sep+"◆百计徒劳枉费心；"+sep+"◆半世自如流水去，"+sep+"◆后来运到得黄金。"
        ,"◆此命福气果如何，"+sep+"◆僧道门中衣禄多；"+sep+"◆离祖出家方得妙，"+sep+"◆终朝拜佛念彌陀。"
        ,"◆平生福量不周全，"+sep+"◆祖业根基觉少传；"+sep+"◆营业生涯宜守旧，"+sep+"◆时来衣食胜从前。"
        ,"◆不须劳碌过平生，"+sep+"◆独自成家福不轻；"+sep+"◆早有福星常照命，"+sep+"◆任君行去百般成。"

        ,"◆此命般般事不成，"+sep+"◆弟兄少力自孤成；"+sep+"◆虽然祖业须微有，"+sep+"◆来得明时去得明。"
        ,"◆一生骨肉最清高，"+sep+"◆早入黄门姓名标；"+sep+"◆待看看将三十六，"+sep+"◆蓝袍脱去换红袍。"
        ,"◆此命终身运不穷，"+sep+"◆劳劳作事尽皆空；"+sep+"◆苦心竭力成家计，"+sep+"◆到得那时在梦中。"
        ,"◆生平衣禄是绵长，"+sep+"◆件件心中自主张；"+sep+"◆前面风霜多受过，"+sep+"◆后来必定享安康。"
        ,"◆此命推来事不同，"+sep+"◆为人能干略凡庸；"+sep+"◆中年还有逍遥福，"+sep+"◆不比前年运未通。"

        ,"◆得宽怀处且宽怀，"+sep+"◆何用双眉皱不开；"+sep+"◆若使中年命运济，"+sep+"◆那时名利一齐来。"
        ,"◆为人心性最聪明，"+sep+"◆作事轩昂近贵人；"+sep+"◆衣禄一生天数定，"+sep+"◆不须劳碌是丰享。"
        ,"◆来事由天莫苦求，"+sep+"◆须知福禄胜前途；"+sep+"◆当年财帛难如意，"+sep+"◆晚景欣然便不忧。"
        ,"◆名利推来竟若何，"+sep+"◆前途辛苦后奔波；"+sep+"◆命中难养男与女，"+sep+"◆骨肉扶持也不多。"
        ,"◆东西南北尽皆空，"+sep+"◆出姓移名更觉隆；"+sep+"◆衣禄无亏天数定，"+sep+"◆中年晚景一般同。"

        ,"◆此命推来旺末年，"+sep+"◆妻荣子贵自怡然；"+sep+"◆平生原有滔滔福，"+sep+"◆可有财源如水源。"
        ,"◆幼年运道未曾享，"+sep+"◆若是蹉跎再不兴；"+sep+"◆兄弟六亲皆无靠，"+sep+"◆一身事业晚年成。"
        ,"◆此命推来福不轻，"+sep+"◆自成自立耀门庭；"+sep+"◆从来富贵人亲近，"+sep+"◆使婢差奴过一生。"
        ,"◆为名为利终日劳，"+sep+"◆中年福禄也多遭；"+sep+"◆老来是有财星照，"+sep+"◆不比前番日下高。"
        ,"◆一世荣华事事通，"+sep+"◆不须劳碌自享丰；"+sep+"◆弟兄叔侄皆如意，"+sep+"◆家业成时福禄宏。"

        ,"◆一世享通事事能，"+sep+"◆不须劳思自然能；"+sep+"◆家族欣然心皆好，"+sep+"◆家业丰享自称心。"
        ,"◆此格推来气像真，"+sep+"◆兴家发达在其中；"+sep+"◆一生福禄安排家，"+sep+"◆欲是人间一富翁。"
        ,"◆此命推来厚且清，"+sep+"◆诗画满腹看功成；"+sep+"◆丰衣足食自然稳，"+sep+"◆正是人间有福人。"
        ,"◆走马扬鞭争名利，"+sep+"◆少年做事费筹谋；"+sep+"◆一朝福禄源源至，"+sep+"◆富贵荣华耀六亲。"
        ,"◆此格推来礼义通，"+sep+"◆一生福禄用无穷；"+sep+"◆甜酸苦辣皆尝过，"+sep+"◆财源滚滚稳且丰。"

        ,"◆福禄丰盈万事全，"+sep+"◆一生荣耀显双亲；"+sep+"◆名扬威振人钦敬，"+sep+"◆处世逍遥似遇春。"
        ,"◆平生福禄自然来，"+sep+"◆名利双全福禄偕；"+sep+"◆雁塔题名为贵客，"+sep+"◆紫袍玉带走金阶。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"

        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"

        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"

        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"
        ,"身寒骨冷苦伶仃，"+sep+"此命推来生乞人；"+sep+"碌碌巴巴无度日，"+sep+"终年打拱过平年。"

        ,"","","","","","","","","",""
        ,"","","","","","","","","",""};
  }

}