package org.boc.db;

public class GuiGu {
  private String sep = "\r\n    ";
  private String sep2 = "\r\n    ";
  public final String[][] jing = new String[11][13];
  {
    jing[1][1] = "甲甲 　 　 震 卦 　 　 雷霆远震格" + sep +
        "长天忽震雷霆响，凛凛帷中独有威，惊散雁鸿飞塞远，狂风飘散落花枝。" + sep +
        "山南山北乡关阔，家住潇湘东复西，借问百年堪结子，一条球棒引孩儿。" + sep + sep2 +
        "天 鸾 　 　 金 雀 　 　 天 贵" + sep +
        "此星照命，风霜早历，奔驰度量，高胸次远。" + sep +
        "手段大，机谋深，心慕高人，见事敢做。" + sep +
        "亲君子，远小人，退神重重，多奸疑，多思虑，不骄傲。" + sep +
        "恬淡只因立志不一，性乱难拘所作于人。不足头女末男，便是这个五行所注。" + sep +
        "初年未称意，末限方成。" + sep +
        "述云：过水自有人相接，提我登云别有梯。" + sep;

    jing[1][2] = "甲乙 　 　 恒卦 　 　 泊水鸳鸯格" + sep +
        "群群雁过远离塞，雨打鸳鸯各自飞，纵有海风吹不断，也须相守自相宜。" + sep +
        "满树花残留一叶，好逢前发马头时，若见子宫须发禄，牛首牵弓必射之，" + sep +
        "寿命齐松柏，天龄不待时，鳌鱼游水远，平步上云梯。" + sep + sep2 +
        "此命造化，性格恬淡，气宇风骚，胸襟磊落，言语刚强。放荡所为，不会深思远虑。" + sep +
        "从前吃误两三番，方才省觉：滋润处，不滋润；安闲处，不安闲。广孝不记，心力不足。" + sep +
        "初年件件爱好，中年事事懒惰，凡事要一番做两番。头子难招，妻宜两硬，交友水炭，多成多败。" + sep +
        "述云：一番风雨足，方始见生涯。";
    jing[1][3] = "甲丙 　 　 丰卦 　 　 马瘦长川格 " + sep +
        "遥遥千里见波涛，独有心机志气高，故国岂无根叶在，争名图利自萧条。" + sep +
        "青山雁侣双双远，岁寒松柏枝枝青，君今莫问荣枯事，晚景终为富贵豪。" + sep +
        "生涯未遇平生志，总使身闲心未闲，酉进辰年龙在水，无忧人在水归山。 " + sep + sep2 +
        "天 滞 　 　 天 嚣 　 　 天 说 " + sep +
        "此星照命，技艺工巧之星，学术多能之士。清闲秀丽，险处无虑，凶中反吉，临危有救。" + sep +
        "见善不欺，君子成持，小人欺罔。为人性快，使人欺，能有纲纪自在中。" + sep +
        "寻出不自在，要好处，乐得一场愁。雁行有侣有妻，妾各难老。凡事虑心，且宜戒酒。" + sep +
        "述云：孤中孤不尽，一世见凶危。";
    jing[1][4] = "甲丁 　 　 豫卦 　 　 春暖鹃啼格  " + sep +
        "祖计纷纷东又西，绿杨深处子规啼，山空雾润猿声切，涧远林深鸟倦飞。" + sep +
        "雁宿野花岩岁月，鸳鸯雨打不分离，终知意在逍遥外，争奈尘心染是非。" + sep +
        "积岁多迍蹇，如今渐渐通；年老春色好，花枝一丛丛。  " + sep + sep2 +
        "天 拗 　 　 天 慵 　 　 天 执  " + sep +
        "此星照命，眉宇清秀，性格高标。凡事见快，珍珑见识。知高下、识尊卑。" + sep +
        "只缘志大心高，立志不定。紧慢不均，大宽小急，多学少成，忘前失后，有始无终。" + sep +
        "会施为，能妆饰，无下口不吃饭，无衣冠不出门。财帛聚散，假小心，多鲁莽。" + sep +
        "虽然遍历风霜，却喜危中有救。恶星出限，末主无疑。述云：若要心身定，末主始荣昌。";

    jing[1][5] = "甲戊 　 　 小过卦 　 　 渔父收纶格  " + sep +
        "渔父归庄利禄名，旗横随后诏宣城，年来塞外思乡国，游水中心逐浪平。" + sep +
        "生计必从前定立，运时应待百年荣，天边孤雁高飞处，花落岩前月满庭。" + sep +
        "带禄牵牛归路时，马猴消息应天时，庭前早有文书至，何必自心尽皱眉。  " + sep + sep2 +
        "天 晦 　 　 天 淹 　 　 天 贵  " + sep +
        "此星照命，乃慵懒暗昧之宿。作事退晦，行坐踌躇，不会俯仰人，不会拘束人。" + sep +
        "衣禄自然丰厚，大利改更不静。在祖宅难为六亲、兄弟冰炭，只宜离祖过房、行赘远方。" + sep +
        "求财不利家，为人无私曲，情性宽紧不调，从来凶险多经历，只得凶中有救。" + sep +
        "述云：子午才来时应泰，龙蛇地上必深财。";
    jing[1][6] = "甲己 　 　 丰卦 　 　 凤宿春林格  " + sep +
        "凤凰池上钓连鳌，风卷长沙逐浪涛，雁过碧天群失队，违亲背祖奋身高。" + sep +
        "花开雨打枝头损，果结风吹实不牢，北畔是家南畔立，晚年须遇贵人豪。" + sep +
        "遇犬边添翼，逢牛角畔刀，限随羊马发，身上碧云霄。  " + sep + sep2 +
        "天 曜 　 　 天 章 　 　 紫 微  " + sep +
        "此星照命，吉利之星，祥瑞之宿，静办处反成啾唧，尴尬处却有救神。" + sep +
        "一生巧中成拙，是处成非。此命是非多惹，才得自然，朋辈如同亲眷，骨肉恰似路人。" + sep +
        "妻是瓜皮搭李树，李树搭皮儿。兄弟不和合，子息不能全，目下啾唧有贵人举目。" + sep +
        "述云：贵人来举目，何愁不称心。";
    jing[1][7] = "甲庚 　 　 归 妹 卦 　 　 花 遇 残 愁 格  " + sep +
        "女嫁男婚寡与鳏，心灵机巧性居闲，江边雁伴飞南北，百岁荣华醉梦间。" + sep +
        "远树落花存果少，可怜香径蝶蜂还，路遥千里知音绝，限遇猴狼必称颜。" + sep +
        "逆水行舟体不安，好于舟内把鱼竿，庚辛自应身危险，壬癸相逢始好看。  " + sep + sep2 +
        "云雨　　天嚣　　天机  " + sep +
        "此星照命，作事刚柔，所为平品。凡事劳心未达，要高未高，要显未显，立志不一，" + sep +
        "外观有余。内看不足，弄巧成拙；近处无缘，远处钦慕；" + sep +
        "骨肉无分，子息见迟；螟蛉庶出，赘婿之类。眼前一件事，心下万般量，只是虚名薄利未到。" + sep +
        "风光寅申运气裹，好事立成。述云：目下心不足，后有贵人成。";
    jing[1][8] = "甲辛　　大壮卦　　月远云霄格  " + sep +
        "金乌明处蟾蜍黑，高山险处不须行，雁过长江波浪急，平生活计破中成。" + sep +
        "好似电光风裹烛，花开花落不堪论，晚景到来须享福，百年喜气一身盈。" + sep +
        "思虑不曾闲，身闲心不闲，饶君多计较，虽有也忧煎。  " + sep + sep2 +
        "金凤　　玉壶　　凤关  " + sep +
        "此星照命，如鹊巢生凤，似蚌长明珠。作事先难后易，只宜别祖离宗，过房异姓，" + sep +
        "入赘迁居。克陷六亲，兄弟不睦，机深志远，作事刚柔，口直心慈，不受触，不藏事，" + sep +
        "口伤人招人相怪。大宽小急，作事猖狂。妻命两敌免克，可保到头。" + sep +
        "述云：七九年来收算子，纵横好用自家风。";
    jing[1][9] = "甲壬　　解卦　　芳草逢春格  " + sep +
        "春来芳草依依绿，雪散纷纷见枯竹，空中群雁各东西，伤情独向滩边宿。" + sep +
        "雨里桃花风里烛，平生到此心未足，树头花发两三枝，一朵枝头红似玉。" + sep +
        "陆地行舟水未来，空将心事委尘埃，逢牛渐渐登云阁，跨马骑牛大路开。  " + sep + sep2 +
        "金鸾　　天印　　科名  " + sep +
        "此星照命，乃福禄之星。科名之宿，如珠之命。  " + sep +
        "自立规矩，自辟门庭。比如大海之舟，又似水中萍梗。" + sep +
        "有三般早：当家早，忧虑早，历事早；有三般迟：发禄迟，妻子迟，享福迟。" + sep +
        "只得命中有退神重重，若要名成利就，除非庚午年。多学少成，忘前失后。" + sep +
        "述云：龙蛇过了逢牛马，别有提携一贵人。";

    jing[1][10] = "甲癸　　小畜卦　　白玉离尘格  " + sep +
        "年光迅速催人老，风过潇湘春又秋，雁过碧天沙塞远，雨残花败果难收。" + sep +
        "知君颇得高人用，喜慰安然禄自攸，欲问平生何处好，南迁京国度扬州。" + sep +
        "苦处还逢乐，身高又欲危，犬头人发箭，戍遇虎生威。  " +sep + sep2 +
        "天福　　天星　　文贵  " + sep +
        "此星照命，禀五行之气福，居百顺之祥声，闻震屋之雷气，达刚柔之象情。" + sep +
        "性机谋深，作事忘前失后，多学少成，件件向前，般般费力。" + sep +
        "划船人少，距立人多，相成者少，相败者多。性直口毒，招人相怪。" + sep +
        "男女生多收少，妻宫两硬无伤。目下未得安宁，除是子寅路通。" + sep +
        "述云：牛羊若得鸡声唱，便是安闲享福人。";

    jing[2][1] = "乙甲　　益卦　　行稳梅林格  " + sep +
        "日月分明照太阳，一身孤节最高强，空中雁阵东西远，南北鸳鸯逐水长。" + sep +
        "有禄遇羊头上发，树头枝叶暮秋残，知君心有尘劳外，不被尘劳不奋扬。" + sep +
        "生计从来未委泥，早年兄弟见分离，龙蛇若遇还通泰，虎上高山意便奇。  " +sep + sep2 +
        "禄存　　天感　　天聆  " + sep +
        "此星照命，事业艰辛。幼年见成之规模空费，万般之心力三思进退、百种盈亏。" + sep +
        "破祖业，财帛难聚，有险难之处喜得救神，行皆好事翻成怨恨。近处无缘，远方人喜。" + sep +
        "危难立个家计，无心中遇个因缘。" + sep +
        "子息见多难存，头子须是唤爷作伯、呼母为姑方可，若到猴鸡，必能自成自立。" + sep +
        "述云：从来磨难多劳力，今日淘沙始见金。";

    jing[2][2] = "乙乙　　巽卦　　鸿雁潇湘格  " + sep +
        "遇贵还须得意时，平生刚志与松齐，登山履险云山远，绿树逢春发旧枝。" + sep +
        "鸿雁过溪双远影，百岁荣华见一儿，更问双蛇平地起，牛羊两路必登梯。" + sep +
        "雪落纷纷三十九，天晴日暖双蛇走，长安路远遇危桥，劝君莫饮春前酒。  " +     sep + sep2 +
        "天蛊　　天毒　　紫宸  " + sep +
        "此星照命，退晦淹留之宿，安闲自在之星。凡有凶危，龙头蛇尾，好事多磨，凶中有救。" + sep +
        "贵人遇如不遇，财禄秀而不实。学堂虽有，多学少成。也不会恶人，也不会救人。" + sep +
        "退神重重，使钱如风，撰钱如雨；有钱会使，无钱会耐，成财不一。" + sep +
        "中年合带暗疾，雕青破肉可以延年，要安稳直待辰寅。" + sep +
        "述云：直待一声雷奋发，管教一跃入青云。";

    jing[2][3] = "乙丙　　家人卦　　日月重明格  " + sep +
        "日月交光色渐明，重楼天大两重明，天边雁叫芦花远，池沼鸳鸯忆出群。" + sep +
        "生来未发应无马，名利成时待虎年，借问桃花成几果，雨中风送一残灯。" + sep +
        "借问何为业，龙蛇水畔僧，马牛逢荐举，更上楼一层。  " +      sep + sep2 +
        "天佑　　天礼　　天挥  " + sep +
        "此命星如凤生鹊巢、龙长蛇腹，性紧多谋，常怀不足。" + sep +
        "作事踌躇，所为进退自在中出，苦辛安闲处惹是非，尽心竭力似春花逢夜雨、秋月被浮云。" + sep +
        "会趁钱不如省用度，一似门楼前狮子、草屋下珠廉，强施设、硬追陪。" + sep +
        "述云：贵人轻借力，又立一翻新。";

    jing[2][4] = "乙丁　　观卦　　鱼游清波格  " + sep +
        "你亲非我我非亲，家外荣身隔故人，兴废想应前分定，利名还要待终人。" + sep +
        "高峰顶上群离雁，渭水河边钓锦鳞，借问花残莺舌老，禁烟春色柳青青。" + sep +
        "头枕山前鹿，心思水上财，骑牛须遇虎，方有贵人来。  " +     sep + sep2 +
        "天嚣　　天禄　　孤虚  " + sep +
        "此星照命，困干之宿，虚名之星。人命值之，无见成之。" + sep +
        "福独拳，自立理。要分明。作事自是气高、性直、口毒、心慈、亲眷无缘，朋友少义，" + sep +
        "知心者少，妒害者多，只喜凶中有救。用心多，历事早。要静办，未静办；" + sep +
        "要安闲，不安闲，却有晚景好且待之。" + sep +
        "述云：长安道上花闲尽，谁信山边有彩云。";

    jing[2][5] = "乙戊　　渐卦　　鹤立松林格  " + sep +
        "生同出处鹤离巢，飞上青松立树梢，学问不成终是去，盖根遮叶未能抛。" + sep +
        "空中二雁争群队，池内鸳鸯颈不交，姑舅六亲虽共处，成败艰辛命里招，" + sep +
        "种菜须宜时，花开发旧枝，一朝身立奋，成凤附瑶池。  " +     sep + sep2 +
        "天休　　天霞　　天权  " + sep +
        "此星照命，如仙女种田，天桥车水，安闲中寻出辛苦，享福处不得安闲。" + sep +
        "为人慷慨，见识高明，平生性格，如泉击石。区区心力，成三四处之规模；" + sep +
        "滚滚平生，做两三场之活计。件件自向前，般般自费力，有福不会享，有事不能藏。" + sep +
        "性直无私，恩爱中反招不足。述云：莫恨春迟花落早，秋来犹有一枝芳。";

    jing[2][6] = "乙己　　谦卦　　篱外海棠格  " + sep +
        "重台遥望仰天高，风卷长沙起浪涛，莫问平生荣与辱，身成上马指龙毛。" + sep +
        "潇湘雁过离踪迹，吴越相持奋气豪，由恨此生根叶好，不坚牢处也坚牢。" + sep +
        "意欲谋前路，心怀未肯行，马羊逢举力，方始得通亨。  " +     sep + sep2 +
        "天柱　　天极　　天飒  " + sep +
        "此星照命，乃是凿山取路之星，掘石没泉之宿。有心胆，有机谋，有措置，会施为。" + sep +
        "知轻重，识高低，别贵贱，有威仪。如不系之舟，若初生之月。" + sep +
        "为人慷慨，禀性持达，只因运未至。且戒且忍，晚年发迹，无心中遇个贵人，" + sep +
        "无意中遇项财物，荣身润已，称平生之志矣。" + sep +
        "述云：正好求谋安乐计，忽然日暖动蛇乡。";

    jing[2][7] = "乙庚　　中孚卦　　幸遇金门格  " + sep +
        "玉殿金门到不难，一心重度两重山，空中雁叫飞二只，一岁儿童一日闲。" + sep +
        "鹿在远乡归故里，箭随风月过云间，谁知性恋逍遥外，争奈身闲心未闲。" + sep +
        "秉志刚柔足，机谋出众群，资财盈白首，无意遂功名。  " +      sep + sep2 +
        "天福　　天机　　括舌  " + sep +
        "此星照命，金银斗秤之星，福禄簿书之宿。件件劳心，般般费力，机谋深密，性劣心高。" + sep +
        "会驱驾，能担当，假小心，喝大采。勤烧香念佛，有救人心，无伤人意。要使大钱，会吃大饭。" + sep +
        "结识人，尴尬处能分理，险难处会脱身。猴鼠相逢，必能发奋。目下时运不衬，淹留未能显达。" + sep +
        "述云：花正开时遭雨打，月当圆处被云遮。";

    jing[2][8] = "乙辛　　涣卦　　海底明珠格  " + sep +
        "明珠海底隐寒光，用意成时却有伤，孤雁叫天离塞远，双龙吟雨更苍忙。" + sep +
        "田中祖业更新主，境外荣身立旧庄，借问百年成甚事，枝头花果一双双。" + sep +
        "卧虎相将起，人眼醉渐忙，猴蛇终见喜，卓立自相当。  " +      sep + sep2 +
        "天贵　　天梁　　天浼  " + sep +
        "此星照命，为人有调度，有机谋，胸襟磊落，志气刚强，生来只缘磨难多，却得凶中有救星。" + sep +
        "贵人遇如不遇，亲眷亲之不亲，懒中忽然豁达，用事却有迂回。" + sep +
        "妻宜亲上成亲，却宜在外经营，不利在家作活，命中合带暗疾，雕青斩指，延寿和平，" + sep +
        "睹事发出话来，招人相怪，兄弟如无父母，过容百事。会裨补，能主张。若遇龙猪，方始通泰。" + sep +
        "述云：莫嗟时未至，暗过又还明。";

    jing[2][9] = "乙壬　　小畜卦　　雁过长江格  " + sep +
        "密云不雨空雷响，闪电流光震不威，雁叫空中飞去急，岁寒松柏绿依依。" + sep +
        "能将心胆分南北，解用刚刀断是非，满树花开存一果，更随掣电耀光辉。" + sep +
        "胆气合天心，狂风摆旧林，年来新事到，花树再鲜荣。  " +      sep + sep2 +
        "天暗　　天奔  " + sep +
        "此星照命，乃纲纪之星，权冲之宿。人命值之，有创业之谋，无享祖之福。" + sep +
        "刚柔相济，为人见识。作事自是气高性急，口直心慈。生经风浪早，独权独立，" + sep +
        "省力处翻成费力，安闲处不得安闲。见不平事要断，理直才去沾惹，反成不足。" + sep +
        "述云：春去秋来多少恨，才逢羊马得平安。";

    jing[2][10] = "乙癸　　渐卦　　松竹同荣格  " + sep +
        "平生艰阻多翻覆，费力劳心半松竹，雁行中路见分离，夫妻伤刑多反目。" + sep +
        "月移花影当心触，月到天中云雾簇，树上花枝两朵荣，百年未称今朝福。" + sep +
        "俊俏有规模，声名播道途，欲求天外事，须下死功夫。  " +      sep + sep2 +
        "天吉　　天祚　　天晚  " + sep +
        "此星照命，多遭诽谤。口直心慈，不受人欺。凡百之事，所为进退，钱财失散，好事难成。" + sep +
        "妻迟子晚，只宜头女头子难招，所为有头无尾。鸡鸣犬吠相逢，这须远大前程。" + sep +
        "晚年财禄自成，前程远大。述云：历过几多危险处，如今舟稳始无风。";

    jing[3][1] = "丙甲　　大有卦　　池内双莲格  " + sep +
        "赤脚堂前履玉墀，莲花出水不沾泥，天然定注安闲福，富贵奔驰事业迟。" + sep +
        "远雁分飞烟水阔，鸳鸯戏水各分离，君家若问平生事，向道登云自有梯。" + sep +
        "积善延君寿，行慈护子孙，喜逢猪合处，骑鹿上天门。  " +     sep + sep2 +
        "天恩　　天赦　　天柜  " + sep +
        "此星照命，出现众星朗然，君臣和合，风雪济会，奸佞不生。" + sep +
        "胸襟莹彻，赏罚必信。事业似燕营巢，独居自处，生来好静，主性不一。" + sep +
        "易盈亏，多反复，伤妻害子，好事难全。大门楼，好妆点，外观须好，里面槎牙，成中有破，喜处多忧。" + sep +
        "晚年财禄自成，前程远大。述云：从前难处多?- 历，牛马相逢事便奇。";

    jing[3][2] = "丙乙　　鼎卦　　鹤宿春林格  " + sep +
        "尘埃渐脱步云梯，花发庭前正及时，若得东君眦子力，太阳何处不光辉。" + sep +
        "有限自然成禄位，雁横秋水远相离，若问生涯何处足，明蟾一点照希夷。" + sep +
        "欲谋千里事，登明陟险难，伏心劳费力，善地觅安闲。  " +      sep + sep2 +
        "科名　　词馆　　凤阁  " + sep +
        "此星照命，如玉如珠。贵人皆仰，民族皆欢，能为钟鼎之器，可作栋梁之材。" + sep +
        "只缘退神重重，好事迂回，利名反复，劳而无功，秀而不实，机深虑远，事无十全。" + sep +
        "性刚强，不俯仰，不谦让，妻宜亲上成亲，长子难招，却要唤爷作伯。" + sep +
        "虽是口毒心平，与人不足赦人，无恩中两主驳杂，却称晚年。" + sep +
        "述云：桑榆晚景镃基别，目下生涯事未圆。";

    jing[3][3] = "丙丙　　离卦　　虎困松林格  " + sep +
        "生身本在垂杨下，恰正成阴志不闲，雁过碧波照影见，林中哮吼待归山。" + sep +
        "若问生涯随分过，命中险难隔函关，六亲险难应难守，飘蓬因得贵人看。" + sep +
        "冗冗心无用，区区未肯闲，假若心事好，命不与时争。  " +       sep + sep2 +
        "紫气　　天瑞　　天官  " + sep +
        "此星照命，乃爵禄之星，利禄之宿。自合名利两全，争奈运气未至。" + sep +
        "屈曲处，会忍耐；不俭约，会安排；懒俯仰，只是与人不足，兄弟不和，亲不是亲，非亲却亲。" + sep +
        "五迟五早之命：当家早、历事早、吃力早、辛苦早、破祖早；" + sep +
        "妻招迟、儿女迟、成身迟、享福迟、财禄迟。" + sep +
        "述云：若要风云相济会，除非添了水边人。";

    jing[3][4] = "丙丁　　晋卦　　燕夺莺巢格  " + sep +
        "平生注定马头荣，事业区区总未成，西畔有家东畔立，南边有辱北边荣。" + sep +
        "孤飞雁叫湘江水，燕夺莺巢两处鸣，借问此身何处是，云收月皎正当庭。" + sep +
        "运气合迍蹇，生涯日日新，问君前程事，要是虎头人。  " +       sep + sep2 +
        "天魁　　天驷　　天英  " + sep +
        "此星照命，生来近贵，须沾雨露之恩。命合遇天财，争奈五行驳杂，还了许多俗债。" + sep +
        "有事不会藏，有事不会耐。弄巧成拙，恩中生怨，撰钱来如风雨，去似飞沙。" + sep +
        "虽是名播四方，声扬阁里，比如干缬桃花，好看不结实。兄弟虎羊，件件自当心，自理会。" + sep +
        "命中若带暗疾，雕青破肉，可免伤妻害子。述云：一生心多事翻覆，猴鼠相逢事业成。";

    jing[3][5] = "丙戊　　旅卦　　雁逐鸾飞格  " + sep +
        "重山高耸拂云端，孤燕高飞逐凤鸾，久后资财应满屋，白头方得贵人看。" + sep +
        "生因志气如松竹，立志清高耐岁寒，借问西园花结果，一枝春色椅阑干。" + sep +
        "初荣中亦破，禄在晚年成，见猪登剑阁，遇鼠即身荣。  " +       sep + sep2 +
        "天休　　天禄　　天焕  " + sep +
        "此星照命，胸襟磊落，满面春风。见识察秋毫之末，谋事有冲天之志。" + sep +
        "虑远机深，胸襟澄澈，明明如烛。量长较短，知轻识重，善斟酌，会周折，意慈悲，不怒恨。" + sep +
        "监危涉险，自能主张。五行孤不尽，犹如草屋下挂珠帘、匣中藏宝剑。" + sep +
        "凶事如冰见日，好事未免迂回。松柏长青风霜久历，若带暗疾，可免刑伤。" + sep +
        "述云：功名未遇天家禄，试向鸡窗苦用功。";

    jing[3][6] = "丙己　　晋卦　　失侣孤鸿格  " + sep +
        "羽翼初生且待时，开笼展翅自高飞，谁期失侣分南北，嘹唳衡阳日易西。" + sep +
        "远雁过山群失队，白云深处杜鹃啼，争知意在尘埃外，因在尘埃涉是非。" + sep +
        "满院桃花带雨开，东风吹绽一枝梅，逢牛兔上枝枝发，一箭成功事事谐。  " +     sep + sep2 +
        "天妒　　三合　　天忧  " + sep +
        "此星照命，不喜俗事，有冠世之材。心地好，行忠孝，作事闲中不静，只好闹中取静。" + sep +
        "僧不僧，道不道，俗不俗，孤不孤。拿东篱补西障度日，身心不定。" + sep +
        "早年喜得屁荫下，中年不好，末主始成。若不破祖，定是异居。" + sep +
        "合带暗疾，可免伤克根基；应在水边成立，目下未达。" + sep +
        "述云：几多辛苦皆经历，自有桑榆寿晚年。";

    jing[3][7] = "丙庚　　睽卦　　天际孤鸿格  " + sep +
        "百尺竿头进步难，纷纷祖业有循环，云中雁阵飞程远，槛内奇花一点斑。" + sep +
        "若问前程荣显事，白云犹自恋孤山，平生志气应无失，只恐当年事不闲。" + sep +
        "生涯心未定，遇虎方荣盛，进退有两般，弟兄应不顺。  " +       sep + sep2 +
        "右史　　天营　　天柄  " + sep +
        "此星照命，性格不常，易喜易嗔。早年福禄，志略操持，心机迟要。" + sep +
        "省力早，越见心下不安。虽然一个好根基，过了许多磨难。" + sep +
        "虽北辰有拱星之拱常明，台辅之前，高而不危，满而不溢。" + sep +
        "会主张，历事早，成败知多少，忧煎过几番。若逢申已岁，必遇贵人钦。" + sep +
        "述云：运气未来君且守，晚年一个称心人。";

    jing[3][8] = "丙辛　　大有卦　　鹤立青松格  " + sep +
        "青松百尺岭头寒，白鹤飞来立晚滩，气直雪霜欺不得，石崖岩下立根盘。" + sep +
        "纷纷叶落春光语，百岁儿童一梦间，借问生涯何处发，才逢犬马始安然。" + sep +
        "长安路坦然，不用苦相煎，前程名与利，直过马牛边。  " +      sep + sep2 +
        "天台　　天退　　天懒  " + sep +
        "此星照命，有规模，有丰度，能驱驾，会撑拼。只因多破少成，秀而不实，豪气冲天，胆志拖地。" + sep +
        "不能俯仰人，会支吾，能处分，会妆点，善摆布。却因福薄恩深，多翻多覆，独权自立之命，" + sep +
        "只得根基固实，凶中有救，灾害难侵，晚年方有贵人举用。" + sep +
        "述云：遇尽许多危与险，直须且待晚年成。";

    jing[3][9] = "丙壬　　未济卦　　山顶鸾栖格  " + sep +
        "祖业纷纷晚可成，山深隐雪见猴星，孤飞雁南南来伴，渭水河边钓锦鳞。" + sep +
        "若问生涯多进退，劳心费力晚年荣，牛马运来应见禄，从前事业未堪凭。" + sep +
        "白玉黄金贵，清门早赴期，琼林花要发，牛角长新枝。  " +      sep + sep2 +
        "大常　　天府　　炎炎  " + sep +
        "此星照命，有火星，难独犯。多头多绪多疑惑，多孱愁，多是非。" + sep +
        "口直性紧，自是自直。勤烧香，懒念佛，多忧虑。志远机深，安闲中见生受，省力易，费力难。" + sep +
        "虽是能措置，会施为，却缘命中凡百蹭蹬，好事迂回。" + sep +
        "早年宜异姓隔胞，改更离祖，如乳燕营巢自立计方可，若守祖业诚恐难招。" + sep +
        "晚年自有贵人提携，无心中遇一项财禄。" + sep +
        "述云：头上安头心不足，巳亥才逢有贵人。";

    jing[3][10] = "丙癸　　旅卦　　雁唳云霄格  " + sep +
        "撼动高山力不加，根深连海接天涯，雁飞江外无消息，折散鸳鸯便不来。" + sep +
        "春风是处园林好，秋月扬明逐岁华，借问平生何处是，到头三结半枝花。" + sep +
        "遇马多应险，逢牛迤逦安，此时方得意，喜得贵人看。  " +       sep + sep2 +
        "天辅　　天破　　天鸾  " + sep +
        "此星照命，是穿山透石之星，经风涉浪之宿。人命犯之，施行雨露，掌握山河。" + sep +
        "容貌清寿，骨格胸襟磊落。所为进作操持，即缘性刚弄巧成拙，多招是非。撰钱来如风雨。" + sep +
        "述云：过了危难处，龙蛇始称心。";

    jing[4][1] = "丁甲　　复卦　　枯木逢春格  " + sep +
        "春来万物长新枝，枯木寒风灰火随，因向暗中逢巨烛，月残素色渐光辉。" + sep +
        "芦花雁过溪边白，柳絮莺声是处啼，桃花满园人不摘，霜林花放柳塘堤。" + sep +
        "鱼入大江中，山林虎啸风，命逢寅午位，箭发马蹄中。  " +      sep + sep2 +
        "天权　　天冲　　天秤  " + sep +
        "此星照命，美中不美，好事多磨，始荣终辱。" + sep +
        "先难后易之兆，好事迂回、钱财蹭蹬，恩中成怨、好事乖张。" + sep +
        "离祖辞亲，移南就北。多翻多覆之命，潇洒中不安闲，端正处要喎斜，心闲心未定，运至心安然。" + sep +
        "述云：堪恨年来无限事，马头逢着有恩人。";
    jing[4][2] = "丁乙　　升卦　　月透浮云格  " + sep +
        "平地升腾上碧霄，乌云散处有仙桥，每将心事重更变，禄食千钟福自招。" + sep +
        "天边雁叫空留影，南北家乡万里遥，坟前借问谁为主，风送孤帆出海潮。" + sep +
        "久缺看看满，经年镜再明，江南与江北，花落虎头人。  " +      sep + sep2 +
        "天库　　天仓　　天楼  " + sep +
        "此星照命，监官提携之宿。气宇朗然，机谋智略。作事好胜，财帛要多，心常不足。" + sep +
        "人虽钦仰，作事迂回。重担有肩，无人可替。高人见喜，小辈无缘。" + sep +
        "口直伤人，多招不足。怜贫敬老，难触心慈。" + sep +
        "中主渐强，末主最好，命中合遇金贵水贵等人。" + sep +
        "述云：从来事业成乌有，晚景生涯始可夸。";
    jing[4][3] = "丁丙　　明夷卦　　张弓待箭格  " + sep +
        "雁过前山影渐孤，家乡天际立江湖，张弓待箭逢牛虎，鸡兔相逢是事图。" + sep +
        "月下琼花三结子，日高红照隔天衢，借问安身何处好，不妨迅步到皇都。" + sep +
        "梨在田中未过牛，小童湖上泛轻舟，青钱再得逢朱紫，须信中年事不虚。  " +      sep + sep2 +
        "天阶　　天贵　　天策  " + sep +
        "此星照命，有见识，有操持，机谋胆量出众超群。" + sep +
        "心性刚直，志识远大，易嗔易喜，退神重临。危不危，遇险不险，成中有破，莫信小人。" + sep +
        "初年有福，中限便强，末限尤佳。" + sep +
        "述云：拟待张弓施一箭，百步穿杨也不难。";
    jing[4][4] = "丁丁　　坤卦　　耕锄获宝格  " + sep +
        "耕锄偶尔得金珠，牵牛遇虎雁相速，花残一果荣君寿，欲学相如却未如。" + sep +
        "夹道相牵仍隔水，鸳鸯孤只戏双鱼，终知事业青松下，留取生涯伴老躯。" + sep +
        "受禄须乘马，逢鸡路渐通，虎头寻兔尾，当遇主人翁。  " +      sep + sep2 +
        "天非　　天妒　　天舌  " + sep +
        "此星照命，平生气宇，草屋上兽头，羊质，虎皮，要妆点，要好看，要施为。" + sep +
        "能近上却缘运气未利，虚名虚利苗而不秀，秀而不实。知道理尊卑，思远大见识高明。" + sep +
        "凶中有吉，不犯官刑。要闲管，招是非，于人不足。末主钱财兴旺，不求自至。" + sep +
        "无心中遇个贵人，忽然中得段财禄，伤妻克子，破祖离宗之命。" + sep +
        "述云：此身成立处，须仗贵人扶。";
    jing[4][5] = "丁戊　　谦卦　　桃李同荣格  " + sep +
        "黄河天水相连济，自古从今不断流，月在碧霄云汉阔，雁飞天外两惊秋。" + sep +
        "每听猿声山涧远，利名福禄自然周，借问花残留几果，桃源雨打落花忧。  " +      sep + sep2 +
        "天车　　天轰　　天辇  " + sep +
        "此星照命，自成自立。心地坦然，不免劳心费力；未能成家，不得六亲兄弟之力。" + sep +
        "骨肉相悚忧愁多，巧中成拙失了还。束心平口直，发出话来招人相怪。" + sep +
        "颠扑处有救神，危难中立家计，凶险处做个门庭，比似一块生铁炼成一块真钢，" + sep +
        "还是成器费力尤多，须待晚景。" + sep +
        "述云：炼铁成钢为美器，财到荣身也不难。";
    jing[4][6] = "丁己　　坎卦　　乘槎渡海格  " + sep +
        "黄河湘水水相同，水港微渠路也通，松茂节高侵碧汉，争知蓬岛有仙翁。" + sep +
        "雁飞云外无踪迹，必是年深事业隆，夭桃花发枝枝秀，羊虎才逢喜气浓。" + sep +
        "羊马即亨通，贵客更相逢，箭随弦上发，钱财喜气中。  " +      sep + sep2 +
        "天轮　　天戈　　天锋  " + sep +
        "此星照命，陷害六亲。迁居改正，孤独自成。心闲身未闲，身闲心似火，意懒气如虹。" + sep +
        "当权早，历事早，百丈竿头，进步千重，浪底翻身多磨难，只得凶中有救，破尽还来，" + sep +
        "却在晚年，发禄如井泉水之造化，用之不竭，贮之不满，成中有破，破了还成，却在晚年。" + sep +
        "述云：要知向去生涯事，羊马群中事鼎新。";
    jing[4][7] = "丁庚　　颐卦　　画楼独倚格  " + sep +
        "高楼画阁终非久，独倚阑干望远天，一上小舟音信隔，芦花深处有风颠，" + sep +
        "邻家户口三千万，咫尺长安一水间，借问白头坟畔立，四隅相送海隅间。" + sep +
        "四海名声远，风帆驾远舟，逢寅亲马尾，明月照中秋。  " +       sep + sep2 +
        "天刑　　天耗　　天虚  " + sep +
        "此星照命，做事迂回，巧中成拙，是处还非。倾心吐胆于人，翻成不足。" + sep +
        "兄弟无分，独立自成。财似岭头云，聚散不一；福如秋夜月，明暗不常。" + sep +
        "家不欠缺，眉头不曾开；亲戚难靠，朋友少知心；子未得力担未息，肩鬓白如霜，犹负重担。" + sep +
        "目下虽安心未彻，枯木若逢春，蟠桃终是结。" + sep +
        "述云：寅马才逢泰，枯枝也遇春，是非还自戒，切莫听小人。";
    jing[4][8] = "丁辛　　泰卦　　月影浮云格  " + sep +
        "自古兴隆泰渐通，因逢除夜月朦胧，如今暗地逢明烛，随照流光却向空。" + sep +
        "寒塞雾烟莺燕少，雁飞沙塞也西东，知君意在青松下，堪笑桃花满树红。" + sep +
        "如禽添羽翼，侣虎奔深山，便风舟到岸，何用苦摇撑。  " +     sep + sep2 +
        "天井　　天台　　右班  " + sep +
        "此星照命，作事迂回，所为进退，历尽崎岖，舟行未稳。嘲风咏月，潇洒胸襟。" + sep +
        "吃不得亏，受不得思，出外高人见喜，在家小辈无缘，命中退神重重，" + sep +
        "奈缘事运皆未能成器，才到午酉件件称心，" + sep +
        "述云：目下小人相忌妒，自有高人举用时。";
    jing[4][9] = "丁壬　　师卦　　鼠守陈仓格  " + sep +
        "仓积陈粮食有余，半归食鼠半归厨，空中雁字飞相远，天赐聪明岂在书。" + sep +
        "有限足招云外庆，危中却有贵人扶，百年大限中庸好，心巧机灵压众愚。" + sep +
        "立志能刚勇，心聪见识明，六亲虽倚靠，举意合天真，子箭思牛斗，" + sep +
        "骑龙上碧云，逢蛇多称意，遇马得荣身。  " +    sep + sep2 +
        "天钥　　天缺　　天蜈  " + sep +
        "此星照命，机深胆略，志巧心灵，生来执道，不会悬容。" + sep +
        "有操持，会施为，能支撑，会伏众，却缘磨难早，六亲不得力，当心自挣扎。" + sep +
        "退神重重，相识无义，骨肉相悚，好处翻成不足，妻迟子晚，好事多磨。" + sep +
        "述云：好笑几翻天大事，危中却有贵人扶。";
    jing[4][10] = "丁癸　　谦卦　　云开见月格  " + sep +
        "君子垂钩坐钓台，乌云吹散碧天开，从今渐有升腾志，好把身心自忖裁。" + sep +
        "此时得运潇湘客，月影梅花明照雪，蛇猴相会济风云，荒圃凋枝杏花发。" + sep +
        "得意成家业，时至福峥嵘，蛇猴相会处，福禄自然通。  " +      sep + sep2 +
        "天厨　　天驰　　天料  " + sep +
        "此星照命，如孤鸿离塞，只鹤秉风，志在四方，宦游他处，不守祖居立业，" + sep +
        "只宜出外救神有。求财如泉，井满而不溢。三两次改换基址，四五翻成立家缘。" + sep +
        "在俗还孤，出家不净，磨难多，成败多，心在间地，身落火坑，尽是天驰星所注。" + sep +
        "述云：君今若问真消息，只好桑榆度晚年。";

    jing[5][1] = "戊甲　　颐卦　　仙鹤腾云格  " + sep +
        "大化无非小化成，身齐松柏复坚青，安居待命须时发，养性消遥自称情。" + sep +
        "天远雁飞三四只，水边云际望俱平，君还若问前程事，百岁花如半日荣。" + sep +
        "遇犬逢辛禄，逢牛箭自来，兔龙应奋发，羊马上高台。  " +       sep + sep2 +
        "天船　　天昌　　天南  " + sep +
        "此星照命，心性刚直，所作详明，其性坦然，并无私曲，三寸刚舌，一片佛心，" + sep +
        "却只于人不足，恩中生怨。交游无终始，件件自当心，般般自费力。移桃结李，几度家成又败。" + sep +
        "末主方兴五行之所注。" + sep +
        "述云：从前磨难皆劳力，今日方知举步高。  ";
    jing[5][2] = "戊乙　　蛊卦　　鹤立青松格  " + sep +
        "鹤立青松栖不成，无言终日谩劳神，刚柔自定成身计，金满斯箱酒满瓶。" + sep +
        "雁叫碧天空接水，桃花雨后始鲜明，堪受利名频得失，争似山居静掩门。" + sep +
        "得遇阴人发，乘猪喜渐通，龙蛇当有庆，羊马开颜红。  " +       sep + sep2 +
        "天绮　　天并　　天毂  " + sep +
        "此星照命，凶处成吉，忧处有喜。件件自劳心，般般重费力，朋友淡薄，亲戚相疏，" + sep +
        "伶俐自然，风流天赋。于人不足，翻成是非。只得救神在命，" + sep +
        "三五处失脚吃颠处，人扶妻宫有破、祖业消磨。" + sep +
        "命带暗疾，可免刑伤亦能延寿。宜戒五荤三厌。" + sep +
        "述云：平生历遍难危处，如上青山得片云。";

    jing[5][3] = "戊丙　　贲卦　　鸿雁失群格  " + sep +
        "如今家富未为富，他日身贫未是贫，根脚浅来心地广，荣身好事未能成。" + sep +
        "雁飞天外空寻侣，里外三千烟水云，借问芳菲成几朵，满园留得一枝春。" + sep +
        "身计未能安，区区雁阵寒，利名须见马，方得贵人看。  " +       sep + sep2 +
        "天牛　　天雍　　天空  " + sep +
        "此星照命，如芝兰秀于山谷，松柏茂于岩崖，出处幽微，根苗固实。" + sep +
        "虽然祖父根基，独自能与保守，六亲无分，弟兄相疏，好个创业规模，却欠安闲之福。" + sep +
        "如甜瓜，命香从辛苦里来。" + sep +
        "述云：己午年中成事业，桑榆晚景乐余年。";

    jing[5][4] = "戊丁　　剥卦　　夜雨翻桃花格  " + sep +
        "桃花夜雨春残落，柳绿莺声绕树枝，寄我一身须远祖，芦花深处雁南飞。" + sep +
        "真文必遂金门椽，晚赴舟墀莫叹迟，家住五湖明月夜，儿童相送步云梯。" + sep +
        "寒雁江天晚，昏铜再琢磨，箭从寅午发，牛鼠亦颜和。  " +      sep + sep2 +
        "右辅　　天蓬　　积宝  " + sep +
        "此星照命，气宇精神，胸襟洒落，成几处事，立几处家风。" + sep +
        "滚滚平生，区区名利，披星戴月，惹事招非。高人见喜，小辈相欺，近处无缘，远传令德，" + sep +
        "只喜不犯官刑，仍主晚年秀气。" + sep +
        "述云：从前历遍崎岖道，若要心闲待晚年。";

    jing[5][5] = "戊戊　　艮卦　　独妇倚门格  " + sep +
        "岩前风雨正依依，独倚柴门半掩扉，贞洁沉吟凝泪眼，儿夫别后未回归。" + sep +
        "天边雁阵空违侣，槛内无花借一枝，莫恨晚年成败事，休论昔日是和非。" + sep +
        "休夸得意深，莫怨彼无情，欲进独难进，别有好知音。  " +       sep + sep2 +
        "天央　　天说　　天文  " + sep +
        "此星照命，外好看，内槎槎牙牙。叶茂花繁，秀而不实。密云不雨，忧中有喜，" + sep +
        "险处有救神。有于人意，无酷毒心，头绪多少记着，成而又破破了又成，妻宫有克，子宜见迟。" + sep +
        "述云：君知欲问前程事，只好空心待丑蛇。";

    jing[5][6] = "戊己　　剥卦　　击破连环格  " + sep +
        "连环击破愁萦腹，松桧盘槎鹤必栖，雁过远山飞断目，鸳鸯雨打各分离。" + sep +
        "平生志气应难敌，争奈从来未遇时，借问晚年何处是，桃花林下好围棋。  " +    sep + sep2 +
        "天愁　　天皮　　锁眉  " + sep +
        "此星照命，口能舌辨，出语不常。作事多疑，为人奸狡。" + sep +
        "生来有四迟四早：辛勤早、历仕早、卓立早、事业早；妻妾迟、子息迟、享福迟、安闲迟。" + sep +
        "若是离祖隔胞，庶出异姓，最得地。不然则女迟子晚，遍历风霜，撰钱来如风雨，去若飞沙。" + sep +
        "正是，花巧得花巧破财是，更残漏尽灯。" + sep +
        "述云：从前是处却未是，只得桑榆可赡身。";

    jing[5][7] = "戊庚　　损卦　　岩前古桧格  " + sep +
        "立志先须用琢磨，荒凉陆地起风波，孤飞雁度云霄远，乳燕飞来垒旧窠，" + sep +
        "花发园林存一果，从来事业也蹉跎，君还问我平生事，喜得连绵寿数多。" + sep +
        "独坐围棋为乐情，水东轩宇水西亭，如今箭在行人手，牛角乘龙上玉京。  " +      sep + sep2 +
        "天郝　　天忧　　天商  " + sep +
        "此星照命，枯木未春，旱苗未雨，为人热心肠。赌事理直口直，发出话招人相怪。" + sep +
        "是亲不亲，非亲却亲；外人如手足，兄弟不和睦。身在江东，心有江北。凶中有救，" + sep +
        "不犯官刑。生来只被天忧星所恼，欢喜未来愁先到，钱财聚处又成空。初中限驳杂，末主方佳。" + sep +
        "述云：梅花还谢了，结实在枝头。";

    jing[5][8] = "戊辛　　大畜卦　　负薪登险格  " + sep +
        "负薪涉险过长林，半路行来却遇金，休道资财前分定，也须回首谢知音。" + sep +
        "空中雁叫双双远，喜得年高却称心，为向桃花留几果，树头独有一枝春。" + sep +
        "莫怨荣身晚，枯木再逢春，见猪方得地，月到五更明。  " +       sep + sep2 +
        "天懒　　天晦　　天暗  " + sep +
        "此星照命，心明志巧，智广机深，从容出众，作事退悔，多学少成。" + sep +
        "早年不能奋迅，中年始可立成，天懒慵惰，天暗不明，移南就北。革故鼎新。" + sep +
        "是瓜皮搭柳树，兄弟恩犹如羊虎，商量一件事，管取闹一场。" + sep +
        "述云：生来磨难处，晚得贵人成。";

    jing[5][9] = "戊壬　　央卦　　芳草芝兰格  " + sep +
        "黄金非我终身宝，毕竟芝兰异芳草，家住潇湘东又西，身向山南山北老。" + sep +
        "枝头春色枝枝早，傍人称意知音少，百岁荣华不必忧，福禄双全还自好。" + sep +
        "暑往更寒来，终是有资财，马龙施一箭，莫与外人猜。  " +      sep + sep2 +
        "天禄　　天轰　　天福  " + sep +
        "此星照命，为人正直，谨言语，有救人之心，无伤之意。高人见喜，小辈无情。" + sep +
        "同居合家做活，凡事弄巧成拙。退神重重不克，有两座禄星在命，衣禄自然。" + sep +
        "述云：从来事业皆未定，必竟收因在晚年。";

    jing[5][10] = "戊癸　　艮卦　　沙里藏金格  " + sep +
        "生涯不可谩咨嗟，石在玄精金在沙，去石真洼方显得，淘沙金块各无瑕。" + sep +
        "雁离衡阳无伴侣，鸳鸯戏沼隐莲花，须知禄向龙头得，财宝逢牛自有涯。" + sep +
        "未遂平生志，猪寻子上雄，春残花未落，一朵伴春风。  " +       sep + sep2 +
        "天机　　天柱　　天败  " + sep +
        "此星照命，为人机巧，有操持，审法度，知高下，别贤愚。小人无缘，" + sep +
        "高人见喜。依本分，利名头，风霜早，磨难早，几度吃颠仆，皆是天败星在命。" + sep +
        "只得天柱星在命，且得凶中不凶，妻宫不得力，儿女主迟。" + sep +
        "述云：牛龙须遇贵，枯木再逢春。";

    jing[6][1] = "己甲　　复卦　　池长碧莲格  " + sep +
        "平生未遇衣和禄，藕在青泥长碧莲，鱼戏池中还自乐，雁飞远汉度长川。" + sep +
        "尽道功名难入手，却缘事业晚因缘，借问桃源消息好，牛羊归去好耕田。" + sep +
        "凿井通泉水，枯木长新枝，君应施一箭，且待马牛时。  " +       sep + sep2 +
        "天隆　　天晚　　天禄  " + sep +
        "此星照命，乃广行之星，为人梗直，作事忠良，心灵志巧，见识远谋，" + sep +
        "妻宫有破，子息难招。只宜出外求财，在家不利。六亲冰炭，骨肉无情，" + sep +
        "有贵人遇如不遇，有衣禄秀而不实。外观有余，内看不足。结识相知，临难不救。" + sep +
        "攀陪亲眷，冷淡相看。这五行独权自立，秋花晚秀之命。" + sep +
        "述云：时运到时成大器，休怨苍天且待时。";

    jing[6][2] = "己乙　　升卦　　云散月明格  " + sep +
        "百计千方作养生，风吹云散月重明，空中雁影飞三只，祖代耕盘在一耕。" + sep +
        "远树落花三四朵，秋风结子一枝荣，心怀志气无人敌，莫把聪明与命争。" + sep +
        "遇乙亲同位，逢寅运渐通，箭先随鼠发，虎跳出朦胧。  " +       sep + sep2 +
        "天进　　天蛊　　天禄  " + sep +
        "此星照命，为人性刚，有胆略，有操持，亲枝不得力，有事自当心，做事十步九计，" + sep +
        "恩爱处落得辛勤。恩中成怨，好事多磨，不欺贫，不妒富。退神重重，不发达者，" + sep +
        "尽被天蛊星所恼，将来还遇一贵人举用。" + sep +
        "述云：施恩成怨处，却有贵人扶。";

    jing[6][3] = "己丙　　明夷卦　　秋晚芙蓉格  " + sep +
        "富贵豪奢意未专，年来年去几多般，须知雁过关山远，花发清秋色亦鲜。" + sep +
        "立业成功还已定，成身无咎亦天然，终知得遇同乡友，乘马凌云上碧天。" + sep +
        "平生未遇亨，举步上青云，兔头兼虎尾，有路坦然平。  " +       sep + sep2 +
        "天破　　天灾　　天荣  " + sep +
        "此星照命，磨难风霜。亲不可托，友人可交，劳心只力独支撑，" + sep +
        "会施为，能措置，好事多磨，巧中成拙，险处却不险，安闲又不闲，" + sep +
        "正是一个不静办五行，却不忘恩亦不狂图也。会守己，好事蹭蹬，成了又破，破了又成。" + sep +
        "中初两限不聚财，末限方得地。" + sep +
        "述云：新月休言缺，团圆也有时。";

    jing[6][4] = "己丁　　坤卦　　接木逢春格  " + sep +
        "日透高峰雪未消，难将桂木接新条，荣身本是天然定，成败皆因命里招。" + sep +
        "水际鸳鸯和暖夜，天边鸿雁不丹霄，花开正遇阳和节，又恐狂风一旦飘。" + sep +
        "命逢猪渐发，遇丙却坚牢，平生多蹇滞，方始出尘劳。  " +       sep + sep2 +
        "天轰　　天明　　天说  " + sep +
        "此星照命，有机谋，有胆略，有权柄，有操持。自权自立之命，有造化能全，" + sep +
        "只因刑杀重，立性重，为人性懒心焦、多奸多疑。会妆点，会施为，能驱驾，" + sep +
        "会撑持，口直伤人，恩中生怨，伤妻损子，事不十全。初中财不聚，末主方成。" + sep +
        "述云：钓鳌不得休空叹，自有生涯在晚年。";

    jing[6][5] = "己戊　　谦卦　　雁戏长溪格  " + sep +
        "百岁生涯渐得成，险中重换一翻新，西园春色浓如锦，好向朱门问主人。" + sep +
        "鸿雁过溪妨羽翼，桃花值雨亦伤情，平生事业休惆怅，羊马相逢却是荣，" + sep +
        "鸡报更残晚，牛逢鼠渐奇，龙蛇消息好，羊马始成时。  " +       sep + sep2 +
        "天骞　　天将　　天福  " + sep +
        "此星照命，初年颠磕，多忧多虑，劳心费力，不能遂心。蹇滞奔波，骨肉冰炭，" + sep +
        "千方百计，有始无终。兄弟难靠，相识无情，独立自成之命。远处人见喜，近处并无缘，" + sep +
        "作事劳而无功，名利秀而不实。若要称心，直过五九。" + sep +
        "述云：名利还自得，羊马遇时荣。";

    jing[6][6] = "己己　　坤卦　　凿石见玉格  " + sep +
        "凿石尽时逢宝玉，庭树槛外夹修竹，雁飞天外唳声高，鸥鹭沙汀跷一足。" + sep +
        "园林处处接桃花，惟我庭前长秋菊，百年枝上果何如，半子半孙相半宿。  " +       sep + sep2 +
        "天退　　天晦　　天丧  " + sep +
        "此星照命，机办多疑，多思远虑，性直心高。见识有心机，口毒心慈，" + sep +
        "聪明中做出鲁莽事，机巧处弄出是非来，胸襟磊落，性格巍巍。财利尽被天晦星所退，" + sep +
        "犹如莲叶上水珠，空中得来空里去，散时容易聚时难。只得退神重重，逢凶不凶，" + sep +
        "遇险不险。镃基有气，目下未成，直待末限。" + sep +
        "述云：几番得失教经历，晚景将来必称心。";

    jing[6][7] = "己庚　　临卦　　雨打鸳鸯格  " + sep +
        "日出阴云光自灿，安然千载喜相期，岁寒但爱存踪迹，莫怨生来未遇时。" + sep +
        "天外有鸿声叫远，鸳鸯经雨各分飞。桃花阆苑春残处，零落园中一两枝。" + sep +
        "聚散多今古，荣枯几代前，追思来往事，且乐太平年。  " +       sep + sep2 +
        "天嚣　　天爵　　天章  " + sep +
        "此星照命，孤高品格，秋月精神。六亲不得力，兄弟不比和。口直心慈，闲管处惹是非，" + sep +
        "于人不足，巧中成拙，好事多磨，无心中做就家，趁哄处立成计。先难后易，始辱终荣，" + sep +
        "中主渐好，末主尤佳。" + sep +
        "述云：还知世事多颠倒，才到凶年却不危。";

    jing[6][8] = "己辛　　既济卦　　石上栽松格  " + sep +
        "苦节凌霜志恁坚，贤人未决待天然，有志终须成大器，休嗟虚度舜尧年。" + sep +
        "鸿雁沙汀三四只，鸳鸯独立在江边，谁知树上残秋果，李白桃红寄在前。" + sep +
        "鹿过重山喜，逢牛始遂心，虎头春色美，龙尾立家荣。  " +        sep + sep2 +
        "天库　　天伤　　蛊毒  " + sep +
        "此星照命，竿头上立身，进退未得；海滩上起屋，立柱不牢。磨难风霜，" + sep +
        "利名未就，空存学识，未免忧心。亲情难靠，兄弟无缘，自成自立，造化难凭。" + sep +
        "真心待人，未免不足，无心栽柳，却又成荫。端止处要喎斜，成就处有破绽，君子相钦，小人怀恨。" + sep +
        "述云：从来险难牛羊见，待得鸡猴立大功。";

    jing[6][9] = "己壬　　师卦　　鸳戏莲池格  " + sep +
        "戏水鸳鸯满沼莲，朱衣放箭遇阶前，黄金未与君收掌，白玉堂前看古贤。" + sep +
        "远雁孤飞天外影，鸳鸯两两傍沙眠，君今肯问平生事，松柏同荣寿万年。" + sep +
        "遇鼠明消息，逢牛喜渐荣，树头空问禄，花向水中寻。  " +        sep + sep2 +
        "天枢　　天川　　农蛊  " + sep +
        "此星照命，多思远虑，易信易瞒。家业见成，田畴不缺。知进退，识高低，" + sep +
        "作事沉吟，所为进退大宽小急，喜怒不常，于人不足，惹是招非。恩爱生烦恼，" + sep +
        "好事思参差。凶中有救，退神重重。" + sep +
        "述云：从前多驳杂，中末始平和。";

    jing[6][10] = "己癸　　谦卦　　花秀秋深格  " + sep +
        "禄重须防印与权，财成人恐事连绵，三春鸿雁飞南北，花落秋深叶亦鲜。" + sep +
        "晚景利名终得遂，平生无恨亦安然，家乡本在潇湘外，重遇关山好向前。" + sep +
        "守道终成福，须知省祸危，云离天上过，迤逦见光辉。  " +       sep + sep2 +
        "天丙　　猥疾　　龙虎  " + sep +
        "此命造化，见识高明，机谋智慧。是处成非，非中又是，多思多虑，未能遂心。" + sep +
        "贵人见喜，小辈无缘。口直心慈，运人牛羊，自然通泰。" + sep +
        "述云：傍人尽道成身早，必竟生涯在晚年。";

    jing[7][1] = "庚甲　　随卦　　渭水垂钓格  " + sep +
        "疏屋荒凉燕久居，过桥相遇一封书，持竿上钓鱼相失，反致休来却有鱼。" + sep +
        "玉树有花难可折，金樱花落果应疏，须知雁过斜阳远，云散庭前树几株。" + sep +
        "携弓亲射鹿，逐鹿自归林，得遇黄牛首，羊马遂人心。  " +        sep + sep2 +
        "贯索　　天绞　　天刑  " + sep +
        "此星照命，志气高，心机大，立性质朴，所为聪明。亲眷无情，朋友无义，" + sep +
        "作事不凑逗，举用未能成。退神太重，多学少成，若交牛马之乡，别是一家风景。" + sep +
        "述云：牛马运中方得地，须信荣身在晚年。";

    jing[7][2] = "庚乙　　大过卦　　莺语东风格  " + sep +
        "疏却亲情亲却疏，离南往北自安隅，知君本是吾乡友，权寄飘飘柳上居。" + sep +
        "双雁过溪忘羽翼，鸳鸯独戏绕青蒲，黄莺枝上双双语，为报窠中一个雏。" + sep +
        "桥边逢水客，屋内未亲知，南北东西去，窠中只一儿。  " +        sep + sep2 +
        "天藻　　天烦　　天懈  " + sep +
        "此星照命，为人气高，不能俯仰。好一介造物如锦袋，贮糠草屋安稳。" + sep +
        "外观有余，内观不足，劳而无功，秀而不实，密云不雨，空里雷声，钱财聚散，" + sep +
        "好事迂回，六亲冰炭，朋友相疏，妻迟子晚，未得安居。" + sep +
        "述云：晚年必是成身处，济会风云事未虚。";

    jing[7][3] = "庚丙　　革卦　　革故鼎新格  " + sep +
        "弃故从新待命通，利名还见两三重，雁飞队队迷踪迹，花落溪边间绿红。" + sep +
        "禄立应随天信志，始觉心闲事事通，借问君子何年顺，龙头一见自身荣。" + sep +
        "犬上花开色，龙头奋旧身，一心随命举，破屋再重荣。  " +        sep + sep2 +
        "天饶　　天车　　太乙  " + sep +
        "此星照命，亲高近贵，性直心慈。亦无克剥，亦不苟求。五行坚实，四柱平和。" + sep +
        "性如碧潭秋月，情如野鹤栖松，六亲如画饼，骨肉似虚花。凶中有救，喜处还嗔，" + sep +
        "命带暗疾，有破相方可以延年。" + sep +
        "述云：多成多破多翻覆，龙犬才交显后身。";

    jing[7][4] = "庚丁　　萃卦　　月照幽轩格  " + sep +
        "月华清洁莹如银，世外安身欲染尘，愁虑未消终有待，逍遥偏称等闲人。" + sep +
        "空中飞雁江边立，日透红霞渐出云，身在五湖归不得，花残果结一枝春。" + sep +
        "心在繁难外，身居众绪边，马头春色好，云静月当天。  " +       sep + sep2 +
        "飞轮　　天蓬　　天仓  " + sep +
        "此星照命，性巧心灵。将无作有，弄假成真。亲如雪中月，财如水上萍，" + sep +
        "好事多磨，利名进退。凶中有救，不犯官刑。先来破祖，自立自成。此命是也。" + sep +
        "述云：扫雪观山山色异，春来还有百花红。";

    jing[7][5] = "庚戊　　咸卦　　凤宿梧桐格  " + sep +
        "身心进退多翻覆，且度年华守旧心，若问瑶池东畔立，等闲栖向绿杨荫。" + sep +
        "远雁坚飞三四只，寒风一点透波深，终身若问归何处，千里黄沙半捻金。" + sep +
        "得路逢牛首，骑虎渡危桥，平生心胆广，福禄命中招。  " +        sep + sep2 +
        "天参　　天孤　　天鸾  " + sep +
        "此星照命，如孤鸾出塞，似野鹤乘风，志在他乡，心思他处，成身异地，" + sep +
        "立业他乡，东畔栽花西畔发，北国种树南国荫。父母堂前过客，弟兄空里雁行。" + sep +
        "镃基虽不中，末注渐渐佳。" + sep +
        "述云：从前事业多成败，直待虎牛身渐成。";

    jing[7][6] = "庚已　　萃卦　　孤雁传书格  " + sep +
        "银花满地衬金车，踏雪归来向五湖，借问长安消息好，唯知孤雁一封书。" + sep +
        "鸳鸯懒向池中宿，零落花枝独一株，犹恨根基还恁薄，贵人引入好山居。" + sep +
        "井内霞光射斗牛，平生衣禄未能周，施弓箭向猪头发，必在功成在此秋。  " +        sep + sep2 +
        "天鉴　　天秤　　天度  " + sep +
        "此星照命，秉性玲珑，胸襟磊落。磨难早，翻覆多，亲情有似溪边雪，儿女还如镜里花。" + sep +
        "疑思重，成败多，经历早，作事蹉跎。" + sep +
        "述云：名利未成君且待，犬猪才到事皆和。";

    jing[7][7] = "庚庚　　兑卦　　春花秋叶格  " + sep +
        "大泽乘舟泛五湖，区区逐浪不通吴，春花苑圃终难久，才到秋来叶渐疏。" + sep +
        "水涸山遥飞雁远，天高云杳事难图，知君志在清闲地，好向林泉读佛书。  " +        sep + sep2 +
        "天秋　　天都　　毛头  " + sep +
        "此星照命，如芝兰出深谷，似松柏茂幽岩，父母镃基难守，兄弟事业如无。" + sep +
        "独身自立，难靠难凭。亲义秋风叶，人情鉴里花，成败多端，利名进退。" + sep +
        "命中八字，却得时辰得也终；禄在晚年，此命好为僧道。" + sep +
        "述云：虽然通草做屏风，异日峥嵘骨不同。";

    jing[7][8] = "庚辛　　央卦　　鳌隐沧浪格  " + sep +
        "日到天心影渐高，庚辛金印自风骚，巨舟泛浪多翻覆，浅水回波隐巨鳌，" + sep +
        "远雁过溪三四只，柳枝一朵伴红桃，平生志气无人识，晚景金门过贵豪。" + sep +
        "身心辛勤事未成，碧天云暗几翻明，逢鸡渐有人抬举，跨马骑牛禄渐平。  " +        sep + sep2 +
        "天英　　天驰　　天破  " + sep +
        "此星照命，心行正直，赋性平和。能睹是非，无私曲，不藏机，出语毒，易嗔易喜，" + sep +
        "能荣能辱，如虎之口，佛之心。于人不足亲，如千叶桃花；交友如风里秉烛。" + sep +
        "述云：妻迟子晚君休叹，五九安闲福始来。";

    jing[7][9] = "庚壬　　困卦　　雨打荷花格  " + sep +
        "荷花雨打鸳鸯散，芦苇风翻雁阵斜，家住五湖思信至，白头尘境自生涯。" + sep +
        "园林花发存三果，百岁坟前半是他，借问始生须苦节，到头三纪入烟霞。" + sep +
        "遇犬多惊险，逢牛路渐通，前程还有路，龙马必亨荣。  " +        sep + sep2 +
        "天骑　　天马　　文昌  " + sep +
        "此星照命，凶中变吉，好事多磨。见识别，智略多，自能自会不俯仰，性快口直多鲁莽。" + sep +
        "会担当，能支撑，会裨补。夫妻和睦，兄弟镜中花。有贵如不遇，衣禄聚散多。" + sep +
        "述云：龙马才逢遇，衣禄自亨通。";

    jing[7][10] = "庚癸　　咸卦　　莺宿野林格  " + sep +
        "斛里黄金不用量，谁知升斗自相妨，孤飞雁过芦花白，百岁优游玩水旁。" + sep +
        "莺宿乔林飞散毕，春花枝上有金芳，君家若出中年外，好逐笙歌入画堂。" + sep +
        "笔砚随身学不成，不思名誉与公卿，江边幸有鲈鱼美，错认长江作帝京。  " +        sep + sep2 +
        "天将　　天气　　孤恼  " + sep +
        "此星照命，孤重、性重，退神重重。心高性直，不靠祖财。拳头上做成个基业，" + sep +
        "竿头上撰出家缘，千层浪里安身，不妨百尺竿头立命。不怕虎穴中敢去取子，" + sep +
        "巨浪里也去钓鳌，只得四柱坚牢，所以不能消烁。" + sep +
        "述云：根基先驳杂，晚景福优游。";

    jing[8][1] = "辛甲　　无妄卦　　云罩长椿格  " + sep +
        "重云密雾遍天涯，祈雨祈风隔岁华，秋水雁横三四只，岁寒孤立伴寒沙。" + sep +
        "春晴去处园林绿，冬寒凝霜自不加，借问生涯何处是，骑牛归去老农家。  " +        sep + sep2 +
        "天班　　天琼　　天囚  " + sep +
        "此星照命，隐士之星，有道之宿。人命临之，清若秋霄夜月，春沼虚花。不实之兆，" + sep +
        "名利奔驰，生涯蹭蹬。性直出口伤人多招不足，亲情有如江上雪，兄弟恰似镜中花。" + sep +
        "若要身荣，除非牛虎相逢之年。" + sep +
        "述云：长江波浪急，也有坦平时。";

    jing[8][2] = "辛乙　　逅卦　　戏水鸳鸯格  " + sep +
        "志气孤高且待时，烟鸿雾雁各分飞，园林花发依依绿，春色须还长嫩枝。" + sep +
        "山远路遥知马力，鸳鸯戏水不相依，前程幸有知音者，独听残莺晚树啼。" + sep +
        "遇鼠身逢厄，逢寅遇贵推，龙蛇波浪急，牛马定光辉。  " +        sep + sep2 +
        "天佑 　　天非　　天破  " + sep +
        "此星照命，无祖业之分，无亲友股肱之力，一双手做成家计，独自立个生涯。" + sep +
        "人情淡薄，骨肉相疏。十分恩爱，好处成非，虽是疑奸，奈何费力。大事不怕，" + sep +
        "小事不欺，过思远虑，千方百计。过了多少艰难，经了几翻闪撞，皆是天破星所注。" + sep +
        "述云：几番浪里风波急，还知也有坦平时。";

    jing[8][3] = "辛丙　　同人卦　　日被云翳格  " + sep +
        "日尽难分影渐斜，成身消息未待时，春归雁叫无踪迹，秋月空梁燕亦归。" + sep +
        "祖道只因身反破。恩深争奈见分离，春色树浸缘何事，实结枝头一果奇。" + sep +
        "知道身荣贵，成身却异同，龙牛外虎穴，相会便亨通。  " +        sep + sep2 +
        "天权　　天聪　　天害  " + sep +
        "此星照命，经风涉浪之星，穿山透石之宿。" + sep +
        "人命照之，有三早，有三迟：当家早、忧愁早，劳心早；子息迟、心闲迟、享福迟。直待末主成家计。" + sep +
        "述云：五九才交还得地，桑榆晚景得安闲。";

    jing[8][4] = "辛丁　　观卦　　雁过高峰格  " + sep +
        "雁过高峰不及飞，岁寒江上理毛衣，犬头消息应测别，鹿在猪牛奋猛威。" + sep +
        "中路阴人来举用，绿波深处定虚亏，平生蹇难得后晚，才过蛇羊透玉墀。" + sep +
        "大树盘根实，年深枝叶残，岁岁江上日，独自照青山。  " +        sep + sep2 +
        "星　　名　　缺  " + sep +
        "此星照命，如风之象，有名无形。作事七颠八倒，弄巧成拙。亲如不亲，恩中生怨。" + sep +
        "撰钱来如风雨，去若飞沙，虽是镃基巩固，预寻不定之忧。妻迟子晚，凡事劳心。" + sep +
        "妻宜命硬年高，方合婚缘；命弱年小，定有相妨，休言发达应迟，末主自有福利来也。" + sep +
        "述云：猴兔才相会，事业便光辉。";

    jing[8][5] = "辛戊　　遁卦　　云雾过山格  " + sep +
        "平生立志重重险，独拽弯弓力渐施，云路过山多险阻，时来平地上天梯。" + sep +
        "雁飞天外声声远，雨后桃花片片飞，借问百年成应事，长?- 春色绿依依。  " +        sep + sep2 +
        "天印　　龙马　　北辰  " + sep +
        "此星照命，有操持，有智慧，见喜不喜，财帛不缺，先破后成，会撑绊，会分理，有刚断。" + sep +
        "却缘退神重重，多学少成，有头无尾，名扬内外，誉蔼乡闾，目下未成，四九之后方可荣身。" + sep +
        "述云：根深不怕风摇动，五九年来见倍明。";

    jing[8][6] = "辛己　　否卦　　琢玉园珠格  " + sep +
        "箭飞星斗起寒光，月照长天感上苍，宫羽己开天赐福，目前云幕自高强。" + sep +
        "黄牛满屋非干职，琢玉须圆取出方，雁过碧天沙塞远，儿童归去一双双。" + sep +
        "雨润龙生角，山深虎奋威，但交猴鼠上，渐渐见光辉。  " +        sep + sep2 +
        "天贵　　天轰　　血妒  " + sep +
        "此星照命，将相扶君之兆，文武待卫之星。爵禄自然，凶恶不侵。" + sep +
        "明窗净几，受业琢磨，有记性心，有操持志。只因心不足，未免多学少成。" + sep +
        "退神在命，凶中有救，险处人扶。五九才交成立，命享安闲之福。" + sep +
        "述云：利名未遂心多慕，际会风云自有期。";

    jing[8][7] = "辛庚　　履卦　　龙蛇波浪格  " + sep +
        "水畔张弓射鹿鱼，龙藏深窟自安居，鸿飞天上声声远，蛟在池中戏月珠。" + sep +
        "祖业漫将心不足，鸳鸯相背意情陈，知君自有逍遥路，摘取蟾宫第一枝。" + sep +
        "鹿在高原望，张射斗牛弓，平生何事足，晚景自从容。  " +        sep + sep2 +
        "天刑　　天孤　　鸾鹤  " + sep +
        "此星照命，一生劳心费力，般般自向前，件件自理会。别人做过事，须是自要做，" + sep +
        "不信别人，自是自直。作事持重，言不妄发。安须少，烦恼多，闲中寻静，静处不安闲。" + sep +
        "命招性拗，妻须命硬。凶中有救，遇险无危。" + sep +
        "述云：一生劳心非灿烂，遥空辉晃照天宫。";

    jing[8][8] = "辛辛　　乾卦　　石上芝兰格  " + sep +
        "顽金锻冶方成器，石上芝兰根脚异，远塞孤鸿飞不归，群群飞上丹霄际。" + sep +
        "春来花发满园林，未秀多应时未至，百年枝上半青红，白头应作蓬莱裔。" + sep +
        "遇鼠天应禄，逢丁必惹灾，鼠牛羊内发，一举上高台。  " +        sep + sep2 +
        "天荫　　天囚　　科秘  " + sep +
        "此星照命，不受祖业之物，全凭天地之滋生。如日升东，渐丽北海；笋迸新芽，不久成竹；" + sep +
        "鱼游深水，变化非难。好个根基，只缘退神重重，胸襟磊落，作事迂回。" + sep +
        "述云：桃李花飘处，枝头缀果多。";

    jing[8][9] = "辛壬　　讼卦　　云霄月朗格  " + sep +
        "骨格轻盈如婀枝，清风满径任教吹，良霄月朗天光碧，在路行人未得归。" + sep +
        "借问岭头花发未，嚣嚣莺语喜还悲，平生进退多危险，晚景匆匆福自宜。" + sep +
        "门户庆来时，麻衣换绿衣，马头人着力，应事见光辉。  " +        sep + sep2 +
        "天愕　　天锐　　天驻  " + sep +
        "此星照命，乃恶劣之星，人命值之，君子多福，常人带疾，添财减土，成败不常。" + sep +
        "先忧后喜，破了还成，心性不常。大宽小急，性忒直，心忒焦，妻硬相宜，子迟到老。" + sep +
        "九五之后方得立成人家。" + sep +
        "述云：甜苦重重暗历过，方知晚景禄优游。";

    jing[8][10] = "辛癸　　遁卦　　宝剑重磨格  " + sep +
        "吹毛宝剑金刚样，尘土经年暗未明，合遇贵人重拂拭，雪霜洁利自然新。" + sep +
        "江边三雁飞沙远，树上花枝果亦成，幸有阴人相接引，春雷才动马嘶声。" + sep +
        "无根浓叶满地堆，莲花出水望秋来，逢牛必定成权贵，跨马骑牛大路开。  " +        sep + sep2 +
        "天福　　天将　　天却  " + sep +
        "此星照命，乃荣华之宿，富贵之星。生来无苦，衣禄自然，有操权，有智慧，" + sep +
        "有镃基，有变豹，有静性，有刚断。作事先难后易，所为十是九非，才逢鸡兔之年，定主妻荣子美。" + sep +
        "述云：一生灾难处，镃基进益多。";

    jing[9][1] = "壬甲　　屯卦　　松透蓬蒿格  " + sep +
        "逢蒿直透茂松青，霜雪虽深且固根，雁飞天外声声远，鸳鸯戏水失其群。" + sep +
        "桃花满苑从君摘，未逢一个好知音，若逢运到蛇羊地，衣禄安然必称情。" + sep +
        "限随羊马发，喜庆自然迎，寿如逢九五，不用问前程。  " +        sep + sep2 +
        "天禄　　天将　　天容  " + sep +
        "此星照命，主人有机谋，有持略，有进济，有财帛。亲如不亲，交友难托，独自向前。" + sep +
        "难为长子螟蛉，庶出方可存留。更遇马牛，钱财兴盛。" + sep +
        "述云：逢牛遇马方还乐，休道年来不称心。";

    jing[9][2] = "壬乙　　井卦　　玉碗盘托格  " + sep +
        "白玉藏珍宝，灵沙隐碎金，异香安水际，方始见浮沉。远飞雁千里，鸳鸯戏绿荫，" + sep +
        "信如花谢后，实子火中寻。满屋乘天雨，阴人隐旧情，猪中逢兔子，方始遂安宁。  " +        sep + sep2 +
        "天暗　　天成　　天赐  " + sep +
        "此星照命，为清风明月之星，为昏迷朦胧之宿。人命犯之，藏机隐志，思远虑深，" + sep +
        "反复镃基，颠倒造化。只宜过房离祖，异姓就赘。妻迟子晚。妻是年高命硬，" + sep +
        "保守到头，子若螟蛉庶出，相陪到老。" + sep +
        "述云：猪羊逢兔子，方始得身荣。";

    jing[9][3] = "壬丙　　既济卦　　猿戏丛林格  " + sep +
        "柱倒人扶起，轮推仗匠园，雁飞沙塞远，有意合天心。命有重荣晚，花开两果鲜，" + sep +
        "马头逢见犬，牛首换弓弦。地远三千里，扁舟泊小溪，贵人来举用，逢丑上天梯。  " +        sep + sep2 +
        "天厨　　天柱　　天霞  " + sep +
        "此星照命，乃游悬之星，犯之志性乃见。远机深，难触犯，不吃亏，易嫌消，不妄相。" + sep +
        "不利东南，得来西北，贵人提携一段财物却有寿。作事可然，面前背后，多招不足。" + sep +
        "述云：名利成就何时晚，只恨初中运不通。";

    jing[9][4] = "壬丁　　比卦　　雁宿芦丛格  " + sep +
        "云收月出天中净，雪压松筠翠转坚，鸡叫牛边声未歇，雁楼芦苇竟艰眠。" + sep +
        "平生志气无人识，马去羊来意向便，报道龙蛇消息好，弓开箭发尽天年。  " +        sep + sep2 +
        "天游　　天静　　天镇  " + sep +
        "此星照命，不耐静，犹加被云遮，镜在尘土；如甜瓜香从辛苦里来，甜向苦中生。" + sep +
        "六亲如冰炭，兄弟若流波。在家烦恼大，出外笑颜多。只宜出外求财，不利在家作活。" + sep +
        "分忧人少，吞食人多之命。" + sep +
        "述云：自有根基在，何劳事不成。";

    jing[9][5] = "壬戊　　蹇卦　　金玉满堂格  " + sep +
        "江边雁阵声声远，孤只飞来野岸中，金玉满堂谁得意，一枝花放暗香通。" + sep +
        "春来满苑花芬晚，百岁枝头一点红，借问马头消息好，箭来蛇上必成功。" + sep +
        "遇午登云路，逢牛渡险堤，命逢鸡犬上，平步上云梯。  " +        sep + sep2 +
        "天宝　　天圭　　天财  " + sep +
        "此星照命，气大心慈，刚性志广。闲管翻成不足，不平处须要闲言，好处成悲，" + sep +
        "恩中生怨，六亲冰炭，兄弟无缘。好事多磨，弄巧成拙。" + sep +
        "述云：从前多少关心事，五九才交事业新。";

    jing[9][6] = "壬己　　中孚卦　　雁度衡阳格  " + sep +
        "海润无涯万里深，蓬莱仙岛在其中，雁声暗度衡阳远，鸳侣双双逐晓风。" + sep +
        "月到更阑天练净，秋风飒飒树头空，君家若问归身计，蛇到龙宫事业隆。" + sep +
        "箭发从空下，龙蛇必换宫，贵人相接引，方始见亨通。  " +        sep + sep2 +
        "天波　　天　　天忤  " + sep +
        "此星照命，能妆点，会施为，立志孤高，见识远大。作事无私，断曲理直，有能三思行之，" + sep +
        "却不鲁莽。口直招人怪，喜得命中有救神。" + sep +
        "述云：生来作事临危处，却得官刑不犯凶。";

    jing[9][7] = "壬庚　　节卦　　换骨成仙客格  " + sep +
        "四海为家未是家，西山尽可作生涯，天边雁叫思南北，池沼鸳鸯独戏沙，" + sep +
        "绕树花芳三五朵，秋残将落一枝花，终知志在逍遥外，欲到蓬莱度岁华。" + sep +
        "说着文君信，君常省是非，要知财禄盛，遇鼠自相宜。  " +        sep + sep2 +
        "天怨　　天年　　天越  " + sep +
        "此星照命，立业早，劳心早。刑杀重，退神多，雕青破肉，斩指截发，可免刑狱，" + sep +
        "只得退神在命，若向松轩竹槛，作一个清闲潇洒之人，量为得地。若在尘劳中末，区区碌碌不能遂心。" + sep +
        "述云：平生多志气，晚景自逍遥。";

    jing[9][8] = "壬辛　　央卦　　雁阵横空格  " + sep +
        "天高地远难凭尺，有志堪宜生羽翼，雁阵横空各自飞，宾鸿江上应孤只。" + sep +
        "要知花果深踪迹，花落枝头俱教逸，向云深处好安身，谩自经营劳苦力。  " +        sep + sep2 +
        "贪狼　　王简　　天喜  " + sep +
        "此星照命，孤高独立，禀性聪明。分忧人少，趁问人多。广招是非，于人不足。" + sep +
        "好事多磨，闲中不静，恶处成活。贵人在命，空得奔波。衣禄有分，人事未知。" + sep +
        "一生凡事劳心费力，便是这个命中所注。" + sep +
        "述云：孤舟无橹棹，大海遇风波。";

    jing[9][9] = "壬壬　　坎卦　　池沼游鱼格  " + sep +
        "生计如鱼戏水池，临危涉险亦无危，鸿飞天上无消息，必竟伤心意绪悲。" + sep +
        "青草池塘鸳鸯失，洞庭湖上客船稀，知君箭发龙蛇地，莫怨如今未得时。" + sep +
        "春来又复秋，如水向东流，若问安闲日，重山好牧牛。  " +        sep + sep2 +
        "天暗　　天器　　天庚  " + sep +
        "此星照命，难为父母，祖业可留，兄弟宜远，妻室难求。清闲潇洒，自在优游，" + sep +
        "一番事作两番做，一重烦恼一重忧。高人举用，小辈啾唧。" + sep +
        "述云：自有贵人相举荐，何须回首夕阳楼。";

    jing[9][10] = "壬癸　　蹇卦　　花柳同荣格  " + sep +
        "万里关山东复西，后前事业是成非，芦丛雁别双双远，雨打鸳鸯两处飞。" + sep +
        "绿树春花开数朵，秋深叶脱独存枝，知君贵在君臣下，只恐天年又不齐。" + sep +
        "遇丙雨两相宜，庚年恐是非，远山逢虎日，龙到更为奇。  " +        sep + sep2 +
        "天笑　　天印　　天焱  " + sep +
        "此星照命，五行安德，四柱坚牢，基业见成，一呼百诺，名传闾里，德誉乡关。" + sep +
        "此命忧中有喜，喜处成悲，退神重重，财物来如骤雨，去如流沙，" + sep +
        "正是花巧得来花巧去，散时容易去时难。" + sep +
        "述云：滚滚生涯闲未得，区区享福晚年间。";

    jing[10][1] = "癸甲　　颐卦　　月年秋夜格  " + sep +
        "双双鸿雁飞霄汉，独对秋光月更明，烟霭雾横千里远，行人犹听马嘶声。" + sep +
        "名成利就还中末，早岁奔驰事未成，更问年来谁是伴，儿男东畔向西倾。" + sep +
        "桥水却难逢，关山两树红，骑牛逢远路，必遇主人公。  " +        sep + sep2 +
        "天晦　　天龙　　天哭  " + sep +
        "此星照命，为人豁达，禀性聪明。不耐静，要寻头，会撑持，能就省。儿女有，不得力，" + sep +
        "钱米不能周急，乐处未能乐忧，中却有欢。作事踌躇多思虑，凶事不凶，凶中却有救神。";
    jing[10][2] = "癸乙　　蛊卦　　雕鹗弃梧格  " + sep +
        "雕鹗离梧别幽谷，飞过岩前立奇木，雁飞天外怨声悲，鸳鸯戏水多翻覆，处处花开我未开，" + sep +
        "我花开时风雨触，劝君不用苦经求，晚年自有千钟禄。运至马牛时，凡事悉皆宜。  " +        sep + sep2 +
        "天叠　　天雨　　天逸  " + sep +
        "此星照命，聪明晓了，睹事执直，镃基自好。心里不足，五行稳润，四柱得局。" + sep +
        "外观好看，里面不足，静中寻出不静，思中成怨，忧处不足。" + sep +
        "述云：休道从前虚度日，始知牛马是丰年。";

    jing[10][3] = "癸丙　　贲卦　　金榜题名格  " + sep +
        "龙楼凤阁帝王城，草屋柴扉贵禄名，金榜唱名应自别，寰中君子骇然惊，" + sep +
        "江边雁过空移影，对对遥飞只听声，试问前程何所是，妻儿子女晚年成。" + sep +
        "命中逢犬喜，乘牛必见凶，马头相遇日，喜气必重重。  " +        sep + sep2 +
        "司谏　　石阙　　天昌  " + sep +
        "此星照命，聪明之宿，人皆仰之。性直心慈，招非惹是，喜努不常，理直睹是。" + sep +
        "亲戚和而不同，朋友和而不美，便是这个命中所注。";

    jing[10][4] = "癸丁　　剥卦　　鸾镜重明格  " + sep +
        "平生似玉无瑕玷，百年磨难未能成，良工巧匠凿成器，早年应须遇贵人。" + sep +
        "霜雁过溪三四只，松筠带叶各枝青，知君意在行云外，半把金银伴月明，" + sep +
        "遇马行千里，逢鸡始过桥，鼠牛心未足，龙虎自逍遥。  " +        sep + sep2 +
        "贯索　　天飘　　天戏  " + sep +
        "此星照命，资财多，费力多，恩爱烦恼多。亲恩如冰炭，兄弟不比和，赞力受奔波。" + sep +
        "孤不尽，妻不和美。只喜得退神重，凶中不凶。" + sep +
        "述云：从前骑虎多不利，今日乘龙便不同。";

    jing[10][5] = "癸戊　　艮卦　　雁过重岚格  " + sep +
        "重山过雁楚天高，百岁儿童晚景豪，早岁不成安乐地，荣处家如磨剑刀。" + sep +
        "园林是处花开早，直至春深雪未消，遇兔马龙身奋发，利民晚岁遇英豪。" + sep +
        "百里秋光起，千秋木叶凋，才逢兔马地，衣禄自然调。  " +        sep + sep2 +
        "天暗　　天奔　　天贵  " + sep +
        "此星照命，独立自成自费力，营家早，风浪早，磨难早。虎狼口，善心肠，好多磨。" + sep +
        "凡百进退，君子知重，小人无缘。惹是招非多，招不足。" + sep +
        "述云：巧成名利日，马足兔头中。";

    jing[10][6] = "癸己　　剥卦　　云散青松格  " + sep +
        "雷发空中应声远，松篁雪化树头青，雁阵声声归远岫，空对芦花月朗明。" + sep +
        "烟里楼台莺语巧，芳堤雨霁马蹄轻，借问桃源花几朵，枝头留下一枝荣。  " +        sep + sep2 +
        "天艰　　天兴　　天晶  " + sep +
        "此星照命，心高志气广，性直会刚断，能施为，会理直，能睹是。虎口佛心，为人慷慨，" + sep +
        "多成少聚，多学少成，好南北，多恩多怨，多因妇人面上不足省顺，可免是非，无心中可要惹烦恼，身安处心不安。" + sep +
        "述云：鸡兔相逢身必贵，引取前来步玉京。";

    jing[10][7] = "癸庚　　损卦　　岩前古柏格  " + sep +
        "古柏岩前岁月深，直坚霜雪耐欺侵，刚柔未决身犹举，白首荣心量满襟。" + sep +
        "禄位得时君自险，资财失处又还成，要知立业安身计，三四人中一老心，" + sep +
        "树花逢一果，蛇猴合称心。  " +        sep + sep2 +
        "天福　　天台　　天极  " + sep +
        "此星照命，执直睹是，仁义礼乐，所为平品。作事忠良，能亲君子，会御小人。" + sep +
        "凶中有救，有犯官刑。六亲冰炭，朋友无情。述云：利民还自得，五九好身荣。";

    jing[10][8] = "癸辛　　大畜卦　　池映芙蓉格  " + sep +
        "池畔芙蓉照水开，松筠力办雪霜材，孤飞雁过潇湘远，百岁儿童去复来。" + sep +
        "兴废只因辛到癸，成名好趁卯寅来，谁将杖击云中鼓，震动成声满九垓。" + sep +
        "跨马身荣早，骑牛带禄荣，莫言今未显，羊角虎头成。  " +        sep + sep2 +
        "天福　　天仓　　天晦  " + sep +
        "此星照命，为人聪明俊秀，性直口快，有执持，能耐事，如松筠之在岁寒，经霜雪而不改其性操。" + sep +
        "与朋友交，久而敬之。骨肉情疏，子息晚立。遇辛癸且兴且废，逢寅卯志遂名成。" + sep +
        "身荣家富，作事振作，声誉四方，经险而不危，遇凶而自消，末主福禄称心。" + sep +
        "述云：过了千重险，虎羊身始成。";

    jing[10][9] = "癸壬　　蒙卦　　虎隐深山格  " + sep +
        "遇浪轻舟不复高，平生兴废若波涛，逢猪才息风波险，遇鼠方知松节高。" + sep +
        "雁叫碧空悲夜月，鸳鸯并队戏新潮，要知箭发从何处，遇虎方知福自高。" + sep +
        "遇虎身舒畅，逢兔福优游。  " +        sep + sep2 +
        "锻炼　　孤虚　　天福  " + sep +
        "此星照命，如枯木逢春，旱苗得雨。五行中劳心早，历事早，烦恼早，艰辛早。妻不得力，" + sep +
        "子不替忧。心性紧慢不均，大宽小急。作事龙头蛇尾，有始无终。皆因退神重。" + sep +
        "述云：初年吃尽艰辛苦，末主安闲福始来。";

    jing[10][10] = "癸癸　　艮卦　　墙畔黄葵格  " + sep +
        "今日心同百岁时，争知名利未相齐，有根不断阶前草，总有孤鸿江上飞。" + sep +
        "春树有花终结子，冬深松柏寿同齐，若问生涯成利禄，才逢羊马便相宜。  " +        sep + sep2 +
        "牵牛　　天应　　天空  " + sep +
        "此星照命，如芝生榭砌，竹茂南轩，根深叶实，情异直坚，心慈志广，玲珑天然。" + sep +
        "只因退神在命，父母堂前，过客兄弟，天边雁阵，妻妾同林，宿凤儿女。谩惹荣牵，" + sep +
        "初年管见，驳杂荣华在晚年。休言晚发，五行所注之然。" + sep +
        "述云：晚景成身处，羊马始亨通。";
  }
}