package org.boc.db;

import java.util.Map;
import java.util.HashMap;

public class Xingming {
  private static final String kg = "\n    ";

  public static final char[][] filter = new char[10][100];
  static {
    filter[0] = new char[] {'猪','鸡','狗','蛇','鸭','畜','蛋','麻','菜','肉','屎',
        '尿','泡','欲'};
    filter[1] = new char[] {'颠','疯','臭','死','灾','病','瘟','疫','骚','货','穷','逼','皮'};
    filter[2] = new char[] {'笨','蠢','憨','邋','遢','骗'};
    filter[3] = new char[] {'日','入','干','操','养','踩','去','来','跑','走','跳','蹦','跺','挤'};
    filter[4] = new char[] {'你','我','他','爸','妈','娘','爷','奶','父','母','姨',
        '姑','哥','嫂','公','婆','鬼','妖','狐','狸','神','经','性'};
  }

  /**
   * 五格字典
   */
  public Map mapWuge = new HashMap();
 {
    mapWuge.put("贤", "二子吉祥，多才巧智，中年平，晚年吉祥，但短寿。");
    mapWuge.put("斌", "多才伶俐，清雅荣贵，成功隆昌，忌车怕水，短寿之字。");
    mapWuge.put("若", "福禄双至，孤独格，刑偶伤子，中年潦倒，晚年吉祥。");
    mapWuge.put("森", "凶死恶亡之厄，配合吉亦生祸端，或爱情厄，身弱短寿，不祥。");
    mapWuge.put("彪", "智勇双全，清雅多才，中年劳，晚年吉祥，武官大吉。");
    mapWuge.put("夏", "出外吉祥，小心爱情厄，多才贤能，秀气温和，中年劳，晚年隆昌。");
    mapWuge.put("慎", "富禄双收，智能非凡，子女吉祥，中年平，晚年昌隆。");
    mapWuge.put("患", "出外吉祥，天生聪颖，温和贤能，晚婚大吉，出国之格，小心受厄运。");
  }

  private static final String ganqing = "含有伤病信息，婚姻不好常有莫名感情烦恼。";
  private static final String shangzai = "多含有意外伤灾(甚至官非凶亡)信息。";
  public static final Map map = new HashMap();
  static {
    map.put("匕","手术开刀信息，难免创伤之苦。");
    map.put("超","走刀口，"+shangzai);
    map.put("颖",shangzai);
    map.put("鲲",shangzai);
    map.put("娜",ganqing);
    map.put("希",shangzai);
    map.put("莉",shangzai);
    map.put("昭",shangzai);
    map.put("麒",shangzai);
    map.put("照",shangzai);
    map.put("麟",shangzai);
    map.put("虎",ganqing);
    map.put("镳",shangzai);
    map.put("萍",ganqing);
    map.put("兰",ganqing);
    map.put("琴",ganqing);
    map.put("慧",ganqing);
    map.put("珊",ganqing);
    map.put("花",ganqing);
    map.put("湘",ganqing);
    map.put("春",ganqing);
    map.put("梦",ganqing);
    map.put("琳",ganqing);
    map.put("蕊",ganqing);
    map.put("蝶",ganqing);
    map.put("婵",ganqing);
    map.put("卿",ganqing);
    map.put("云",ganqing);
    map.put("怡",ganqing);
    map.put("黛",ganqing);
    map.put("荣",ganqing);
    map.put("莲",ganqing);
    map.put("桂",ganqing);
    map.put("菲",ganqing);
    map.put("丽",ganqing);
    map.put("英",ganqing);
    map.put("梅",ganqing);
    map.put("来",shangzai);
    map.put("设",shangzai);
    map.put("森",shangzai);
  }

  public static final Map mapBsms = new HashMap();
  static {
    mapBsms.put("雨","现实过往痛苦多,泪流如雨受折磨.生意场中将破产,疾病之中痛难多。");
    mapBsms.put("刀","手术开刀信息，难免创伤之苦。");
    mapBsms.put("十","医院标志，有疾病征兆。");
    mapBsms.put("比","手术开刀信息，难免创伤之苦");
    mapBsms.put("皿","血字底，有血光之灾。");
    mapBsms.put("刂","开刀标志，有疾病征兆。");
    mapBsms.put("米","四面受难困苦多,办事不通无奈何;病情复杂多处痛,生意买卖亏空多.");
    mapBsms.put("戈",shangzai);
  }
  public static final Map mapBshz = new HashMap();
  static {
    mapBshz.put("雨","雩雪雲雳雰雯雱雷電零雹雾需霆霁震霄霉霈霅霂霖霙霏霍霓霑霎霜霡霞霤霪霭霧霫霨霰霸露霹霾霽靆靁靄靉靃靂靈");
    mapBshz.put("刀","刀刁刃刄切分叨召刍危负争色刧龟奂免兔券矦負烉急艳象剪絜艴棼鲁赖剺詹魯劒劈賴臲燄龜釁艶");
    mapBshz.put("十","千廿午卅升丗支卉古叶卌卋早毕老考华协孝克芈孛皁辛幸卓直卑阜卒丧卖協南乹真隼索乾啬章率覃敧乾博辜惪喪韩朝幹献嗇凖斡榦兢嘏睾翰韓矗");
    mapBshz.put("比","比毕昆皆毘毗毖毙琵");
    mapBshz.put("皿","盂孟盇盃盅盆盈盐盍盋盏监盎盌盉益盔蛊盛盒盘盗盖葢盜蓋盞盟盝監盡盤盬盥盧盦盨盩盪簋盬簠蠲蠱盭鹽豓豔衋");
    mapBshz.put("刂","刈刌刊刑刓列划刚则创刖刎刘刬刦别刪钊利删刨判刭刜刺刳刵到刲刿剀刹刽制刮例剁刴剂刻刷荆剋剌剄削則剐剑剉前剃剒剞剚剗剕剛剔剮釗剖剠剡剜剧剥剟副剳喇剴創剩割蒯剽剷剹剿劂剳劁劀劃劚劐劌劇劍劊劉劑劓檦劘劅劙");
    mapBshz.put("米","籴类籼籸籹娄籽粔粃敉粉粇料粑粝粘粗粕粒粜粪粟粞粤粦粢粧粥粳糒粲粯粰粱粮精粺粼粽粹糁糂糊糉糇糌糍糅糈糙糗糕糖糟糞糡糠糝糧纇糨糯糰糲颣糱糴鬻糵糶");
    mapBshz.put("戈","戋戊戉戎划戌戍成戏戒找我或戗哉战咸威栽烖载域彧戛戚盛戔裁胾戛戟戢惑戟戢載戡盞戥戣戤截戬戩巀戧臧戯戮畿馘戰戴戲戳鹹殲");
  }

  public static final int[][] szjx = new int[6][80];
  static {
    //1大吉 0吉凶参半 2凶
    //3理智发达 4情感浓厚 5意志坚韧
    szjx[1] = new int[] {41, 45, 47, 48, 52, 57, 62, 63, 65, 67, 68, 81 ,
        1, 3, 5, 8, 11, 13, 15, 16, 21, 23, 24, 25, 29, 31, 32, 33, 35, 37, 39};
    szjx[0] = new int[] {6, 7, 17, 18, 27, 30, 38, 40, 51, 55, 61, 75};
    szjx[2] = new int[] {
        2, 4, 9, 10, 12, 14, 19, 20, 22, 26, 28, 34, 36, 42, 43, 44, 46, 49, 50,
        53, 54, 56, 58, 59, 60, 64, 66, 69, 70, 71, 72, 73, 74, 76, 77, 78, 79,80};
    szjx[3] = new int[] {1, 13, 21, 23, 24, 25, 29, 31, 35, 38, 39, 41, 45, 48, 52, 63, 67, 68};
    szjx[4] = new int[] {1, 3, 5, 6, 11, 15, 16, 21, 23, 32, 33};
    szjx[5] = new int[] {7, 8, 11, 17, 18, 21, 31, 37, 41, 47};
  }
  //天格、人格、地格、外格、总格
  public static final String[] wuge = {
      "继承父母运势的上一辈对下一辈的影响。",
      "主运17—32岁之间的成就，能力、个性、境遇。",
      "基础运l-17岁之间的与子女、部属、晚辈的关系。",
      "副运33—48岁之间的社交活动、人际关系、环境家居、同辈等。",
      "晚年运主管48岁之后的运势。"};

  public static final String[][] szhy = new String[80][5];
  static {
    szhy[1] = new String[] {
        "(宇宙起源)--天地宇宙开泰的太极数。",
        "基业：聪明，多学、成功、富贵、名誉、幸福、财帛、进田。",
        "家庭：竹木成林、父母有萌、家庭圆满、子妇多孝。",
        "健康：健全、可望长寿，三才不善者不遇。",
        "含义：此为万事万物的基本数、为最大吉祥的表示， 属于分外大成功，健康富贵、名誉、" + kg +
        "幸福、可以享福终世。 因其过好、常人难承当之数"
    };
    szhy[2] = new String[] {
        "(一身孤节)--属末定的分离破灭数。",
        "基业：劫财、破灭、灾危、破家、红艳、变迁、美貌。",
        "家庭：亲情疏远、夫妻应相互理解、则免别离之苦。",
        "健康：凶弱、短亦有之，易患皮肤病外伤、矢折。",
        "含义：混沌末定数，为最大凶恶的暗示，无独力之气力进退失自由、其内外生波澜因苦不安，" +
        kg + "摇动、病患遭难，甚至残废。如伴有其他好数者不致夭折，其人辛苦一生， 志望难达破灭无常。"};
    szhy[3] = new String[] {
        "(吉祥)--进取如意的增进繁荣数。",
        "基业：术、技艺、祖业、丰盛自立、建业官禄。",
        "家庭：家内施惠，可得贤妻六亲和睦须戒自私。",
        "健康：松柏林立，健康良好，可望长寿。",
        "含义：阴阳抱合，万物确定形成之象，有吉祥、 成功发达之兆，智达明敏，艺精工巧有首领之资，" +
        kg + "自然之福，名利双全能成人事业，荣进有望，福祉无穷。"};
    szhy[4] = new String[] {
        "(凶变)--身遭凶变的万事休止符。",
        "基业：美貌、香艳、破家、灾危、劫财；损家业。",
        "家庭：六亲缘薄、兄弟如同画饼，热心相助者少，应看开一些。",
        "健康：衰弱，外伤，皮肤病，夭折病死，发狂病。",
        "含义：属破坏的凶就数，不足不全的灭亡之数，进退不自由，独立乏能力，大多辛苦困难，" +
        kg + "或者与其他凶运配合而致发狂病死，夭折，或者放浪，破灭，逆难终成废人。但孝子、 节妇、怪杰等，也有出自此数者。"};
    szhy[5] = new String[] {
        "(种竹成林)--福禄长寿的福禄集合数。",
        "基业：学者、祖业、文昌、福星、官星、财钱。",
        "家庭：上下和睦，相互合作，可望圆满，子女多荫。",
        "健康：福禄如海，寿比南山，可望健康。",
        "含义：阴阳交感，和合，完璧之象，隐藏大成功运，精神敏锐，身体健全，福禄长寿，富贵繁荣， "
        + kg + "无所不至或为中兴之祖，或即或不如此，也会博得功名荣誉，圆满无碍福祉祯祥无比。"};
    szhy[6] = new String[] {
        "(安稳)--安稳吉庆的吉人天相数。",
        "基业：豪杰、官禄、财钱、将星、学者。",
        "健康：逢凶化吉，遇一次生险，可得长寿。",
        "含义：天德地祥具各，福庆甚广， 家势盛大万宝朝宗之运然满极必损，盈极必亏，" +
        kg + "若其他要素配合的不周者,恐或如流水而下，成为所谓乐极生悲之象，此数理具有天赋之美，安稳吉庆终生。"};
    szhy[7] = new String[] {
        "(精悍)--刚毅果断勇往直前的进取数。",
        "基业：独立、官禄、进取、技术、刚硬。",
        "家庭：缺乏同心力，内外不合， 善涵养修身者事得家庭圆满。",
        "健康：日月光明，心身健保，可望长寿。",
        "含义：独立、单行、极感之象，过刚而缺乏同化力之意, 如果顽刚弄权，易酿成内外不和，" +
        kg + "幸而天赋的精力充沛,具有调节事物的才能, 若能涵养雅量，扩大气度自然幸福上进，" +
        kg + "女性有此数者，难免有男性之情性，切要注意温和才会吉利而无过失。"};
    szhy[8] = new String[] {
        "(坚刚 )--志刚意健的勤勉发展数。",
        "基业：艺能、美术、学者、官禄、天官、师表、蓄产。",
        "家庭：兴家成为达人贤者，家境先难后易。",
        "健康：高山立松完健自在，可望长寿。",
        "含义：意志如铁石，富于进取的气概, 排除万难， 贯彻目的名衬两得，忍耐克己逐成大功" +
        kg + "但其他运配合不善者， 可能有遭难的厄运。"};
    szhy[9] = new String[] {
        "(破舟进海 )--吉尽凶相，穷乏之数。",
        "基业：官禄、图印、太极、怪杰、富翁、突破。",
        "家庭：亲情不睦，口说长短者多，力持贤明者平安。",
        "健康：女性成风流或与夫别离病弱，弱女皆晚婚, 多积德可免短命。",
        "含义：利去劫空，陷落穷艱悲痛或者幼小离亲而困苦，或者病弱，不遇，" +
        kg + "遭难废疾，贫困，灾难，孤独甚至刑罚, 有不测遇凶祸，人格有此数者则为大凶，" +
        kg + "即或一身得免灾害, 也难免配偶丧失, 有缺子这叹, 实为人生最大恶运但在例外的怪杰，富豪能出此数者。"};
    szhy[10] = new String[] {
        "(零暗)--万业终局充满损耗数。",
        "基业：天福、文昌、散财、官禄、破危、矢寿。",
        "家庭：家内总是冷眼旁观者多，伤害妻子破镜难圆、 百忍者尚可平安。",
        "健康：杀伤刑罚，病弱、灾危、女易风流, 心性变态, 境地，空虚无物，人格有此数者，" +
        kg + "多非业短命, 如同日没。",
        "含义：四顾茫茫，神哭鬼嚎振凶之象，行万象乏气力，常陷于不如意，" +
        kg + "凡要求功，因多障碍渐自失败，遂致破家亡户；或者贫困逆难叠至，无眷属之缘，" +
        kg + "或者自幼失亲，或者病弱，遭难，或者有不测之灾祸；或者犯官府等，难免非业非运，" +
        kg + "三才配合不得其宜者，大都中年哨后编进黄泉之籍, 然万人中有一二例外，可绝处逢生。"};
    szhy[11] = new String[] {
        "(早苗逢雨)--挽回家运的春成育数。",
        "基业：财星, 天佑、暗禄、文昌、技艺、田宅。",
        "家庭：养蜂结蜜，事事和顺，处处温和。",
        "健 康：河川永在，可望健康长寿。",
        "含义：享天赋幸运，万事顺利，有得富贵荣誉， 再兴家的暗示，得挽回家运平静和顺的最大吉数。"};
    szhy[12] = new String[] {
        "(掘井无泉)--意志脆弱，家庭寂寞数。",
        "基业：凶星、破厄、劫财、时禄。",
        "家庭：亲情如秋水，骨肉似寒炭，施恩招怨，宜提高气节。",
        "健康：枯木待春，小心神经衷弱，骨癌之疾、外伤、皮肤病，三才良者可安全。",
        "含义：有无理伸张之象，不顾脆弱之力， 企图做无能力做的事，多失败。遇事易生足之心，" +
        kg + "家庭无缘，孤独、遇难、 逆境、病弱、不如意、困难等， 又可因其他运配合而导致意外" +
        kg + "的失败，甚至有不能完寿的悲运。"};
    szhy[13] = new String[] {
        "(春阳牡丹)--智能超群的成功数。",
        "基业：大官、文昌、技艺、进财、学士、田产、财库。",
        "健康：可能健全长寿、先天五行不和者不遇。",
        "含义：富学艺才能，有智谋奇略，忍柔当事， 任何难事皆巧于奏大功，"
        + kg + "为得享福贵荣华的好诱导，充满智满是其特点。"};
    szhy[14] = new String[] {
        "(破兆)--沦落天崖的失意烦闷的数。",
        "基业：暗禄、美貌、艺术、流浪、红舞、劫财。",
        "家庭：骨肉疏远，离祖迁居，自家兄弟全无分、 外处事又能缘。",
        "健康：男女均属好貌、皮肤病、感胃、风郁， 先天五行相含有健康。",
        "含义：多破兆，家属缘溥，丧亲、丧子、 兄弟姐妹分离孤独，不如意，烦闷，危难，" +
        kg + "遭厄，浮沉不定，为了慷慨，施惠招怨，劳而无功，，凄惨孤独，其他好运者不多，有伤夭寿。"};
    szhy[15] = new String[] {
        "(福寿)--福寿共照的",
        "基业：天官，贵人，福星、官禄、进田、畜产。",
        "家庭：清静家田，园满之象子孙昌盛。",
        "健康：海底明珠，安稳徐庆，健康自如。",
        "含义：此数为最大好运，福寿园满之象，顺和、雅量，多受福泽，德高望重，自成大业，富贵荣华，" +
        kg + "吉祥有德， 繁荣兴家的大吉数。"};
    szhy[16] = new String[] {
        "(厚重)--兴家得助的贵数。",
        "基业：天官、贵命。",
        "家庭：春日花开，可望家庭圆满，男子有贤妻， 女子不宜早婚。",
        "健康：花草逢春，贵弱于色情，戒慎者可望安康。",
        "含义：反凶化吉象，成首领，占上风，雅量厚重， 豪侠足智多谋，善于协调，集名望，能服从，为大事大业可成，富贵发达的好表示。"};
    szhy[17] = new String[] {
        "(坚操)--突破万难的撅柔兼备数。",
        "基业：天宫、将星、威武、艺术。",
        "家庭：女性若能教养女德，贤慧者可望园满。",
        "健康：心身健康，可望长寿。",
        "含义：权威刚强，有已无人，以至与人不和， 如善于避开此短处，则为大吉，意志坚定，" +
        kg + "具突破万难的气节是其最大的优点，如过于无理任性，恐反成失败，如果立志勇往向前，" +
        kg + "必成功而建大业，若陷过刚而变固执，必招厄患，切要警戒，妇女有此数者易流于男性。" +
        kg + "如果能涵养女德，存福禄自然随之，但先天条件弱的妇女，反要用此数为妥。"};
    szhy[18] = new String[] {
        "(铁镜重磨)--有志竟成的内外吉数。",
        "基业：将星、文昌、太极、畜产，财帛，技艺。",
        "家庭：有祖宗荫庇之，心慈口硬，宜守和不可望园满。",
        "健康：心身健全如万年蛇，可望长寿。",
        "含义：铁石心发达运具备，有权力、智谋，志向一方， 必排诸难，博得名利，但自我心强，"+
        kg + "乏包涵力，诱发非难，宜养柔德，且慎深勿骄，见目的贯彻，功名成就。"};
    szhy[19] = new String[] {
        "(多难)--遮云蔽月的辛苦重来数。",
        "基业：官禄、进田、经艳、财帛、智谋、凶危破财。",
        "家庭；家内朝思幕致，兄弟成吴越， 须思手足情应多注意。",
        "健康：风云蔽月，病弱、刑罚、杀伤、短命，先天五行，属金水者可望安康。",
        "含义：有多智谋，虽有兴大业，博得名利的实力， 但每发生意外的陷害, 内外不和，" +
        kg + "困难苦惨不绝，如果主运有此数又乏其他吉数以相助，多陷病弱，孤寡,甚至有夭折，" +
        kg + "妻子死别，刑罚,杀伤等灾，为万事挫折非命至极，故也叫短命数，但先天有金者，可成巨富，怪杰，伟人。"};
    szhy[20] = new String[] {
        "(屋下藏金)--非业破运的空虚数。",
        "基业：官星、部将、美术、智能、红艳、凶象。",
        "家庭：亲情不立，兄弟相隐，离祖败家， 凡事百忍则家中能平呼。",
        "健康：泥牛进海，难以为继,三才配合不善者命运多难，病弱,金木者安全。",
        "含义；物将坏之象，具有短命非业的诱导，所谓大凶之运一不生不得平安，灾祸频临，为如意，" +
        kg + "陷于逆境，或导至病弱，短命，非业，破灭，不能支持一家者，或幼时别亲， " +
        kg + "而陷困苦或者叹子女的不幸，或者男女丧失其配。"};
    szhy[21] = new String[] {
        "(明月中天)--明月照光，体质刚健之数。",
        "基业：天官、太极、文昌、哲学，财库，福禄，首领， 君臣，富翁。",
        "家庭：六亲和睦，有中之嗣惠，若女人不为吉， 用则破大运。",
        "健康：秋月芙蓉，状年健状、长寿。",
        "含义：风光霁月之象，万物形成自立这势，独立权威， 能为首领之运，为人尊仰离受富贵显荣。"+
        kg + "路径属迈进发展， 中途难免相当苦心步步而进，宛登梯一样，立业兴家，大博名利，乃贵重的吉数。"+
        kg + "因系伟大的首领格妇女得此数者，以招灾害，按<<易经>>上观点女性属阴应助男性，是为先天的补数，"+
        kg + "如具备首领之运，即妻凌夫之格，阴阳生出斗暗， 自然不得安宁故夫妻难免时常反目，或喜极悲生，"+
        kg + "且妇德为备，家庭为园满， 妻便克夫，所谓两虎相斗，必无双全者慎之戒之。"};
    szhy[22] = new String[] {
        "(秋草)--秋草逢霜的斗争数。",
        "基业：远洋、天乙，君臣，将星、劫赌　，市财。",
        "健康：常有暗疾，三好四怯或医短命。",
        "含义；百事不如意，志向半途而废，多属懦弱， 正职秋草逢霜之象，困难，病弱无气力，陷孤独，" +
        kg + "逆境不平常， 但也有伟人，豪杰有此数者，不过其人生多波折。"};
    szhy[23] = new String[] {
        "(壮丽)--旭日东升发育旺盛数。",
        "基业：首领、君臣、暗禄、财库、进宅、学士。",
        "家庭；男人园地，女人则零落，人格此数多克大。",
        "含义：伟大昌隆之运，威势冲天之象，微同出身， 逐渐长势，终至首领，有如凯旋之将，" +
        kg + "猛虎添翼之势。权力旺盛， 胜事恐过度而为憾，然而感情锐利，壮丽可爱， 实属贵重的运数。"+
        kg + "但女性有此则不及此，其理由同于二功一数， 妇女凡主运此数者，难免转成零落而绣榻悲寒也。"};
    szhy[24] = new String[] {
        "(掘藏得金)--家门余庆的金钱丰盈数。",
        "基业：大官、福星、文昌、企业，财库、君臣，工商、 富贵。",
        "家庭；不依祖业而立身，家庭圆满，兄弟和睦， 但应保持无私。",
        "健康：松柏常青，可望长寿。",
        "含义：路途多有崎岖，实为难免，然而策略智谋出众， 白手可以成家，财源广进到老愈直，" +
        kg + "子孙继承余庆的福运。"};
    szhy[25] = new String[] {
        "(荣俊)--资性英敏的刚毅数。",
        "基业；君臣、首领、福星、文昌、企业、财禄、技艺、 财库、进田。",
        "健康：健康，在三才善良者可望长寿。",
        "含义：资性英敏，有奇特的才智， 唯性情不平衡而偏重一方，言语多少有点棱角柔中带硬，" +
        kg + "或者怪异， 虽有涵养不足者，多成怪人，与外人打交道缺谦虚无英俊之才， 自有克成大业任，" +
        kg + "意气用事傲迈无礼，恐弄吉成凶。"};
    szhy[26] = new String[] {
        "(变怪)--变怪奇异的豪侠数。",
        "基业：豪侠、君臣、官禄、侠义，红舞，财库、凶危。",
        "家庭：亲情无义妻子无助，若子女温顺可得圆满。",
        "健康：属波漾重叠,数奇怪变化的英雄运格, 有义气侠情, 然而变化常多, ",
        "含义：风波不息此数中人, 临万能, 过死线, 而奏大功者有之,",
        kg+"力不足, 随波逐流, 碰波折而破产亡家者有之,又因为他格的配合,"+
        kg+"或陷放逆, 淫乱,短命,或者丧配偶,銮褥生霜, 或丧子女膝下零丁,属大都不得顺境的数运, 但不少怪杰，"+
        kg+"烈士 伟人则有出其格者。"};
    szhy[27] = new String[] {
        "(增长)--欲望天上境 ,宜静待时数。",
        "基业：天官,将军,师长,学士,文昌,凶厄,破财,残疾。",
        "家庭：六亲不得利, 兄弟远离。",
        "健康：病,刑罚,心脏病,短命,先天五行为水者可望安全。",
        "含义：自我心强,多会诽谤攻击,而易致失败, 所谓难运, 大多为半路中折之象, 始以其智谋,"+
        kg+"努力奋斗博得名利待过中年, 势惭趋大, 内外酿出不和, 难以发达到老,假使自身温顺富有也不会避开"+
        kg+"背后是非不息, 也因其它运的并系或刑罚, 死于逆难等。"};
    szhy[28] = new String[] {
        "(阔水浮萍)--豪气生离的行踪无定数。",
        "基业：天官 ,将星,官性,学士,红艳。",
        "家庭：亲属多忌怨, 兄弟少习络, 子女别离。",
        "健康：三才不良者病灾,残疾,发狂,三才善良者无大灾。",
        "含义：遭恶运时,有一种英雄气概,但难逃非难诽谤,时或危维难袭来,而致伤 ,或丧失配偶,相克子孙,"+
        kg+"也可能有自别亲者,总之大都有祸乱 ,争论不和,逆维,刑罚等,灾祸相接,终生劳苦, 妇女有此数者"+
        kg+"多限于为独身或家庭 不幸,的运格。"};
    szhy[29] = new String[] {
        "(不平)--泉舟顺展的大立功数。",
        "基业：天官,太极,君臣,天厨,将星,财帛,文昌,深谋,富翁。",
        "家庭; 乏祖力, 地格为时, 有乏子息或不和。",
        "健康：先天五行为金而三才善良者,可望安康,土火者弱病之虑。",
        "含义：智谋优异,奏功受福之格,财力活动力俱备,成就大业之相,但是不足不平的念头不绝,任意行事,"+
        kg+"欲望无止境 多易弄巧成拙, 至于妇女, 都流于男性, 或者造成茺亡猜疑灾, 切要慎戒之。"};
    szhy[30] = new String[] {
        "(非运)--绝境逢生的运路分岐数。",
        "基业：官星, 将星, 文昌, 豪放, 红艳, 血支, 实厄。",
        "家庭：亲情不亲,夫妻不相合难同白头。",
        "健康：刑罚,外伤,残疾,先天五行为金者可安然。",
        "含义：浮沉不定,凶吉维分, 即因其他运的配合, 或者成功者, 或者沉于失败故在吉运者, 成功自至,"+
        kg+"数理不良者不知不觉之间陷于夫败,其地不可测突然别开生面埏有之,就象开矿探险一样,大成大败,"+
        kg+"具有饶幸, 另外也有 独, 丧失妻子, 短命者。"};
    szhy[31] = new String[] {
        "(春日花开)--智勇德智,可离清福。",
        "基业：太极,君臣,将星,学士,文星,田宅, 业。",
        "家庭：可望幸福,子女多萌,地格被克者刚不过。",
        "含义;智仁勇俱备,意志坚固,千挫不挠,脚步踏实,能成就大业的运格,可率众人,博得名誉,繁荣富贵。"+
        kg+"幸福, 属温柔平静, 运势强大的首领运。"};
    szhy[32] = new String[] {
        "(宝马金鞍)--饶幸多能的意外惠泽运。",
        "基业：天德,月德,君臣,将星,文星,学士,文昌,进宅,祖业。",
        "家庭：家门隆星,可能园满,子孙旺发,男有双妻之格。",
        "健康：可能圆满,而三才者有略患。",
        "含义：饶幸多望之格,若能长辈提携,其成功势如破 ,世品性良,大有爱护他人之德,家门隆昌,繁荣,"+
        kg+"至上吉数。"};
        szhy[33] = new String[] {
        "(牛天)--家门隆,才德开展数。",
        "基业：天官,臣将,部长,文昌,学士,田宅,富翁。",
        "家庭：可望健康, 身 强口硬, 妇女用则独。",
        "健康：三才不善颧配合行天五行不易者,有略患。",
        "含义：鸾风相会之象,形成确定之意, 多功多智谋 刚毅果断有如旭日东升, 旺极昌隆至极, 属名闻天下有"+
        kg+"吉祥数,但如果断过刚毅,扫误事,而且过贵重,常 人恐不能受,但又是物极必反,繁荣的反沦为黑暗,"+
        kg+"勿轻用之, 用则单独。"};
    szhy[34] = new String[] {
        "(破字)--破家亡身的见识浅少数。",
        "基业：臣将,君臣,文昌,学士,破财,凶厄,破灭。",
        "家庭：家缘薄,妻子分离,忍耐可保症安。",
        "健康：短命,杀伤,刑罚,脑溢血,麻疹,发狂,先天五行三才善才者也可以得安康。",
        "含义：属破坏的大凶运, 乱离的祸象颇强, 凶煞一到, 便接连而来, 事业生大凶大困难, 大辛苦, 内外破乱,"+
        kg+"万事龊龌, 衰败, 悲痛无限, 因其他数的配关系, 有病弱短命, 丧失配偶, 子女离别, 刑伤, 杀伤, 或致发狂灾"+
        kg+"祸至极, 为破家, 亡身 的最大凶数。"};
    szhy[35] = new String[] {
        "(高楼望月)--温和平静的优美发展数。",
        "基业：将相,学士,文昌,艺术,财库,田宅,工商,温柔。",
        "家庭：上流家庭,可能园满,被运格克者,病苦亦有之。",
        "含义：温良和祥之象,有智达的能力,在文技术方面定能发展,若怀大志,欲为大事者,须用大力气,"+
        kg+"彻底节义, 以补不彻底的赋性和权力号召力, 因其象少谋略气魄, 故此数实为保守平安的吉祥数,"+
        kg+"所以此最适合女性, 为男性则倾向消极。"};
    szhy[36] = new String[] {
        "(波澜)--风浪不平静的枉费力数。",
        "基业：将星,学士,文昌,文相,破厄,凶煞,崩山,劫家。",
        "家庭：六亲不力, 夫妻离合, 子息宜迟, 应多做善事, 以含积德。",
        "健康：短命,病患,外伤,病 疾,三才善良者,可望安康。",
        "含义：为波澜重叠,浮沉万状的英雄运,为侠气义睛敦厚,杀身成人之格,一生难得平安,辛苦困维多,"+
        kg+"袖手不进失几沦落,与其它运配蛤 不善者,或病弱,短命,危难等不无所至。"};
    szhy[37] = new String[] {
        "(猛虎下山)--权利源发展基业数。",
        "基业：鼗星,官禄,文昌,艺术,权利,祖业。",
        "家庭：家庭和睦园满,女性若有烈强,官守女德,则有可望。",
        "健康：长寿多,先天五行或人格克者,易患疾病,少数为心脏病。",
        "含义：独立,权利,忠实,奉劝无势之象,主畅通达,热诚忠烈,消重病破万难而成大业俾祥有德,善发才能,"+
        kg+"离受天福之幸, 终身富贵极, 但因权 独立, 而维免有独立感, 宜心存平和, 留神静安。"};
    szhy[38] = new String[] {
        "(磨铁成针)--意志薄弱的刻决经数。",
        "基业：将星,学基,臣将,神童,技艺,凶煞,伤杀。",
        "家庭：亲属冷淡, 兄弟无助, 宜平和可满, 。",
        "健康：灾维,外伤 ,肮病,三才配合者尚可园满,",
        "含义：非于大成,实乏统率的人心,缺乏首领的才干,属于有志而乏力,不得众信,一种薄弱平凡之象,"+
        kg+"自然易险于不幸失意而难以成功, 但象文学技术方面发展, 则有较强的能力故此数为艺术成功数。"};
    szhy[39] = new String[] {
        "(富贵)--富贵荣华的变化无穷数。",
        "基业：臣将,文昌,艺术,智能,财库,进田。",
        "家庭：安宁自在,可望园满,子孙昌盛,三才被克者则不园满。",
        "健康：可望安康,三才不善者有病弱。",
        "含义;此数已乱而过,任成幸福贵重之格,权利,长寿,财帛丰富,德泽四乡,财富盈身 ,富贵已极,"+
        kg+"暗埋悲惨之象, 所谓物极必反, 切勿轻用之。"};
    szhy[40] = new String[] {
        "(退安)--谨慎治安的豪胆迈进数。",
        "基业：将星,文昌,学士,豪杰,胆量,凶灾,祸厄,劫财，",
        "家庭：亲情远淡,兄弟分离。",
        "健康; 凶病, 胃病 外伤, 三才善良者可弥补。",
        "含义：富智谋,有心机,然含不逊之心,乏声望,易受诽谤功击,外于浮沉协凶的歧路上,好危险投资,"+
        kg+"依其他运关系, 有酿刑伤罪,犯病者有陷病弱,独短命者,有爱动反招失败,故为进而招祸。"};
    szhy[41] = new String[] {
        "(有德)德高望重的事事如意数。",
        "基业：将星太极,名人,老者,学士,学者,官禄,财库,福星。",
        "家庭：家庭圆满,子孙昌盛,地格被克者不遇。",
        "健康：可望健康长寿,二才不善者不遇。",
        "含义;纯明独秀的吉数,胆力才谋具备,健全,有德,能成大业,顺利的最大好运数。"};
    szhy[42] = new String[] {
        "(寒蝉在柳)--数十艺不成的穷困已极数。",
        "基业：君臣,部将,官星,文昌,劫煞,灾厄,凶变。",
        "家庭：亲情无义,朋友无缘,妻子反目,三才善者则无妨。",
        "健康：病弱,先天五行为火,者可望安康,但须三才善良。",
        "含义：博识多能,有技艺,精通世情,无奈十艺九不成,多薄弱不如意,缺乏自信心为寂寞悲苦之象,"+
        kg+"失意之状, 如果专心进取, 或者可以成功, 不然必大失败, 此数中也有孤独病弱者。"};
    szhy[43] = new String[] {
        "(散财)--须防邪途灾祸重数。",
        "基业：将星,文字之星,学者,凶星, 灾厄伤残。",
        "家庭：妻弱无助,子多不肖,心心相印,三才善良者无妨。",
        "健康：病弱,外伤,短命,三才善良才可平安。",
        "含义：散财破产运,因循姑切,犹如夜雨之花,薄弱散滹之象,虽有才能知识,意力不确定,诸事不能随行,"+
        kg+"外观幸福, 内多困苦, 表面依然成事, 里面不堪设想, 如果妇女有此数, 加上其他关系, 必逐茺凉。"};
    szhy[44] = new String[] {
        "(烦闷)--须眉难展有力量有限数。",
        "基业：文昌,数土,财库,财破,灾厄,凶吉。",
        "家庭：骨肉相连,兄弟不和,能忍则平和。",
        "健康：发狂,刑罚,病灾,烦闷,遭难,短命,先天五行为土者可望平安。",
        "含义：破家亡身的最恶数,暗隐惨淡之运,破坏,乱离之意,因此万事不能如意, 逆境, 烦闷, 劳苦, 患病,"+
        kg+"残疾, 遭难, 家属则生离死别, 或因其他运的关系而发狂, 短命但乱世出怪杰, 伟人, 烈士, 孝子,"+
        kg+"大发明家等, 往往出自此格数。"};
    szhy[45] = new String[] {
        "(顽风)--新生泰和万事如意数。",
        "基业：部将,君臣,文昌,学士,艺术。",
        "健康：可望圆满,子孙昌盛,三才不善者不寓,安康长寿,人格被克者不才。",
        "含义：顺风扬帆之象,经纬深,智谋大,可遂大志大业,克破万难而成功,富贵繁荣至极,"+
        kg+"但若与运的凶数结合, 即如浪里失舵船, 易遭灾难。"};
    szhy[46] = new String[] {
        "(浪里淘金)--须防复失的离祖破家数。",
        "基业：臣将,将星,学士,豪杰,文昌,凶厄,崩山。",
        "家庭; 亲多往且子孙宜迟, 三才善者可弥补。",
        "健康：刑罚,病弱,短命,外伤,暗伤,三才善者可望健。",
        "含义：载宝沉舟之象,乏力,薄弱,悲衰困难辛苦,破坏失败者多,然而属一类变怪的命运,"+
        kg+"有大艰难尝尽后而又成功者, 或依其他命运的关系, 致陷孤独刑罚, 病患短命等灾祸,"+
        kg+"总之是难免于不幸的命运。"};
    szhy[47] = new String[] {
        "(点石成金)--开花结果的权威进取数。",
        "基业：君臣,将星,文昌,学士,艺术,高傲,食禄,财库。",
        "家庭：家庭圆满,然时有争执,三才不善者和睦相处。",
        "健康：可望长寿,健康,三才不善者,也有病弱,短命的可能。",
        "含义：开花之象,祯祥吉庆之数,可离天成的幸福,与朋友歙和成大事业,真是进取可以攻,"+
        kg+"退可以守福禄于子孙的吉运。"};
    szhy[48] = new String[] {
        "(古松鹤)--德智兼备的出身清贵数。",
        "基业：将相,官禄,文昌,学士,文艺,财库。",
        "家庭：家庭圆满,子孙满堂,三才不善者不寓,",
        "健康：良好,可望长寿,三才不善者不寓,",
        "含义：才望谋略齐备,内含坚刚,为功利荣达的吉数,宜为人的顾问,威望洋洋,乃师数也。"};
    szhy[49] = new String[] {
        "(转变)--吉凶难分的不断辛苦数。",
        "基业：臣相,将星;文昌,智谋,学士,凶象,散财。",
        "健康：凶灾,病灾外伤,短命,三才不善者可补救,",
        "家庭：六亲得力,子自宜退。",
        "含义：处吉凶的岐路,吉临则吉又生大吉,凶来则凶又变大凶,所以成败不得失极其浩大。"+
        kg+"有处大凶而其他方面化吉者,其幸福与不幸,专靠三才配合的好坏,以及其他运的联系显现,"+
        kg+"多陷落于灾祸。"};
    szhy[50] = new String[] {
        "(小舟进海)--吉凶参半,需防倾覆数。",
        "基业：将官,文昌,财钱,灾祸,离愁,散财。",
        "家庭：亲属多而无助。",
        "健康：刑罚,杀伤,意外之灾,外伤,白痴,狂癫等疾。",
        "含义：成败之象,先得五字的数理庇荫,而成大业,享按富贵,后由盈数凡十谓之盈数的暗，"+
        kg+"而成陷失败, 亡身破于晚年, 凄惨至极, 若其他运又凶数者, 则是惨上加惨,杀伤,离秋,孤单频临,或至于刑罚。"};
    szhy[51] = new String[] {
        "(沉浮)--盛衰交加的竭力经营数。",
        "基业：文昌,学士,节度,时禄,劫煞,败退。",
        "家庭：时有争执,灾祸病患,三才善者安康自在。",
        "含义：一盛一衰之象,必然可得昌盛,搏得一时名利,然后发现运中自然的凶兆,到晚年出挫折困苦遂至失败。"};
    szhy[52] = new String[] {
        "(达眼)--先见之明,理想实现数,",
        "基业：医师,文昌,技艺,财库,官禄,财星。",
        "家庭：幸福,顺遂行孝,子女和睦,三才不善者不遇。",
        "健康：可望健康长寿,人格被克者不遇,",
        "含义：属于运将申之象,势能强大,无中生有之数,有先见之能,计划必成,眼能查实事,"+
        kg+"实现大志大业而名利双收, 是因为有光而成功。"};
    szhy[53] = new String[] {
        "(曲卷难星)--忧仇困苦。",
        "基业：伟人,学示,时禄,磨难,灾祸,劫煞。",
        "家庭：亲眷寡情,乏子息。",
        "健康：病灾,祸患,外伤,刑罚,三才善者或可谜补。",
        "含义：外观依然吉庆臻辉,内实祸患甚多,若非前半生不幸而后半生幸福,便是前半生富贵而后半生落魄,"+
        kg+"及盛衰参半的运数, 一旦陷入凶煞, 大多破家身亡, 即使的吉数他运相救, 亦仅得小安而已。"};
    szhy[54] = new String[] {
        "(石上灾花)--多难悲运的难望成功数。",
        "基业：文昌,技艺,凶灾,劫煞,时禄,灾祸。",
        "家庭：父母入过客,兄弟似残星,和睦相处,亦可无大过。"+
        "健康：",
        "含义：为大凶煞按示,悲惨不绝,不和损伤,忧闷频来,遂至倾家荡财,或患废疾,刑罚,短命横死孤独等。"};
    szhy[55] = new String[] {
        "善恶)--外美内恶的和顺不实数。",
        "基业：非官,技艺,文昌,学者,灾祸。",
        "家庭：亲眷忌,父母老病,尽心忠孝可天大过。",
        "健康：三才善者余则不过安康。",
        "含义：五数为最吉数,五上添五乃是最吉重叠,反而生凶相了,故表面颇为隆盛,,而内里则是灾祸叠生,"+
        kg+"凡事不能安心, 危难别离, 病难等无所不至因而是吉凶相办的运格, 志弱者绝无立身之地, 善能震雄威,"+
        kg+"坚心为业志, 打破万难也可能有成功之日。"};
    szhy[56] = new String[] {
        "(海里行舟)--初历尽困苦,四周障碍数。",
        "基业：豪杰,文昌,时禄,文艺,红艳,灾祸,伤身。",
        "家庭：不可靠亲的福,残嘣。",
        "健康：外伤,病难,维残,短命,三才善者可望安全。",
        "含义：缺乏实行的勇气,缺乏进取的精神,损失,灾祸等,是祸不单行者, 万事龆龃啮龃, 财力不足,"+
        kg+"乃是最大的运格。"};
    szhy[57] = new String[] {
        "(日照春松)--寒雪青松的最大运数。",
        "基业：官禄,文昌,学士,艺能,时禄,财库,进田。",
        "家庭：文田不严,时有冲突,三才善者,可得圆满。",
        "健康：自在,可望长寿,三才不善者睤。",
        "含义：寒岭春格,资格刚毅,获天赋之幸福而招致富贵,但这一生必遭大难一次,然后得享吉祥,繁荣,"+
        kg+"百事可以如意。"};
    szhy[58] = new String[] {
        "(晚行碰月)--先苦后甜,气宏扬堍数。",
        "基业：官禄,文昌,学士,技艺,灾厄,伤残。",
        "家庭：亲情少,兄弟离,须互相信任。",
        "健康：伤残,刑罚,外伤,三才善者可望平安。",
        "含义：浮沉多端,祸福无常,所得福分,必经大失败大患难篋蠓侥芟灾?家破产亡后方得富贵荣华,"+
        kg+"大都蔗根生甜,晚年享受安庆。"};
    szhy[59] = new String[] {
        "(寒蝉悲风)--须防外患的时运不济数。",
        "基业：官星,福星,文昌,智能,灾厄,伤残,财库,破厄。",
        "家庭; 亲情无缘, 子女背景离乡。",
        "健康：病患,短命,三才善者可望平安。",
        "含义：乏耐心缺勇气,意志衰退,无办事的才能,终于悲苦一生。"};
    szhy[60] = new String[] {
        "(无谋)--争名夺利,黑暗无光数。",
        "基业：官星,将星,文昌,智能,技艺灾厄,伤残。",
        "家庭：祖宗无基,亲友无情,兄弟无缘,三才善者可弥补。",
        "健康：外伤,病疫,短命等。",
        "含义：属晦冥黑暗,摇动不安的凶象,方向不喧尽任风波的运格,无谋不算而计划岂能成功,"+
        kg+"故难免失败苦恼或刑罚, 杀伤, 伤疾患, 短命等。"};
    szhy[61] = new String[] {
        "(牡凡寿蓉)--名利双收的修行积德数。",
        "基业：将文昌,贩运 艺,财库,财帛,破厄。",
        "家庭：自立成家,衣食富足。",
        "健康：可望长寿,安康,三才不良者无此数。",
        "含义：名利双收,繁荣富贵的吉数,无奈骄漫不逊,致酿成内外不和,家庭反目,兄弟离于墙,"+
        kg+"表面装表堂皇, 里面空虚, 如果能修德慎行, 切守和顺, 自可防于末然, 享天赋的幸福, 一生受尽祯祥。"};
    szhy[62] = new String[] {
        "(表败)--基根虚弱的艰困厄数。",
        "基业：国印,文昌,虚度,将星,技艺,訢三才善者可安全。",
        "家庭：分贵,骨肉分离。",
        "健康：伤残,外伤,刑罚,短命,灾厄,三才善者可安全。",
        "含义：内外不和,缺乏信用,志望难达,渐进衰败之境,意外灾祝频来,属身弱步步惨的数。"};
    szhy[63] = new String[] {
        "(舟归平海)--富贵荣华的身心安数。",
        "基业：官禄,将星,文星,艺能,财库,田宅,商工。",
        "家庭：子女多,顺川散敬爱,圆满之象。",
        "含义：万物承惠露而发育状大之状,属不费心神,万事如意,荣显可传子孙的最大吉数。"};
    szhy[64] = new String[] {
        "(非命)--骨肉分离,孤独悲恨数。",
        "基业：将星,学士,技艺,厄,破财,劫煞。",
        "家庭：一称多忧,妻子欠破。",
        "健康：水厄,利罚,病患,外伤 ,三才善者可平安。",
        "含义：此数为破坏,灭懑,沉滞的凶象,有意外灾祸袭来,或骨肉离散,或病患非命临身,人生逡得安心。"};
    szhy[65] = new String[] {
        "(大流归海)--富贵长亲的富笵。",
        "基业：臣君,将星,官禄,文昌,技艺,财库,田宅,时禄。",
        "家庭：祖业有根基,子孙昌杰,三才不善才无此数。",
        "健康：多施恩德则能益寿延年,安康自在。",
        "含义：天长地久,家庭隆昌,福寿棉长,事事成就,一生平安,多贵重的气运。"};
    szhy[66] = new String[] {
        "(岩头步马)--风外不和的多祸失福数。",
        "基业：将星,豪杰,灾厄,崩山,散财,破财。",
        "家庭：六亲冷淡不相投,兄弟远离。",
        "健康：刑罚,外伤,亡身,残伤,短命。",
        "含义：进退失自由,内外不和,艰难不堪,损伤灾祸交至, 大有家破灭亡的凶相。"};
    szhy[67] = new String[] {
        "(通达)--利路享通的坚强数。",
        "基业：君臣,将星,文昌,硕士,刚性,艺能,财库,进田。",
        "家庭：父母多荫,子女多考,圆满幸福, 三才不善者时有争执, 宜守和平。",
        "健康：安全,可望长寿,先天五行为大业, 三才不善者有时患呼吸器官疾病。",
        "含义：受长辈上级的援助,万事无障而达到目地,是天助的幸运,实现南望, 家道繁昌, 富贵好运数。"};
    szhy[68] = new String[] {
        "(顺风吹帆)--兴家立业的宽容好运数。",
        "基业：将相,学士,文昌,财帛,荣誉,暗禄,进田, 节度。",
        "家庭：幸福,三才不善者无此数。",
        "健康：良好,三才不善者的疾病。",
        "含义：智虑周全,志向坚定,勤勉力行,发展奋进之象, 有发明的才能, 集众信, 愿望发达, 名实而全的运数。"};
    szhy[69] = new String[] {
        "(非业)--坐立不安处世多难数。",
        "基业：将星,财帛,学士,文昌,技能,艺术,破厄,劫财。",
        "家庭：六亲不相投,兄弟难相处,不宜心直口快。",
        "健康：刑罚,外伤,病灾,伤残,天生五行为金者可望平安。",
        "含义：穷迫,滞塞,逆境之数,缺乏坚定信念,灾祸交至,摇动为安,致陷于短命,病疾或尝尽痛苦而死。"};
    szhy[70] = new String[] {
        "(残菊逢霜)--家庭衰退的晚景凄凉数。",
        "基业：官星, 学士, 文库, 巧星, 财库, 破厄, 劫禄。",
        "家庭：父母难当,兄弟无助,妻子宜尽。",
        "健康：病患,残疾,外伤,先天五行为金木者为健全。",
        "含义：险恶亡灭之象,一生惨淡,忧伤峭绝,有空虚寂寞之感,维免杀伤,残疾,刑罚,短命,离散等灾厄,不然便是世上无用之人。"};
    szhy[71] = new String[] {
        "(石上金花)--没有实质的磨神耐劳数。",
        "基业：技艺,文昌,学士,破厄,劫禄。",
        "家庭：时有争执, 宜守平和。",
        "健康：外伤,少些病患,三才善者安康。",
        "含义：备有生成的吉运,自应享受富贵福禄,无奈内心勒苦甚多,缺乏实行贯彻的精神,"+
        kg+"进取的勇气稀少致陷失败, 故称吉凶参半的运数。"};
    szhy[72] = new String[] {
        "(劳苦)--先甜后苦的万难忍受数。",
        "基业：技能,官禄,出乡,工商,学基,财帛,田宅,破厄。",
        "家庭：亲属冷淡,妻子宜迟。",
        "健康：可望健康,三才不善者无此数。",
        "含义：阴云遮月之象,快乐贫穷而兼之数,其前半世幸福,后半世凄惨,外观虽吉,内里生凶,"+
        kg+"甚至有晚年家破人亡者, 平素戒贪心, 可免陷困苦。"};

    }
    /**
     * "4、9、19、20、34、44这些数是最凶之数，且不可使用，凡查看有人有这样的数理，应及早改名，不然容易招来意外之祸，后悔莫及";
     * 数理吉凶
     */
    public static final String[] sljx = new String[80];
    static {
      sljx[3] = "首领之数：兼备智、仁、勇三德，具有立于上位，统率众人之能力；";
      sljx[4] = "为最凶六数之一，短命之数：祸劫临身，必陷于不幸；美貌之数：但性变屈，男女皆多色情之灾，或心劳烦闷不绝或本身赢弱；";
      sljx[5] = sljx[6]= "温和之数：性顺良和平，克集上下之信望，圆满之中权威辉煌；女德之数：含有中央之士德，备有妇德；";
      sljx[7] = sljx[8]= "刚情之数：外观虽是刚情，但内心柔弱神经过敏，此数多时易患肺及心脏之病，更容易诱发脚手之伤害；";
      sljx[9] =  "为最凶六数之一，短命之数：为最凶恶之短命数，祸劫临身，必陷于不幸；";
      sljx[10] = "短命之数：为最凶恶之短命数，祸劫临身，必陷于不幸；";
      sljx[11] = "温和之数：性顺良和平，克集上下之信望，圆满之中权威辉煌；";
      sljx[12] = "柔弱之数：表面虽是柔弱，但内心甚为刚情；美貌之数：但性变屈，男女皆多色情之灾，或心劳烦闷不绝或本身赢弱；易罹胃癌；";
      sljx[13] = "艺能之数：富于艺才，对于美术，艺道有上达之能力；";
      sljx[14] = "柔弱之数：表面虽是柔弱，但内心甚为刚情；美貌之数：但性变屈，男女皆多色情之灾，或心劳烦闷不绝或本身赢弱；艺能之数：富于艺才，对于美术，艺道有上达之能力；";
      sljx[15] = "女德之数：含有中央之士德，备有妇德；温和之数：性顺良和平，克集上下之信望，圆满之中权威辉煌；爱娇之数：女子富于爱娇之质；";
      sljx[16] = "首领之数：兼备智、仁、勇三德，具有立于上位，统率众人之能力；温和之数：性顺良和平，克集上下之信望，圆满之中权威辉煌；女德之数：含有中央之士德，备有妇德；";
      sljx[17] = "好色之数：男女多系性欲强大，妇女容易发生红杏出墙之事故；刚情之数：外观虽是刚情，但内心柔弱神经过敏，此数多时易患肺及心脏之病，更容易诱发脚手之伤害；";
      sljx[18] = "刚情之数：外观虽是刚情，但内心柔弱神经过敏，此数多时易患肺及心脏之病，更容易诱发脚手之伤害；";
      sljx[19] =  "为最凶六数之一，短命之数：为最凶恶之短命数，祸劫临身，必陷于不幸；爱娇之数：女子富于爱娇之质；";
      sljx[20] =  "为最凶六数之一，短命之数：为最凶恶之短命数，祸劫临身，必陷于不幸，易罹胃癌；破坏之数：大概有品性不良之倾向；";
      sljx[21] = "首领之数：兼备智、仁、勇三德，具有立于上位，统率众人之能力；好色之数：男女多系性欲强大，妇女容易发生红杏出墙之事故，且刑夫；寡妇之数：此系首领运，只适于男子，女子幼时病弱，若子嗣多惠者，夫妻之一方必早死亡；";
      sljx[22] = "美貌之数：但性变屈，男女皆多色情之灾，或心劳烦闷不绝或本身赢弱；柔弱之数：表面虽是柔弱，但内心甚为刚情；";
      sljx[23] = "首领之数：兼备智、仁、勇三德，具有立于上位，统率众人之能力；好色之数：男女多系性欲强大，妇女容易发生红杏出墙之事故；寡妇之数：此系首领运，只适于男子，女子幼时病弱，若子嗣多惠者，夫妻之一方必早死亡；";
      sljx[24] = "丰财之数：将白手可能获取巨财，财源广进；爱娇之数：女子富于爱娇之质；温和之数：性顺良和平，克集上下之信望，圆满之中权威辉煌；";
      sljx[25] = "爱娇之数：女子富于爱娇之质；";
      sljx[26] = "艺能之数：富于艺才，对于美术，艺道有上达之能力；好色之数：男女多系性欲强大，妇女容易发生红杏出墙之事故；";
      sljx[27] = "好色之数：男女多系性欲强大，妇女容易发生红杏出墙之事故；遭难之数：易受诽谤、遭难、刑罪或招生死离别之祸；";
      sljx[28] = "遭难之数：易受诽谤、遭难、刑罪或招生死离别之祸；";
      sljx[29] = "丰财之数：将白手可能获取巨财，掴取财力；艺能之数：富于艺才，对于美术，艺道有上达之能力；";
      sljx[31] = "首领之数：兼备智、仁、勇三德，具有立于上位，统率众人之能力；温和之数：性顺良和平，克集上下之信望，圆满之中权威辉煌；";
      sljx[32] = "丰财之数：将白手可能获取巨财，财帛裕如；温和之数：性顺良和平，克集上下之信望，圆满之中权威辉煌；柔弱之数：表面虽是柔弱，但内心甚为刚情；";
      sljx[33] = "首领之数：兼备智、仁、勇三德，具有立于上位，统率众人之能力；寡妇之数：此系首领运，只适于男子，女子幼时病弱，若子嗣多惠者，夫妻之一方必早死亡；丰财之数：将白手可能获取巨财，有意外之奇利；艺能之数：富于艺才，对于美术，艺道有上达之能力；好色之数：男女多系性欲强大，妇女容易发生红杏出墙之事故；";
      sljx[34] = "为最凶六数之一，短命之数：为最凶恶之短命数，祸劫临身，必陷于不幸；流血之数：财帛丰惠，具外交手腕，但因破灭之意浓厚，难免家庭的破灭，又一生必流大血一、两次也；";
      sljx[35] = "女德之数：含有中央之士德，备有妇德；温和之数：性顺良和平，克集上下之信望，圆满之中权威辉煌；";
      sljx[36] = sljx[40] = "破坏之数：大概有品性不良之倾向；";
      sljx[44] = "为最凶六数之一，短命之数：为最凶恶之短命数，祸劫临身，必陷于不幸；";

      sljx[43] = sljx[52] = "好色之数：男女多系性欲强大，妇女容易发生红杏出墙之事故；";
    }
  }
