package org.boc.db;

public class Xuank {
  /**
   * 壬子癸 丑艮寅 甲卯乙 辰巽巳 丙午丁 未坤申 庚酉辛 戌乾亥 1-24山的阴阳
   */
  public static final boolean[] s24yy = {false, true,false,false, false,true,true,
      true,false,false, false,true,true, true,false,false, false,true,true,
      true,false,false, false,true,true};
  /** 24山向  */
  public static final String[] s24name={" ",
      "壬山丙向","子山午向","癸山丁向", "丑山未向","艮山坤向","寅山申向",
      "甲山庚向","卯山酉向","乙山辛向", "辰山戌向","巽山乾向","巳山亥向",
      "丙山壬向","午山子向","丁山癸向", "未山丑向","坤山艮向","申山寅向",
      "庚山甲向","酉山卯向","辛山乙向", "戌山辰向","乾山巽向","亥山巳向",
  };
  /** 24方位 */
  public static final String[] s24name2={" ","壬","子","癸","丑","艮","寅","甲",
      "卯","乙","辰","巽","巳","丙","午","丁","未","坤","申","庚","酉","辛",
      "戌","乾","亥"};
  /** 24方位所属的元旦盘上的八卦，如1为坎，9为离卦 */
  public static final int[] s24Ofgua = {0,1,1,1, 8,8,8, 3,3,3, 4,4,4, 9,9,9, 2,2,2, 7,7,7, 6,6,6};
  //24方位对应的地、天、人元龙
  public static final int[] s24yl = {0, 1,3,2, 1,3,2, 1,3,2, 1,3,2, 1,3,2, 1,3,2, 1,3,2, 1,3,2};
  //24山兼向
  public static final int[] s24jianx = {0, 2,1,1, 7,7,9, 1,2,2, 6,6,6, 7,9,9, 2,2,1, 9,7,7, 6,6,6};
  //八卦地人天元龙
  public static final int[][] gua8yl = new int[10][4];
  //水口山之阴阳
  public static final boolean[] skyy = {false, true,true,true, false,false,true,
      true,false,true, true,false,false, false,true,false, false,true,true,
      false,false,false, true,true,false};
  //后天八卦顺时针转的次序
  public static final int[] guaCx = {1,8,3,4,9,2,7,6};
  //城门
  public static final String cmfh = "★"; //☆
  //八山向符号
  public static final String[][] fuhao = new String[10][3];
  public static final String[] jiux2 = {"","一白  贪狼","二黑  巨门","三碧  禄存",
      "四绿  文曲","五黄  廉贞","六白  武曲",
      "七赤  破军","八白  左辅","九紫  右弼"};
  public static final int[] jiux3 = {0,1,2,3,4,5,6,7,8,9};
  public static final String[] jiux = {"","一  贪","二  巨","三  禄",
      "四  文","五  廉","六  武","七  破","八  辅","九  弼"};
  public static final String[] jiux4 = {"","一","二","三","四","五","六","七","八","九"};
  public static final String[] jxws3 = {"","煞","煞","煞","退","旺","生","生","死","死"};
  public static final int[] jxws = {0, 3,3,3, 5, 1, 2,2, 4,4};
  public static final String[] jxws2 = {"","旺","生","煞","死","退"};
  public static final String[][] x2g = new String[10][10];
  public static final String[][] s2s = new String[10][10];
  public static final String[] jxms = {"",
      "一白为贪狼星，号文昌，为官星，为子星，为吉星，若其当旺，外亦有水光反照，为少年科甲，名播四海，生聪明智慧男儿。当其衰死，则为刑妻，夭亡飘荡，流血肾亏，为酒徒盗贼。",
      "二黑为巨门星，号为病符。当其旺，有田庄之富，人丁兴旺，又发武贵。当其衰死，则妇夺夫权，阴险鄙吝，难产腹病，为小人暗算，家人疾病丛生。",
      "三木为禄存星，因其性暴躁好斗，故号蛮尤。当其旺，财禄丰盈，兴家创业，贡监成名。长房大旺。当其衰死，疯魔哮喘，残足刑妻，是非官讼，或成盗贼。",
      "四绿木为文曲星。当其旺，为文章盖世，科甲联芳，女子容貌端妍，联婚贵族。当其衰死，疯哮血溢，妇女淫乱，男儿酒色破家，飘泊绝灭。",
      "五黄土为廉贞星，为戊已大煞。当其旺，大发财丁，当其衰，无论被其生或被其克，都为大凶，故宜静不宜动。若值太岁加临，凶性大发，即大损丁财，轻则灾病，重则连丧五人，宜避不宜犯。",
      "六白名为武曲星，是吉星。当其旺，权威震世，武将勋贵，巨富多丁。当其衰死，刑妻孤独，刀兵自缢，鳏夫自怜，寡妇守家。",
      "七赤又名破军，是为贼星，当其旺，发武权，丁财两旺，小房发福。当其衰，家出盗贼，或投军战死，牢狱口舌，火灾损丁，或出贪花恋酒之徒。七为凶星，宜静不宜动，动则凶相大露，尤其在路口、三叉之处，危害最烈。七赤若与外形环境相应，则有种种表现：外有葫芦之砂，家出医卜之人；外有刀盏之砂，家出屠沽之人；外有钳形之砂，家出工匠之人；外有旗鼓之砂，家出叛逆偷盗之徒；外有探头之砂，家出狐形鬼影；外有冲射又遇一六飞到，有服毒或吐血之人。",
      "八白又称左辅星，为吉星。当其旺，忠孝良义，富贵绵远，小房洪福。当其衰死，小口损伤，瘟皇膨胀。",
      "九紫火星为右弼星。当其旺，文章科第，骤至荣显，中房得贵。当其衰，回禄官灾，吐血疯癫，目疾难产。"};

  static{
    fuhao[1] = new String[]{"","┻","↑"};
    fuhao[2] = new String[]{"","┓","↙"};
    fuhao[3] = new String[]{"","┣","→"};
    fuhao[4] = new String[]{"","┏","↘"};
    fuhao[6] = new String[]{"","┛","↖"};
    fuhao[7] = new String[]{"","┫","←"};
    fuhao[8] = new String[]{"","┗","↗"};
    fuhao[9] = new String[]{"","┳","↓"};

    gua8yl[1] = new int[]{0, 1,3,2};     //坎  壬1 子2 癸3 其数对应24山序号
    gua8yl[2] = new int[]{0, 16,18,17};  //坤  未16 坤17 申18
    gua8yl[3] = new int[]{0, 7,9,8};     //震  甲7  卯8  乙9
    gua8yl[4] = new int[]{0, 10,12,11};  //巽  辰10 巽11 巳12
    gua8yl[6] = new int[]{0, 22,24,23};  //乾  戌22 乾23 亥24
    gua8yl[7] = new int[]{0, 19,21,20};  //兑  庚19 酉20 辛21
    gua8yl[8] = new int[]{0, 4,6,5};     //艮  丑4  艮5  寅6
    gua8yl[9] = new int[]{0, 13,15,14};  //离  丙13 午14 丁15

        s2s[1] = new String[]{"",
            "一一，比和。当其旺，利文才，利文职。当其衰，有血症之危，有酒淫之灾。",
            "一二，克入。当其旺，母患肠胃之病。当其衰，夫遭妇辱，主妇当权，家人易得肾泄之病。",
            "一三，生出。当其旺，长子得贵或利三木命人，大发丁财。当其衰，长房落败，或有官司牢狱之苦，或家出盗贼，或有肝足之病，或被迫迁居。",
            "一四，生出。当其旺，名扬科第，青云得路，外遇文笔之妙，便得登榜提名。当其衰，亦有考场登科，但贵而不富，或因贵而且淫荡。若外有土形之物，则出书腐，或妇无生育，或幼儿早夭。",
            "一五，克入。当其旺，可得财贵。当其衰，轻则阴处生疡，重则肾腰衰竭，食物中毒，中子早夭。",
            "一六，生入。当其旺，得先天生成，大发富贵，能启八代文章，若乾山得水，便有此应。当其衰，水冷金寒，易得头、骨之病或被金属所伤。",
            "一七，生入。当其旺，有桃花之运。易得财富。当其衰，金水多情，贪花恋酒，或因酒色而牢役徒流，或因口舌是非而被仇家刀伤，或因男女荒淫得性病。",
            "一八，克入。当其旺，小儿有溺水之险，家则文才得利。当其衰，妇犯不育，有耳病贫血之苦。或有子早夭。",
            "一九，克出。当其旺，水火既济，大利钱财，多子丁盛。当其衰，易犯风湿心病，夫妻反目，兄妹不和。 "};
        s2s[2] = new String[]{"",
            "二一，克出。当其旺，有地产之富，家旺丁盛，老母长康。当其衰，恶妇克夫，中男早亡，寡妇当家 ，多肠胃肾病。夫妻情薄，妇争夫权。",
            "二二，比和。当其旺，田财多富，武职利权。当其衰，阴神满地，女色淫荡，丹田气弱，老母多病，家丑丛生。在外则多有小人暗算。",
            "二三，克入。当其旺，老妇掌权，家财邪积，惟长子不肖。当其衰，男儿淫荡败家，妇人滞食腹病。二三为斗牛煞。主夫妻不和，妇被夫欺。家人博弈好饮，田园荒废，有出偷鸡摸狗之徒。",
            "二四，克入。当其旺，家嫂掌权，家旺多丁。当其衰，悍妇欺姑，男儿好色，外藏情妇。老母孤怜，或出家为尼。家人易得肠胃及股肱之病。家室阴暗，常有狐形鬼影，在外常有官非缠身，得风寒之病。",
            "二五，比和。当其旺，容易置业，财运颇好，尤其地产之业兴盛。当其衰，百病滋生，老妇病重，易出鳏夫。特别慢性肠胃病，重者得胃癌至死。",
            "二六，生出。当其旺，乾坤交泰，子女顺和，家业兴盛，成为行医济世之家，或成为武职权官。当其衰，则老父多病，家出僧尼，父子成仇，宾主争执，官非纠缠，家人常有头痛、情绪之病。",
            "二七，生出。当其旺，横财巨富，多产女丁。当其衰，母女多争，庶妾难投寡母之欢心。二七为先天火，易有火灾或血光之灾。家人常有泄痢之病，男儿常有异性纠缠，或因口舌是非而被刀伤。",
            "二八，比和。当其旺，田连阡陌，有地产之富。当其衰，常有小口之病。妇人有出家为尼之事。",
            "二九，生入。当其旺，文笔生辉，田财巨积。当其衰，阴神入室，男女淫荡，财富耗尽，且生愚钝之男。火炎土燥，易有血光之灾。阴气过重，世出寡妇。土伤睛目，世出瞽目之人。 "};
        s2s[3] = new String[]{"",
            "三一，生入。当其旺，长子得贵，大发丁财，科甲登榜。当其衰，长房落败，脾性暴躁，或因打斗而常惹官司获罪。或因邻里不和而搬迁而远行。运势多蹇滞碰黑，且易受四肢之伤。",
            "三二，克出。当其旺，得田庄地产之富，长子大发丁财。当其衰，即惹斗牛煞气。家庭不和，夫妻不睦。常因与上司争斗而惹官非。或因伤胃而停食，或因争斗而伤足。总之多劳碌奔波，阻碍破败。",
            "三三，比和。当其旺，盛气凌人，名声显赫，兴家立业，颇有财气。当其衰，家出盗贼，或被盗贼所劫，常有手足之伤，或与他人争斗而遭官。",
            "三四，比和。当其旺，三四正配，多生贵子，事业财运有正常发展。当其衰，家出盗贼与乞丐，出入常误事，身有风疹之疾，或股肱、四肢之伤，或有肝、胆之痛。若遇太岁，恐有色难或被蛇咬。",
            "三五，克出。当其旺，颇得财贵，或有官运。当其衰，身生风疹五毒，心起叛逆情绪，易得肝病足伤。",
            "三六，克入。当其旺，官场奔走，事业有成，成为上司的得力助手。当其衰，被官家所排，或遭刀兵之祸，或因跌扑、刀金而伤手足。或时有头鸣肝病。家人多有争执。",
            "三七，克入。当其旺，财源广进，有文臣而兼武将之权贵。当其衰，为穿心煞，会有手足及肝胆之病，病后而又遭官讼。兑方有破损，为肺损而吐血。家有酒淫之徒，偷扒之贼，败坏家门，闺帏不睦，常为长子遭殃。",
            "三八，克出。当其旺，为文才元魁，又发丁财。当其衰， 少子多灾，筋股易伤。或有被狗咬之厄。家中兄弟不和，或因争财产而惹官司。",
            "三九，生出。当其旺，雷奋而火尤明，有厅堂再焕之气，儿女聪明灵活，文才奇士，多年富贵。当其衰，官累不休，常患眼、头之病，并易有火险。"};
        s2s[4] = new String[]{"",
            "四一，生入，当其旺，凤池身贵，大利文才学业，连出科第，子女读书聪明成绩夺魁，兄长科甲登榜，业务顺遂，财运亨通。当其衰，易患中疯之疾，或漂泊淫荡，酒色腐败，家丑外传。或妇无生育，有育早夭。",
            "四二，克出。当其旺，颇有财贵，妇掌家权，多产多丁。当其衰，悍妇克母欺姑。家中阴气重重，阴神困扰，疯疾胃病缠身，姑嫂婆媳不睦，老母遭殃。事业衰败，家风丑陋，或有出家为尼，或为狂犬所伤。",
            "四三，比和。当其旺，阴阳正配，家境和睦，子儿顺和，颇得财贵，事业顺利。当其衰，夫妻反目，意向僧尼，出游荡不肖之子。身有风疹、股肱及四肢之疾。",
            "四四，比和。当其旺，文曲双星齐到，儿女成绩优异，喜逢 登科。大利文职书章，颇有声望。当其衰，漂泊四海，或成僧尼。风疾不断，寡妇当家。男儿离家出走，葬身于云水之中。",
            "四五，克出。当其旺，颇具文才物富，事业顺利。当其衰，疯疹不断，博弈好饮，园田荒废，家室阴暗，常狐形鬼影，主妇病缠，常向僧尼许愿，难生育儿女，家境败落。",
            "四六，克入，当其旺，兵军不侵，官以礼待，家境和气，颇具财禄。当其衰，父虐妻嫂，至使怜妇有悬梁之危，家庭争执甚多，家人有肝胆股肱之病。四六又为风疾驿马之状，故家人有远行搬迁或劳役之苦。",
            "四七，克入。当其旺，妇人主政，强悍过人，颇多积财。当其衰，阴神满地，男女贪淫，儿女文章不显，又遇呕血早夭。在外，诸多口舌，婆妈当市。易犯桃花之劫。",
            "四八，克出。当其旺，贤妇教子，颇积山林之财。当其衰，家人有山石之瘾，或入山林为隐士，或入寺为僧。儿女多病，学业不好，易患鼻炎。易患风疾，或被蛇、狗所咬。",
            "四九，生出。当其旺，合先天之金，颇得财贵，家出聪明之士，文章皎皎，颇得名声。当其衰，家嫂争权，妇人不和，易犯桃花之劫，常犯眼疾或火灾之厄。男士或有因奸破财之遇。 "};
        s2s[5] = new String[]{"",
            "五一，克出。当其旺，大发丁财，但中子不受。当其衰，中子遭殃，有大病缠身。尤其泌尿系统之病，女性为妇科病。家人亦百病不离。此外为耳病、疮癣、脓血之苦。",
            "五二，比和。当其旺，大发丁财，家母掌权。当其衰，百病丛生，尤其是父母病重，主要是肠胃之病。太岁加临，父当病死，母当寡妇。",
            "五三，克入。当其旺，大发丁财，尤为长男得福。当其衰，恐得肝脾之病，肢荫生毒疮疥癣。男儿有叛逆之心，家人有脚伤之病，一家不宁。",
            "五四，克入。当其旺，颇具文才物富，事业顺利。当其衰，男儿博弈好饮，田园荒芜。妇人生乳毒之疮，男人多生风疹。家室阴暗 ，常见狐形鬼影。家嫂意向为尼，家境落败。",
            "五五，比和。当其旺，丁财两旺，家业虽盛。当其衰，凶煞横行，无可挡避，必有血光之灾。轻者有脓血疮毒，重者连死数人。",
            "五六，生出。当其旺，颇得钱财，儿女孝顺，但家主不受。当其衰，家主得病，轻则头痛、骨痛，重则命厄。出外，必遇衰煞。为官诸多难题，甚至弄得焦头烂额。",
            "五七，生出。当其旺，颇得钱财，家业兴旺。当其衰，是非口舌、官非不断，或因淫荡而破财，或因女色而惹官。少女多病，家人口喉病。且易得刀斧之伤。",
            "五八，比和。当其旺，有田庄地产之富，儿女吉顺。当其衰，小男多病，大人筋骨酸痛。运气衰滞。",
            "五九，生入。当其旺，儿女聪明，财运颇好。当其衰，妇生愚钝之子，家人多有眼病，或有心闷头痛。若遇太岁，恐有血光之灾。"};
        s2s[6] = new String[]{"",
            "六一，生出。当其旺，得先天生成之数，官运亨通，财富丰盛，儿女科甲登榜。当其衰，官禄不退，但家人有头、颈、骨痛之病，或遇水患。",
            "六二，生入。当其旺，大发田财，堆金积玉，乾坤交泰，行医济世。当其衰，贪婪无厌，吝啬如鬼，或出家为僧尼，或夫妻反目分离。家人多有头、骨、肠胃之病痛。",
            "六三，克出。当其旺，财运官运很好，权威盖世。当其衰，或有兵刀之苦。或有头鸣伤足，或为父子不和，或有孝服穿戴之事。",
            "六四，克出。当其旺，得贸易市场之富、长途贩运之财，得派出之武官。当其衰，有克妻之暴，有劳役之苦，有妇不堪虐而悬梁之状。家人有股肱、头风之苦。",
            "六五，生入。当其旺，财运官运颇好，但小人却在暗算。当其衰，小人发难，丢官受弄，弄得焦头烂额。家主多病多灾，尤其头病，甚至神经失常，服毒自杀。",
            "六六，比和。当其旺，官运亨通，权登极位。当其衰，官非纠缠，难以脱身，或逃避远行，或暗算搬迁，或被刀徒追杀，破财损伤，或有交通意外，头伤骨折。",
            "六七，比和。当其旺，文官武迹，大权在手，财运亦好。当其衰，得交剑之煞，勾心斗角，互践沙泥。家中会有盗贼劫财。或因口舌而遭官非。家中老少不安，有头痛口喉之苦。",
            "六八，生入。当其旺，文职武权，功名利禄齐来，家业兴盛，子孙受荫。当其衰，官禄不减，但多有头、骨之病。",
            "六九，克入。当其旺，火照天门，丁财皆旺，家主贵寿且出聪明武将。当其衰，火烧天门，家出骂父之子。长房当败，必当火克金肺，吐血难支。火向天门，有鬼神指责，家出逆子，火盛必灾。"};
        s2s[7] = new String[]{"",
            "七一，生出。当其旺，武职升迁，儿女当行桃花之运，酒肉满盈，当其衰，水冷金寒，儿女贪花恋酒，钱财倾泻奔流，或背义忘恩。若遇太岁当值，招惹无限是非，或为贼所劫，或下腹疾病，或肺痨吐血，或为金属所伤，或徙流破败。",
            "七二，生入。当其旺，田财万贯，为官升迁，妇人称贵。家得二七先天之数，灯火辉煌，热闹兴旺。当其衰，当有回禄之灾，淫荡无度，阴神满地，妇人不和，少妾难求寡母之欢心。寡母当家，虐待少妇，造成服毒自杀，或因食物中毒，口病痢疾。",
            "七三，克出。当其旺，有文臣武将之权贵，出文韬武略之人，四方归服，子女出类拔萃。当其衰，对众施暴，子女横行，为劫为贼，家得穿心之煞，有遇刀伤兵惨之状。家出盗贼或遭贼劫。口舌是非，横遭官讼。家庭不和，儿女分离。酒肉淫荡，且病后又遭官。",
            "七四，克出。当其旺，妇人显贵，官禄两旺，并有桃花之运。当其衰，阴神满地，妇人当家，男女贪淫，当有桃花之劫。家中闺帏不睦，诸多口舌，婆妈当市，有兵刀之灾。于身体有呕血早夭之状。",
            "七五，生入。当其旺，有田财之富。当其衰，有口疾疮脓，口舌是非不断，并因之而遭官刑，且有桃花之劫。",
            "七六，比和。当其旺，文财武库，官禄双收。当其衰，交剑劫杀，官场争执、家庭不和，恐有刀剑之伤，车马之祸。于身体，有口疾，头痛或脓血之苦。",
            "七七，比和。当其旺，财权神助，大发横财。当其衰，劫贼入室。火灾临门。口舌是非、男女淫欲，招致桃花之劫，或色难遭官。",
            "七八，生入。当其旺，连连升官，财神助富，腰缠万贯，家庭和睦，子女康顺。当其衰，钱财易散，口生异物，少子少女多病。",
            "七九，生入。当其旺，火照厅堂，家室兴旺。当其衰，易有回禄之灾。七九之方遇一白飞到必有火灾。七九在向方，动则起火。九七在山方遇二黑和煞。不动亦起火。外部有红庙火型，难免瘟火。于身体，若遇五黄，则患血症。"};
        s2s[8] = new String[]{"",
            "八一，克出。当其旺，大利文才学业，利文职升迁。尤利地产置业。当其衰，易患贫血耳病，兄弟不和，伙人背逆，或妇人不育，或小儿溺水。",
            "八二，比和。当其旺，有田庄地产之富。当其衰，有肠胃之病，有小口损伤，或被犬咬伤。外有反背之砂，则会离乡背井，出家为尼，或客死他乡。",
            "八三，克入。当其旺，有地产之财，骤增权力，得先天生成之数，合作良好。其衰，破财伤官，削职丢权。在家小口四肢受伤，或有肝胃之苦。",
            "八四，克入。当其旺，主妇掌握，有地产田庄之富。当其衰，有小口之损，妇夺夫权，夫妻不和。在外，恐有车舟之祸。或为山林称高之隐士。",
            "八五，比和。当其旺，大发财禄。运势颇好。当其衰，破财损筋，小口病厄，运势破坏。有肠胃疾病之苦，或食物中毒。",
            "八六，生出。当其旺，发迹文权，尊荣不次，富贵福德。当其衰，双吉尤在，但有父子不和，头痛骨酸之病。",
            "八七，生出。当其旺，文职武权，财禄两得，夫妻和睦，儿女安康。当其衰，财产易散，夫妻成仇，少丁有损。",
            "八八，比和。当其旺，大利文才学业，大发田庄地产之富，双吉临门，事业兴旺。当其衰，业衰破财，常有肩骨酸痛之苦。",
            "八九，生入，当其旺，喜事重来，富堪敌国，位列朝班。当其衰，火炎土燥，鼻眼多疾，热腹便血，且有火灾之厄。"};
        s2s[9] = new String[]{"",
            "九一，克入。当其旺，家多喜庆，阴阳正配、水火既济，妇多产男儿，骤富骤贵。当其衰，中房败落，目疾耳鸣。若遇七到，恐有火灾。",
            "九二，生出。当其旺，有田庄地产之富，母管家业。当其衰，妇生愚子，火患庄园，火胃便血，有目疾肠胃之苦。",
            "九三，生入。当其旺，明灯厅堂，权登高位，威望四乡，儿女聪明得志。当其衰，恐有淫乱之劫、火灾之厄。男儿暴戾，名败四里。家人具有目疾、足伤之苦。",
            "九四，出入。当其旺，厅堂焕发，夫荣妻贵，儿女聪明，文才优异，财富骤积，喜事频来。当其衰，男女淫乱，身败名裂，事业破败，常有目疾、股腰之苦。子女淫荡无归。",
            "九五，生出。当其旺，有地产之富。当其衰，妇生愚钝之子。阴神满屋，生损目之子。外有破损之峰，子女名落孙山，家有目疾瞎眼之人，或有因色而生花柳疮毒之人。",
            "九六，克出。当其旺，文章显达，七八九相联，有八代文章之应。家主长寿安康，有武库之财。当其衰，火烧天门，遇鬼神指责，家出骂父逆子，或背父出家为僧。火克金肺，有吐血成痨之苦。",
            "九七，克出。当其旺，男女聪明伶俐，横财就手。当其衰，男女花酒淫欲，家有回禄之灾。财产散尽，有成痨瘵，九七为先后天火，终有火灾、官灾之日。",
            "九八，生出。当其旺，有田庄地产之富，有文职升迁之官， 家中吉事频来。当其衰，火炎土燥，妇生愚子。家人或有眼疾、火胃之苦。",
            "九九，比和。当其旺，文章显达，名列四海，家厅辉煌，骤发丁财。当其衰，妇多产女儿，男女好色，龟公鸨母。家中出眼疾瞎目之人。居屋易有血光之灾。"};

        x2g[1] = new String[]{"",
            "一白到坎方，经云：一白为官星之应，主宰主章。主读书聪明，利文职。",
            "一白到坤方，主女性当权，家人易患肠胃病。",
            "一白到震方，主家人搬迁或者远行，脾气较为暴躁。",
            "一白到巽方，经云：四一同宫，准发科名之显。",
            "一白到中宫，经云：一加二五，伤及壮丁，主疾病。",
            "一白到乾方，主聪明才智，发小财。",
            "一白到兑方，家人好动，多异性缘，一白当运，为桃花运，失运为桃花劫。",
            "一白到艮方，财运佳，尤利地产，可置业。",
            "一白到离方，中爻得配，水火相交，主喜庆，顺利。"};
        x2g[2] = new String[]{"",
            "二黑到坎方，主家人易患肠胃病，女性当权，掌握财政。",
            "二黑到坤方，二黑又名病符，回宫复位，主身体疾病。",
            "二黑到震方，主官灾是非，足患，肠胃病。",
            "二黑到巽方，主是非，健康差，呼吸系统疾病。",
            "二黑到中宫，血光之灾，慢性病。",
            "二黑到乾方，当运旺财，失运神经衰弱，胡思乱想。",
            "二黑到兑方，肚疴，提防火灾，血光之灾。",
            "二黑到艮方，旺财，尤利地产。",
            "二黑到离方，家人愚钝，血光之灾。"};
        x2g[3] = new String[]{"",
            "三碧到坎方，主脾气暴躁，家人搬迁或者远行。疾病。",
            "三碧到坤方，主官灾是非，肠胃病，足病。",
            "三碧到震方，经云：蚩尤碧色，好勇斗狠之神。三碧是蚩尤星，主官灾是非，争执。",
            "三碧到巽方，运气反复，时好时坏。",
            "三碧到中宫，因财致祸，脚伤。",
            "三碧到乾方，经云：足以金而蹒跚。主伤足，家人容易发生争执。",
            "三碧到兑方，主血光之灾，受人伤累。",
            "三碧到艮方，经云：三八逢而损小口。主不利小孩。",
            "三碧到离方，主家人头脑灵活，聪明"};
        x2g[4] = new String[]{"",
            "四绿到坎方，坎宫为一白星所主，故为一四同宫，主读书聪明，利文职。",
            "四绿到坤方，肠胃病，是非缠绕。",
            "四绿到震方，运气反复，情绪起伏。",
            "四绿到巽方，经云：盖四绿为文昌之神。主聪明。",
            "四绿到中宫，风湿病，皮肤病。",
            "四绿到乾方，为利女性，驿马位，家人有搬迁或者远行。",
            "四绿到兑方，容易被金属所伤，易惹桃花。",
            "四绿到艮方，儿童多病或成绩退步，鼻敏感症。",
            "四绿到离方，读书聪明，利文职，有喜庆。失运则财帛不聚。"};
        x2g[5] = new String[]{"",
            "五黄到坎方，主伤病，提防泌逆系统疾病，女主提防妇科病。",
            "五黄到坤方，主急性病，血光之灾。",
            "五黄到震方，容易脚伤，因财致祸。",
            "五黄到巽方，主皮肤病，疮毒。",
            "五黄到中宫，主血光之灾，疮毒。",
            "五黄到乾方，头部疾病，远行多阴滞，身体多病。",
            "五黄到兑方，是非官灾，容易被金属所伤。",
            "五黄到艮方，主肠胃病，运气骞滞。",
            "五黄到离方，眼疾，血光之灾。"};
        x2g[6] = new String[]{"",
            "六白到坎方，主聪明才智，发小财。",
            "六白到坤方，胡思乱想，神经衰弱，当运则发财。",
            "六白到震方，主足疾，多小人。",
            "六白到巽方，不利女性，奔波劳碌。",
            "六白到中宫，远行多阻滞，头部疾病。",
            "六白到乾方，驿马运，有远行。失运主官非或交通意外。",
            "六白到兑方，提防被金属所伤。",
            "六白到艮方，发小财，利地产或五金业。",
            "六白到离方，子女易与自己发生争执，提防呼吸系统毛病。"};
        x2g[7] = new String[]{"",
            "七赤到坎方，家人好动，桃花运。",
            "七赤到坤方，主痢疾，提防火灾，血光之灾。",
            "七赤到震方，主血光之灾，受人拖累，破财，宜房风水轮化解。",
            "七赤到巽方，容易被金属所伤，易犯桃花劫。",
            "七赤到中宫，是非官灾，容易被金属所伤。",
            "七赤到乾方，提防被金属所伤，又主官非争执，交通意外等。",
            "七赤到兑方，当运主发财，失运主血光之灾。",
            "七赤到艮方，财物可得，但容易破耗。",
            "七赤到离方，小心火灾，家中女性不和。"};
        x2g[8] = new String[]{"",
            "八白到坎方，主财运佳，尤利地产，可置业。",
            "八白到坤方，利地产，旺财。",
            "八白到震方，主不利儿童，成绩退步。",
            "八白到巽方，儿童多病或成绩退步，鼻敏感症。",
            "八白到中宫，主肠胃病，运气滞骞。",
            "八白到乾方，发小财，利地产及五金行业。",
            "八白到兑方，财帛可得，但容易破耗。",
            "八白到艮方，当运发财，利产。失运破财。",
            "八白到离方，主喜庆，有令人愉快的事情发生。"};
        x2g[9] = new String[]{"",
            "九紫到坎方，水火既济，主喜庆，顺利。",
            "九紫到坤方，家人愚钝，子女成绩退步。",
            "九紫到震方，家人头脑灵活，子女读书聪明。",
            "九紫到巽方，读书聪明，利文职，有喜庆。",
            "九紫到中宫，目疾，血光之灾，皮肤病。",
            "九紫到乾方，子女易与自己发生争执，提防呼吸系统毛病。",
            "九紫到兑方，小心火灾，家中女性不和。",
            "九紫到艮方，常有令人意想不到的好事，如喜事，横财。",
            "九紫到离方，当运财运与事业运均佳，失运主血光之灾。"};
  }
}