package org.boc.db;

public class ZiWei {
  public static final String[] xName = {"","紫微","天机","太阳","武曲","天同","廉贞",
      "天府","太阴","贪狼","巨门","天相","天梁","七杀","破军",
      "禄存","擎羊","陀罗","天魁","天钺","禄","权","科","忌","天福","截空","天官",
      "天马","火星","铃星","天哭","天虚","孤辰","寡宿","劫煞","华盖","咸池","红鸾","天喜","破碎","蜚廉","天才","天寿","龙池","凤阁",
      "旬空",
      "左辅","右弼","天刑","天姚","天月","阴煞","解神","天巫",
      "三台","八座","恩光","天贵",
      "文昌","文曲","天空","地劫","台辅","封诰",
      "天伤","天使",
      "地空"};
  public static final String[] zxdjName = {"","庙","旺","地","利","平","不","陷"};
  public static final String[] df = {"中天",
      "北一","北二","北三","北四","北五","北六","北七",
      "南一","南二","南三","南四","南五","南六","南七",
      "北助","南助"};
  public static final String[] xx = {"紫微星系","天府星系","命12宫星系",
      "年干星系","年支星系","年柱星系","月柱星系","日柱星系","时柱星系"};
  public static final String[] yy = {"阴","阳","阴阳",""};
  public static final String[] jx = {"","吉","凶"};
  public static final String[] hua = {"","帝座","善","贵","财","福"
      ,"囚","贤能","富","桃花","暗","印","荫","将星","耗","爵禄"
      ,"刑","忌","阳贵","阴贵","杀","助力","科甲"};

  public static final int[][] xProp = new int[100][6];
  //0阴1阳2阴阳，1金2木3水4火5土12金木...，1吉2凶。
  static {
    xProp[1] = new int[]{0,0,5,1,1,0};
    xProp[2] = new int[]{10,0,2,2,1,0};
    xProp[3] = new int[]{0,1,4,3,1,0};
    xProp[4] = new int[]{6,0,1,4,1,0};
    xProp[5] = new int[]{11,1,3,5,1,0};
    xProp[6] = new int[]{5,0,24,6,2,0};
    xProp[7] = new int[]{8,1,5,7,1,0};
    xProp[8] = new int[]{0,0,3,8,1,0};
    xProp[9] = new int[]{1,1,32,9,2,0};
    xProp[10] = new int[]{2,0,31,10,2,0};
    xProp[11] = new int[]{12,1,3,11,1,0};
    xProp[12] = new int[]{9,1,5,12,1,0};
    xProp[13] = new int[]{13,2,41,13,2,0};
    xProp[14] = new int[]{7,0,3,14,2,0};
    xProp[15] = new int[]{3,0,5,15,1,0};
    xProp[16] = new int[]{15,1,41,16,2,3};
    xProp[17] = new int[]{15,0,1,17,2,3};
    xProp[18] = new int[]{16,1,4,18,1,3};
    xProp[19] = new int[]{16,0,4,19,1,3};
    xProp[20] = new int[]{0,0,5,0,1,3};
    xProp[21] = new int[]{0,1,2,0,1,3};
    xProp[22] = new int[]{0,1,3,0,1,3};
    xProp[23] = new int[]{0,1,3,0,2,3};
    xProp[24] = new int[]{0,1,5,0,1,3};
    xProp[25] = new int[]{0,3,4,0,2,3};
    xProp[26] = new int[]{0,1,5,0,1,3};
    xProp[27] = new int[]{0,1,4,0,1,4};
    xProp[28] = new int[]{16,1,4,20,2,4};
    xProp[29] = new int[]{16,0,4,20,2,4};
    xProp[30] = new int[]{0,1,41,0,2,4};
    xProp[31] = new int[]{0,0,45,0,2,4};
    xProp[32] = new int[]{0,1,4,0,2,4};
    xProp[33] = new int[]{0,0,4,0,2,4};
    xProp[34] = new int[]{0,0,4,0,2,4};
    xProp[35] = new int[]{0,1,2,0,2,4};
    xProp[36] = new int[]{0,0,3,0,2,4};
    xProp[37] = new int[]{0,0,3,0,1,4};
    xProp[38] = new int[]{0,1,3,0,1,4};
    xProp[39] = new int[]{0,0,4,0,2,4};
    xProp[40] = new int[]{0,3,4,0,2,4};
    xProp[41] = new int[]{0,0,2,0,1,4};
    xProp[42] = new int[]{0,1,5,0,1,4};
    xProp[43] = new int[]{0,1,3,0,1,4};
    xProp[44] = new int[]{0,1,5,0,1,4};
    xProp[45] = new int[]{0,3,4,0,2,3};
    xProp[46] = new int[]{15,1,5,21,1,6};
    xProp[47] = new int[]{15,0,3,21,1,6};
    xProp[48] = new int[]{0,1,4,0,2,6};
    xProp[49] = new int[]{0,0,3,0,2,6};
    xProp[50] = new int[]{0,3,0,0,2,6};
    xProp[51] = new int[]{0,3,0,0,2,6};
    xProp[52] = new int[]{0,3,0,0,1,6};
    xProp[53] = new int[]{0,3,0,0,1,6};
    xProp[54] = new int[]{0,1,5,0,1,6};
    xProp[55] = new int[]{0,0,5,0,1,6};
    xProp[56] = new int[]{0,1,4,0,1,7};
    xProp[57] = new int[]{0,1,5,0,1,7};
    xProp[58] = new int[]{14,2,1,22,1,8};
    xProp[59] = new int[]{4,0,3,22,1,8};
    xProp[60] = new int[]{0,0,4,0,2,8};
    xProp[61] = new int[]{0,1,4,0,2,8};
    xProp[62] = new int[]{0,1,5,0,1,8};
    xProp[63] = new int[]{0,0,5,0,1,8};
    xProp[64] = new int[]{0,1,4,0,2,2};
    xProp[65] = new int[]{0,0,4,0,2,2};
  }

  /**
   * 主星在12地支之等级表
   */
  public static final int[][] zxdj = new int[100][13];
  static {
    zxdj[1] = new int[]{0,1,1,2,2,3,2,1,1,2,2,3,2};
    zxdj[2] = new int[]{0,1,7,3,2,4,5,1,7,3,2,4,5};
    zxdj[3] = new int[]{0,7,7,1,1,2,2,2,3,3,5,7,7};
    zxdj[4] = new int[]{0,2,1,3,4,1,5,2,1,3,4,1,5};
    zxdj[5] = new int[]{0,2,7,4,1,5,1,7,7,2,7,5,1};
    zxdj[6] = new int[]{0,5,4,1,5,4,7,5,4,1,5,4,7};
    zxdj[7] = new int[]{0,1,1,1,3,1,3,2,1,3,2,1,3};
    zxdj[8] = new int[]{0,1,1,7,7,7,7,6,6,4,2,2,1};
    zxdj[9] = new int[]{0,2,1,3,4,1,7,2,1,3,4,1,7};
    zxdj[10] = new int[]{0,2,6,1,1,5,2,2,6,1,1,5,2};
    zxdj[11] = new int[]{0,1,1,1,7,3,3,1,3,1,7,3,3};
    zxdj[12] = new int[]{0,1,2,1,1,1,7,1,2,7,3,1,7};
    zxdj[13] = new int[]{0,2,1,1,2,1,5,2,1,1,2,1,5};
    zxdj[14] = new int[]{0,1,2,3,7,2,5,1,2,3,7,2,5};
    zxdj[15] = new int[]{0,1,0,1,1,0,1,1,0,1,1,0,1};
    zxdj[16] = new int[]{0,7,1,0,7,1,0,7,1,0,7,1,0};
    zxdj[17] = new int[]{0,0,1,7,0,1,7,0,1,7,0,1,7};
    zxdj[28] = new int[]{0,0,3,1,4,0,0,0,0,0,3,1,0};
    zxdj[29] = new int[]{0,0,3,1,4,0,0,0,0,0,3,1,0};
    zxdj[58] = new int[]{0,3,1,7,4,3,1,7,4,3,1,7,4};
    zxdj[59] = new int[]{0,3,1,7,2,3,1,7,2,3,1,7,2};
  }

  /**
   * 各星的星等与阴阳序号皆以此为准
   * 紫微星系--6/6 紫微1、天机2、太阳3、武曲4、天同5、廉贞6
   * 天府星系--8/14 天府7、太阴8、贪狼9、巨门10、天相11、天梁12、七杀13、破军14
   * 年干星系--12/26 禄存15 擎羊16 陀罗17 天魁18 天钺19 化禄20 化权21 化科22 化忌23 天福24 截空25 天官26
   * 年支星系--18/44 天哭30 天虚31 孤辰32 寡宿33 劫煞34 华盖35 咸池36 红鸾37 天喜38 破碎39 蜚廉40 天才41 天寿42 龙池43 凤阁44
   * 年上星系--1/45 旬空45
   * 月星系--8/53 天马27 左辅46 右弼47 天刑48 天姚49 天月50 阴煞51 解神52 天巫53
   * 日星系--4/57 三台54 八座55 恩光56 天贵57
   * 时星系--6/63 文昌58 文曲59 天空60 地劫61 台辅62 封诰63 地空66 火星28 铃星29
   * 宫星系--2/65 天伤64 天使65
   */
  /**
  public static final String[] zwxx = {"","紫微","天机","太阳","武曲","天同","廉贞"};
  public static final String[] tfxx = {"","天府","太阴","贪狼","巨门","天相","天梁",
      "七杀","破军"};
  public static final String[] ngxx = {"","禄存","擎羊","陀罗","天魁","天钺","化禄",
      "化权","化科","化忌","天福","截空","天官"};
  public static final String[] nzxx = {"","天马","火星","铃星","天哭","天虚","孤辰",
      "寡宿","劫煞","华盖","咸池","红鸾","天喜","破碎","蜚廉","天才","天寿","龙池","凤阁"};
  public static final String[] yxx = {"","左辅","右弼","天刑","天姚","天月","阴煞",
      "解神","天巫"};
  public static final String[] rxx = {"","三台","八座","恩光","天贵"};
  public static final String[] sxx = {"","文昌","文曲","天空","地劫","台辅","封诰"};
  public static final String[] gxx = {"","天伤","天使"};
  **/

  public static final String[] mg121 = {"","命宫","兄弟","夫妻","子女","财帛",
      "疾厄","迁移","奴仆","官禄","田宅","福德","父母"};
  public static final String[] mg12 = {"","命★宫","兄弟宫","夫妻宫","子女宫","财★帛",
      "疾厄宫","迁★移","奴仆宫","官★禄","田宅宫","福德宫","父母宫"};
  public static final String[] bs12 = {"","博士","力士","青龙","小耗","将军","奏书",
      "飞廉","喜神","病符","大耗","伏兵","官府"};
  public static final String[] cs12 = {"","长生","沐浴","冠带","临官","帝旺","  衰",
      "  病","  死","  墓","  绝","  胎","  养"};
  public static final String[] ts12 = {"","岁建","晦气","伤门","贯索","官符","小耗",
      "大耗","龙德","白虎","天德","吊客","病符"};
  public static final String[] lnxx = {"","流昌","流禄","流擎","流陀","流马","流劫",
      "流灾","流岁","流天","流月","流解"};
  public static final String[] wxjName = {"","","水二局","木三局","金四局","土五局","火六局"};
}
