package org.boc.dao.sz;

import org.boc.db.SiZhu;

public class DaoSiZhuCanKao {
  /**
   * 由日主干支和出身月份简单描述，此为参考信息
   * @return
   */
  public String sijiDescCankao() {
    String s = null;

    switch(SiZhu.yz){
      case 3:
        if(SiZhu.rg==1 || SiZhu.rg==2){
          s = "春初木嫩，余寒犹存，喜火温煖，则无盘屈之患；藉水资扶，而有舒畅之美。不宜水盛，阴浓湿重，则根损枝枯；又不可无水，阳气烦燥，则根干叶萎。须水火既济方佳。土多则损力，土薄则丰。忌逢金重，克伐伤残。";
        }else if(SiZhu.rg==3 || SiZhu.rg==4){
          s = "火明木秀，母旺子相，势力并行。喜木生扶，不宜过旺，旺则火炎；欲水既济，不宜太多，多则火灭。土多则晦光，火盛则燥烈。见金可以施功，纵重见财富犹遂。";
        }else if(SiZhu.rg==5 || SiZhu.rg==6){
          s = "余寒犹存，其势孤虚。喜火生扶，恶木太过；忌水泛滥，喜土比助。得金而制木为祥，金多则仍盗土气。";
        }else if(SiZhu.rg==7 || SiZhu.rg==8){
          s = "木嫩金寒，贵乎火气为荣；体弱性柔，宜得厚土为辅。水盛增寒，失锋锐之势；木旺损力，有剉钝之危。金来比助，扶持最妙，比而无火，失类非良。";
        }else{
          s = "其势稍寒。再逢水助，必有崩堤之势；若加土盛，则无泛涨之忧。喜金生扶，不宜金盛；欲火既济，不宜火炎。见木而可施功，无土仍愁散漫。";
        }
        break;
      case 4:
      if(SiZhu.rg==1 || SiZhu.rg==2){
        s = "木旺当令，余寒犹存，喜火温煖，则无盘屈之患；藉水资扶，而有舒畅之美。不宜水盛，阴浓湿重，则根损枝枯；又不可无水，阳气烦燥，则根干叶萎。须水火既济方佳。土多则损力，土薄则丰。忌逢金重，克伐伤残。";
      }else if(SiZhu.rg==3 || SiZhu.rg==4){
        s = "木火通明，母旺子相，势力并行。喜木生扶，不宜过旺，旺则火炎；欲水既济，不宜太多，多则火灭。土多则晦光，火盛则燥烈。见金可以施功，纵重见财富犹遂。";
      }else if(SiZhu.rg==5 || SiZhu.rg==6){
        s = "其势孤虚。喜火生扶，恶木太过；忌水泛滥，喜土比助。得金而制木为祥，金多则仍盗土气。";
      }else if(SiZhu.rg==7 || SiZhu.rg==8){
        s = "木坚金碎，余寒未尽，贵乎火气为荣；体弱性柔，宜得厚土为辅。水盛增寒，失锋锐之势；木旺损力，有剉钝之危。金来比助，扶持最妙，比而无火，失类非良。";
      }else{
        s = "性滥滔淫。再逢水助，必有崩堤之势；若加土盛，则无泛涨之忧。喜金生扶，不宜金盛；欲火既济，不宜火炎。见木而可施功，无土仍愁散漫。";
      }
      break;
    case 5:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "尚有余气，喜火温煖，则无盘屈之患；藉水资扶，而有舒畅之美。不宜水盛，阴浓湿重，则根损枝枯；又不可无水，阳气烦燥，则根干叶萎。须水火既济方佳。土多则损力，土薄则丰。忌逢金重，克伐伤残。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "湿土晦光，喜木生扶，不宜过旺，旺则火炎；欲水既济，不宜太多，多则火灭。土多则晦光，火盛则燥烈。见金可以施功，纵重见财富犹遂。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "得令当权。喜火生扶，恶木太过；忌水泛滥，喜土比助。得金而制木为祥，金多则仍盗土气。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "母旺子相，贵乎火气为荣；体弱性柔，宜得厚土为辅。水盛增寒，失锋锐之势；木旺损力，有剉钝之危。金来比助，扶持最妙，比而无火，失类非良。";
      }
      else {
        s = "能够蓄水。再逢水助，必有崩堤之势；若加土盛，则无泛涨之忧。喜金生扶，不宜金盛；欲火既济，不宜火炎。见木而可施功，无土仍愁散漫。";
      }
      break;
    case 6:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "长于夏令，木从火势，根干叶枯，欲得水盛，而成滋润之功，切忌火旺，而招自焚之患。土宜其薄，不可厚重，厚重反为灾咎；金忌其多，不可欠缺，欠缺不能斩削。重重佳木，徒以成林；叠叠逢华，终无结果。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "乘旺秉权，逢水制则免自焚之咎，见木助必招夭折之忧。遇金必作良工，得土遂成稼穑。然金土虽为美利，无水则金燥土焦，再加木助，势必倾危。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "土荣夏令，其势燥烈。得水滋润成功，忌火煅炼焦坼。木助火炎，生克不取；金生水泛，妻财有益。见比助则蹇滞不通，如太过又宜木袭。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "火生金绝，尤为柔弱，形质未备，更嫌死绝。火多不厌，水润呈祥。见木助鬼伤身，遇金扶持精壮。土薄最为有用，土厚埋没无光。";
      }
      else {
        s = "执性归源，时当涸际，欲得比肩。喜金生助体，忌火旺太炎。木盛则泄其气，土旺则制其流。";
      }
      break;
    case 7:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "长于夏令，根干叶枯，欲得水盛，而成滋润之功，切忌火旺，而招自焚之患。土宜其薄，不可厚重，厚重反为灾咎；金忌其多，不可欠缺，欠缺不能斩削。重重佳木，徒以成林；叠叠逢华，终无结果。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "得令当权，旺之极矣。逢水制则免自焚之咎，见木助必招夭折之忧。遇金必作良工，得土遂成稼穑。然金土虽为美利，无水则金燥土焦，再加木助，势必倾危。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "火炎土燥。得水滋润成功，忌火煅炼焦坼。木助火炎，生克不取；金生水泛，妻财有益。见比助则蹇滞不通，如太过又宜木袭。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "烈火熔金，尤为柔弱，形质未备，更嫌死绝。火多不厌，水润呈祥。见木助鬼伤身，遇金扶持精壮。土薄最为有用，土厚埋没无光。";
      }
      else {
        s = "执性归源，时当涸际，欲得比肩。喜金生助体，忌火旺太炎。木盛则泄其气，土旺则制其流。";
      }
      break;
    case 8:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "其势燥烈，根干叶枯，欲得水盛，而成滋润之功，切忌火旺，而招自焚之患。土宜其薄，不可厚重，厚重反为灾咎；金忌其多，不可欠缺，欠缺不能斩削。重重佳木，徒以成林；叠叠逢华，终无结果。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "其势犹存。逢水制则免自焚之咎，见木助必招夭折之忧。遇金必作良工，得土遂成稼穑。然金土虽为美利，无水则金燥土焦，再加木助，势必倾危。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "得令当旺。得水滋润成功，忌火煅炼焦坼。木助火炎，生克不取；金生水泛，妻财有益。见比助则蹇滞不通，如太过又宜木袭。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "燥土难生，尤为柔弱，形质未备，更嫌死绝。火多不厌，水润呈祥。见木助鬼伤身，遇金扶持精壮。土薄最为有用，土厚埋没无光。";
      }
      else {
        s = "燥土克之，其势弱极。喜金生助体，忌火旺太炎。木盛则泄其气，土旺则制其流。";
      }
      break;
    case 9:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "秋木凋零，初秋火气未除，犹喜水土以相滋；木盛有多材之美，土厚无任才之能。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "性息体休。得木生，则有复明之庆；遇水克，难免损灭之灾。土重而掩息其光，金多而损伤其势。火见木以光辉，纵叠见而有利。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "子旺母衰。金多而耗盗其气，木盛须制伏纯良。火重重而不厌，水泛泛而非祥。得比肩则能助力，至霜降不比无妨。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "得令当权。火来煅炼，遂成钟鼎之材；土多培养，反有顽浊之气。见水则精神越秀，逢木则斩削施威。金助愈刚，过刚则折；气重愈旺，旺极则衰。";
      }
      else {
        s = "秋水通源，母旺子相。得金助则清纯，逢土旺则混浊。火多而财盛，木重而身荣。重重见水，增其泛监之忧；叠叠见上，始得清平之意。";
      }
      break;
    case 10:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "金锐秉权，秋木休囚，然秋果已成实，欲得刚金之修削。木盛有多材之美，土厚无任才之能。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "性息体休。得木生，则有复明之庆；遇水克，难免损灭之灾。土重而掩息其光，金多而损伤其势。火见木以光辉，纵叠见而有利。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "子旺母衰。金多而耗盗其气，木盛须制伏纯良。火重重而不厌，水泛泛而非祥。得比肩则能助力，至霜降不比无妨。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "当令乘权。火来煅炼，遂成钟鼎之材；土多培养，反有顽浊之气。见水则精神越秀，逢木则斩削施威。金助愈刚，过刚则折；气重愈旺，旺极则衰。";
      }
      else {
        s = "秋水通源，母旺子相。得金助则清纯，逢土旺则混浊。火多而财盛，木重而身荣。重重见水，增其泛监之忧；叠叠见上，始得清平之意。";
      }
      break;
    case 11:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "休囚至极，然秋果已成实，欲得刚金之修削。因寒露后又喜火炎，火炎则木实；霜降后则不宜水盛，水盛则木漂。木盛有多材之美，土厚无任才之能。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "其势休囚。得木生，则有复明之庆；遇水克，难免损灭之灾。土重而掩息其光，金多而损伤其势。火见木以光辉，纵叠见而有利。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "得令当权。金多而耗盗其气，木盛须制伏纯良。火重重而不厌，水泛泛而非祥。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "余气尚存。火来煅炼，遂成钟鼎之材；土多培养，反有顽浊之气。见水则精神越秀，逢木则斩削施威。金助愈刚，过刚则折；气重愈旺，旺极则衰。";
      }
      else {
        s = "燥土克之，其势弱极。得金助则清纯，逢土旺则混浊。火多而财盛，木重而身荣。重重见水，增其泛监之忧；叠叠见上，始得清平之意。";
      }
      break;
    case 12:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "木凋水寒，盘屈在地，欲土多以培养，恶水盛而忘形。金纵多，克伐无害；火重见，温燠有功。归根复命之时，木病安能辅助？须忌死绝之地，只宜生旺之方。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "体绝形亡。喜木生而有救，遇水克以为殃。欲土制为荣，爱火比为利。见金则难任为财，无金则不遭磨折。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "水寒土冻，外寒内温。水旺财丰，金多子秀。火盛有荣，木多无咎。再加比助为佳，更喜身强为寿。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "寒金冷水。木多难施斧凿之功，水盛未免沉潜之患。土能制水，金体不寒；火来生土，子母成功。喜比肩聚气相扶，欲官印温养为利。";
      }
      else {
        s = "寒冰冷水。遇火则暖除寒，见土则藏归化。金多反致无义，木盛是谓有情。水流泛滥，赖土堤防；土重高亢，反成调辙。";
      }
      break;
    case 1:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "木衰水寒，冻水难生，盘屈在地，欲土多以培养，恶水盛而忘形。金纵多，克伐无害；火重见，温燠有功。归根复命之时，木病安能辅助？须忌死绝之地，只宜生旺之方。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "体绝形亡。喜木生而有救，遇水克以为殃。欲土制为荣，爱火比为利。见金则难任为财，无金则不遭磨折。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "寒湿至极，外寒内温。水旺财丰，金多子秀。火盛有荣，木多无咎。再加比助为佳，更喜身强为寿。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "寒金冷水。木多难施斧凿之功，水盛未免沉潜之患。土能制水，金体不寒；火来生土，子母成功。喜比肩聚气相扶，欲官印温养为利。";
      }
      else {
        s = "寒冰冷水。遇火则暖除寒，见土则藏归化。金多反致无义，木盛是谓有情。水流泛滥，赖土堤防；土重高亢，反成调辙。";
      }
      break;
    case 2:
      if (SiZhu.rg == 1 || SiZhu.rg == 2) {
        s = "木凋水寒，冻水难生，盘屈在地，欲土多以培养，恶水盛而忘形。金纵多，克伐无害；火重见，温燠有功。归根复命之时，木病安能辅助？须忌死绝之地，只宜生旺之方。";
      }
      else if (SiZhu.rg == 3 || SiZhu.rg == 4) {
        s = "湿土晦光。喜木生而有救，遇水克以为殃。欲土制为荣，爱火比为利。见金则难任为财，无金则不遭磨折。";
      }
      else if (SiZhu.rg == 5 || SiZhu.rg == 6) {
        s = "天寒地冻，外寒内温。水旺财丰，金多子秀。火盛有荣，木多无咎。再加比助为佳，更喜身强为寿。";
      }
      else if (SiZhu.rg == 7 || SiZhu.rg == 8) {
        s = "金寒土冻。木多难施斧凿之功，水盛未免沉潜之患。土能制水，金体不寒；火来生土，子母成功。喜比肩聚气相扶，欲官印温养为利。";
      }
      else {
        s = "土冻水寒。遇火则暖除寒，见土则藏归化。金多反致无义，木盛是谓有情。水流泛滥，赖土堤防；土重高亢，反成调辙。";
      }
      break;
    }
    return s;
  }

}