package org.boc.db.qm;

public class QiMen2 {
	public static final String HH="<BR>&nbsp;&nbsp;&nbsp;&nbsp;";
	public static final String XMLHH="<BR>";
	
	public static boolean ALL = false;  //全部显示隐藏
	public static boolean SJ = false;   //十二神将
	public static boolean JXGE = false;
	public static boolean SGKY = false;
	public static boolean JTXMS = false;
	public static boolean WSXQ = false;
	public static boolean XCHM = false;
	public static boolean HUO = false;	
	public static boolean MA = true;	
	public static boolean HEAD = true;  //是否显示隐藏头部日期信息
	public static boolean CALENDAR = true;  //是否显示时间面板
	
	public static final int LEFTMIN = 1;  //左边的树的最小宽度
	public static final int LEFTMAX = 175;  //左边的树的最合适的宽度
	public static int LEFT = LEFTMIN;  //左边的树的宽度，默认为隐藏左边的，其宽度为1
	
	public static boolean YANG = true;    //阴盘还是阳盘，默认是阳盘
	public static boolean ZF = true;    //转盘还是飞盘，默认是转
	public static boolean RB = false;		//置闰还是拆补，默认是拆补法
	public static boolean TD = true;		//小值符随天还是地，默认随天
	public static boolean KG = true;		//永寄坤宫还是艮，默认是坤宫
	public static boolean TIP = true;		//关闭显示提示信息，默认关闭
	
	public static int XMHW = 0;  //星门换位，0是复位，100是72变
	
	public static boolean TOOL = true;  //是否显示工具栏，默认显示
	public static boolean INPUT = false;  //是否显示高级面板，默认显示
	public static boolean IO = true;  //显示内置还是自定义的提示信息、规则引擎、格局定制。默认为内置	
	
	
	public static String[][] GUA2 = new String[10][2];  //九宫意象
	public static String[][] WH2 = new String[10][2];   //五行意象
	public static String[][] SHEN2 = new String[10][2]; //八神意象
	public static String[][] XING2 = new String[10][2]; //九星意象
	public static String[][] MEN2 = new String[10][2];	 //八门意象
	public static String[][] GAN2 = new String[11][2];  //十天干意象
	public static String[][] ZI2 = new String[13][2];   //十二地支意象
	public static final String[][] SHENJ2 = new String[13][3]; 
	public static final String[][] JXZS2 = new String[10][13];
		
	public static String[][] GUA = new String[10][2];  //九宫意象
	public static String[][] WH = new String[10][2];   //五行意象
	public static String[][] SHEN = new String[10][2]; //八神意象
	public static String[][] XING = new String[10][2]; //九星意象
	public static String[][] MEN = new String[10][2];	 //八门意象
	public static String[][] GAN = new String[11][2];  //十天干意象
	public static String[][] ZI = new String[13][2];   //十二地支意象
	public static final String[][] JXZS = new String[10][13];	//九星值时
	public static final String[][] SHENJ = new String[13][3];	//十二神将
	
	static{
		GUA[1] = new String[]{"坎宫",""};
		GUA[2] = new String[]{"坤宫",""};
		GUA[3] = new String[]{"震宫",""};
		GUA[4] = new String[]{"巽宫",""};
		GUA[6] = new String[]{"乾宫",""};
		GUA[7] = new String[]{"兑宫",""};
		GUA[8] = new String[]{"艮宫",""};
		GUA[9] = new String[]{"离宫",""};
		
		SHEN[1] = new String[]{"值符",""};
		SHEN[2] = new String[]{"腾蛇",""};
		SHEN[3] = new String[]{"太阴",""};
		SHEN[4] = new String[]{"六合",""};
		SHEN[5] = new String[]{"白虎",""};
		SHEN[6] = new String[]{"玄武",""};
		SHEN[7] = new String[]{"九地",""};
		SHEN[8] = new String[]{"九天",""};
		
		MEN[1] = new String[]{"休门",""};
		MEN[2] = new String[]{"死门",""};
		MEN[3] = new String[]{"伤门",""};
		MEN[4] = new String[]{"杜门",""};
		MEN[5] = new String[]{"中门",""};
		MEN[6] = new String[]{"开门",""};
		MEN[7] = new String[]{"惊门",""};
		MEN[8] = new String[]{"生门",""};
		MEN[9] = new String[]{"景门",""};
		
		XING[1] = new String[]{"天蓬",""};
		XING[2] = new String[]{"天芮",""};
		XING[3] = new String[]{"天冲",""};
		XING[4] = new String[]{"天辅",""};
		XING[5] = new String[]{"天禽",""};
		XING[6] = new String[]{"天心",""};
		XING[7] = new String[]{"天柱",""};
		XING[8] = new String[]{"天任",""};
		XING[9] = new String[]{"天英",""};
		
		GAN[1] = new String[]{"甲",""};
		GAN[2] = new String[]{"乙",""};
		GAN[3] = new String[]{"丙",""};
		GAN[4] = new String[]{"丁",""};
		GAN[5] = new String[]{"戊",""};
		GAN[6] = new String[]{"己",""};
		GAN[7] = new String[]{"庚",""};
		GAN[8] = new String[]{"辛",""};
		GAN[9] = new String[]{"壬",""};
		GAN[10] = new String[]{"癸",""};
		
		ZI[1] = new String[]{"子",""};
		ZI[2] = new String[]{"丑",""};
		ZI[3] = new String[]{"寅",""};
		ZI[4] = new String[]{"卯",""};
		ZI[5] = new String[]{"辰",""};
		ZI[6] = new String[]{"巳",""};
		ZI[7] = new String[]{"午",""};
		ZI[8] = new String[]{"未",""};
		ZI[9] = new String[]{"申",""};
		ZI[10] = new String[]{"酉",""};
		ZI[11] = new String[]{"戌",""};
		ZI[12] = new String[]{"亥",""};

		JXZS[1][1]="主有鸡鸣犬吠、宿鸟闹林，或有鸟自北方争闹飞来。"+HH+"作用后缺唇人至，六十日后应鸡生肉卵，主口舌官讼，退财凶。";
		JXZS[1][2]="主树倒伤人、有雷电大作，及风雨为应。"+HH+"作用后主七日内鸡生鹅卵、犬上房，百日内伤小口，白头老人作牙，进田产、大旺十年后主退败。";
		JXZS[1][3]="主青衣童子持花来，北方和尚裹衣至，又主女人来为应。"+HH+"作用后主有贼劫家财，六十日蛇入屋咬人，牛马死，伤人口，三年后进田宅。";
		JXZS[1][4]="主黄云四起、妇人拿把铁器前来、大蛇过路为应。"+HH+"作用后半月有征音人送财物来，六十日内女人被贼害破财，百日内得横财大发。";
		JXZS[1][5]="主东北树倒伤人、鼓声四起、女人着红衣至为应。"+HH+"作用后主鹊噪，鸦鹊绕屋，贼入盗财物，六十日内病脚人上门抵赖，三年内生贵子发福。";
		JXZS[1][6]="主驼背人着毛衣，女子携酒至及师人来为应。"+HH+"作用后百日内，因大发横财，因武得官发达。";
		JXZS[1][7]="主有人持刀上山，妇人领青衣童子至为应。"+HH+"作用后四十日家主亡，六十日犬作人语入屋作怪，风脚人行凶、破财，三年发旺。";
		JXZS[1][8]="主童子赶马牛至，鹭鸶自北方飞来，女人着红衣至为应。"+HH+"作用后六十日内贼入屋，劫掠财物凶败。";
		JXZS[1][9]="主有取水人并持伞盖至，西方小儿打水、擂鼓、叫喊为应。"+HH+"作用后二十日鸡窝内有蛇伤物，百日内少妇自缢、为淫欲，起官司凶败。";
		JXZS[1][10]="主西方有马行来，羣鸦飞噪为应。"+HH+"作用后百日内生贵子，僧道作牙、进商音人财产大发。";
		JXZS[1][11]="主老人持杖至，胡须人担箩筐至，西方雷雨至为应。"+HH+"作用后有白犬自来，八十日内拾军器得横财发大富。";
		JXZS[1][12]="小儿成羣至，女人着孝服为应。"+HH+"作用后六十日因捉贼得钱榖，三年内卖药及符咒水发财。";
		JXZS[2][1]="秋、冬用吉，春、夏用凶。有飞禽战惊，西南方上火光，二人相逐为应。"+HH+"作用后主猫犬疯癞伤人，惹官事，六十日内有女人自缢死，秋冬用之当进羽音财产发旺及妇人喜事吉。";
		JXZS[2][2]="有鼓声自西北至。七日内主龟鳖自林中来，六十日主盗贼官司破财凶。";
		JXZS[2][3]="主瘦妇怀孕至，夏秋主披蓑衣人至，春着皮衣人来为应。"+HH+"作用后如得奇门旺相，六十日内牛入屋，进血财，财官禄至，子孙兴旺大发。";
		JXZS[2][4]="主女人着色衣送物，及贵人骑马来，二犬相咬，牛鸣为应。"+HH+"作用后六十日进东方人财产，犬伤小儿、进血产，三年内妇人产难凶。";
		JXZS[2][5]="有东北方树倒伤人、鼓乐鸣、女人着红衣至为应。鹊绕屋飞鸣，因贼破财。"+HH+"作用后六十日有疯脚人上门赖，婚后生贵子、发旺。";
		JXZS[2][6]="有妇人少女同至为应。"+HH+"作用后四十日进绝户田契，一年因水大发财。";
		JXZS[2][7]="有缺唇白衣人至，孕妇过为应。"+HH+"作用后六十日猫咬人，因买卖大发财，得东邻产业大发。";
		JXZS[2][8]="有捕猎人至，白衣僧道携茶过为应。"+HH+"作用后七日有乌鹊绕屋树鸣噪，一年内动瘟癀，火烧屋荡败。";
		JXZS[2][9]="主东方伞盖人过，僧道胡须人至为应，主牛马伤人、犬咬人。"+HH+"作用后一百日内进羽音人产业，一年内水牛入屋、野鸟进宅，家主疾病。";
		JXZS[2][10]="主有西方马过，群鸟鸣飞为应。"+HH+"作用后百日内僧道作牙，进商音人产财，生贵子发旺。";
		JXZS[2][11]="有老人扶杖至，西方雷雨，胡须人担物来为应。后有白犬自来，六十日拾军器得横财大发。";
		JXZS[2][12]="有小儿成群，妇人着孝服至为应。后六十日因贼得财，三年后因符水、药剂发财。";
		JXZS[3][1]="主仙禽鸣噪、钟声为应。"+HH+"作用后有生气入宅，一年田蚕倍收，新妇亡后，因口舌得财。";
		JXZS[3][2]="主云雾四合，小儿成队及妇人至为应。"+HH+"作用后黑猫生白子，拾得古镜发财，一年内得僧道、田契、生贵子。";
		JXZS[3][3]="主贵人乘轿马及执金银器至为应。"+HH+"作用后六十日进文契、六畜，并琉璃器物入宅，母鸡啼、家主有灾，因口舌得财，乙己丁生者发富贵。";
		JXZS[3][4]="主女人穿色衣送物，及贵人骑马至、二犬嘶咬、又主牛鸣为应。"+HH+"作用后六十日进东方人产业，汤火伤小儿、进财，三年内妇人产难凶。";
		JXZS[3][5]="有鱼上树、白虎出山、僧道成伙至为应。"+HH+"作用后四十日内拾得黄白之物发横财，七十日内家主有折伤之患。";
		JXZS[3][6]="主牛羊争行、二女嘶骂、西方有鼓声为应。"+HH+"作用后六十日内蛇咬鸡、牛入屋、女人送文契，百日内生贵子大发。";
		JXZS[3][7]="主有东方人家火起，白衣人叫喊，山鸟鸣噪为应。"+HH+"作用后六十日内拾得古铜器物发财产。";
		JXZS[3][8]="有鼓声响、小儿着孝衣，牛马成羣过，西北人喊叫为应。"+HH+"作用后六十日内白羊入屋，发横财，六畜兴旺。";
		JXZS[3][9]="主南方白衣人骑马过，吏卒争鬪为应。"+HH+"作用后一百日内女人作牙，添进人口，发财产。";
		JXZS[3][10]="有远方书信至，东方人家说狐狸，有人喊叫，妇人掌火为应。"+HH+"作用后三年内生贵子，横发富贵。";
		JXZS[3][11]="西方有三、五人来寻物，及师巫人对走为应。"+HH+"作用后六十日鸡鸣上树、远信至、得外人财，一年内小儿被牛踏伤。";
		JXZS[3][12]="有跛足青衣人至，东方人家起火为应。"+HH+"作用后一百日内猫捕白鼠，一年内得财，进人家田契。";
		JXZS[4][1]="主西方着红衣大叫前来为应。"+HH+"作用后六十日进商音人财物、猴入室、宝瓶鸣，主加官进职、生贵子，十二年兴旺吉。";
		JXZS[4][2]="作用时主东方有犬吠，有人持刀杀人鬪叫。"+HH+"造葬后有白兔野鸡入室，六十日内僧道送物，及东南方羽音人送文契至、远行信归、周年添进人口、大旺血财、加官进禄。";
		JXZS[4][3]="有公吏人持铁器至，及艺人送物来为应。六十日内进田契，十一年生贵子大发。";
		JXZS[4][4]="有女人持伞至，及师巫吹角声为应。六十日内发财、添丁，有生气物，家旺财榖，因女人公事进田地财产。";
		JXZS[4][5]="白羊与黄犬相鬪，卖菜人与卖油人相撞，白衣小儿啼哭、孕妇至为应。一年内生贵子，财产大发。";
		JXZS[4][6]="有二人相打，女人抱布衣，风四起、小儿啼哭。六十日进东财产，鬼神运来大发。";
		JXZS[4][7]="有僧拿物，女人着红衣过为应。六十日有贵人送异物，进四方金银，一年内得寡妇财产大发。";
		JXZS[4][8]="主二畜相触，有人携皮毛至，僧道成羣过为应。"+HH+"作用后西北方人争财，百日内进财物、文契。";
		JXZS[4][9]="有患足人携酒至，三色衣人来，西北方鼓声鸣为应。"+HH+"作用后半年内蛇从井中出，白衣人送牛羊至，得妇人财发。";
		JXZS[4][10]="主有远方人书信至，东方人言狐狸或有人喊叫为应，女人拿火至，后三年内生贵子，横发财产。";
		JXZS[4][11]="主有三、五人来寻物，师巫对行为应，六十日鸡上树鸣、远信至、得妇人财，小儿被牛伤，一年内验之。";
		JXZS[4][12]="主有跛足人至，青衣人来，东北方人家火光为应。"+HH+"作用后百日内猫捕白鼠，一年内进田产。";
		JXZS[5][1]="主有孕妇来，紫衣人至为应。"+HH+"作用后五十日有文人送物，三年内因武得官，二十年外财榖广益，人丁千口财旺。";
		JXZS[5][2]="主孝妇拿锡器来，小儿拍掌、吹哨、打鼓、喊叫为应。"+HH+"作用后因赌戏得财，或开窖得财，三年内得盗贼财，发家致富。";
		JXZS[5][3]="主鸡鸣犬吠，道人戴棕笠至为应。"+HH+"作用后进羽音人田契、人丁发旺。";
		JXZS[5][4]="主有大风东起、禽鸟四叫、孕妇至为应。"+HH+"作用后半年内得横财起家。";
		JXZS[5][5]="主九流人相争叫，东方乌鸦鸣为应。"+HH+"作用后六十日有僧道及孤独人送物来。";
		JXZS[5][6]="主有白项鸦成群飞来，及师巫相打，贵人骑马过为应。"+HH+"作用后七十日内主妇人生贵子，成家，田产大旺。";
		JXZS[5][7]="主有白衣女人至，狗衔花、山鸡鬪，风雨至为应。"+HH+"作用后有人自来，因赌戏公事得财，黑鸡生白雏，田产发旺。";
		JXZS[5][8]="主有老年跛足担花过，或青衣人携物至为应。"+HH+"作用后六十日内进羽音人、铁器，发旺。";
		JXZS[5][9]="主空中飞鸟啼，师巫拿纸物来为应。"+HH+"作用后百日内女人拾珠翠归，一年内生贵子起家。";
		JXZS[5][10]="主西方火起、人家吵嚷、鼓声喧闹为应。"+HH+"作用后一年内生贵子，发旺。";
		JXZS[5][11]="主东北方有钟鼓声，青衣童子携篮至为应。"+HH+"作用后六十日内白鼠来，得寡妇财物发达。";
		JXZS[5][12]="主有西北方妇人笑声，大起狂风，折树毁屋，人喊叫为应。"+HH+"作用后百日内进铁匠器物及僧道产。";
		JXZS[6][1]="主有人争鬪，鼓声西北起为应。"+HH+"作用后九十日内有赤面人作牙，进商音人古铜画轴，十二年田蚕发旺。";
		JXZS[6][2]="主西南方有火光，跛足人送物至，五日内双猫自来为应。"+HH+"作用后四十日有远方人送物，进商音人财产、文契。";
		JXZS[6][3]="主有水鸟至，钟鼓鸣，青衣女子提篮至为应。"+HH+"作用后火烧小口，六十日有公事，百日进金银，拾古器，进人口产业，三年因妻得财、生贵子。";
		JXZS[6][4]="主有跛足妇人相打，犬吠及鼓声，北方轿至为应。"+HH+"作用后七日内进财物，三年内有牛马来，财禄大旺。";
		JXZS[6][5]="主云从西北起，青衣人拿鱼至，女人与僧道同行为应。"+HH+"作用后井中气出如云，三日内生贵子，后主科第富贵。";
		JXZS[6][6]="主有女人抱小儿至，紫衣人骑马过为应，龟上树。"+HH+"作用后半月内进远方人财，跛足人作牙、进田契、六畜旺，女人治家，寡妇坐堂。";
		JXZS[6][7]="主有风雨骤至，蛇横路，女人着红裙提酒至为应。"+HH+"作用后六十日内有跛足人送活物，五年内横发财产。";
		JXZS[6][8]="主有法术人拿空器过，白衣老人至为应。"+HH+"作用后得商音姓人文契，田宅发富。";
		JXZS[6][9]="主有僧道来，金鼓四鸣，百鸟齐嗓，红裙女人送酒为应。"+HH+"作用后三年内寡妇持家。";
		JXZS[6][10]="主僧尼道姑拿火自西南来，北方钟鼓声为应。"+HH+"作用后七十日内得马牛，得官府财，远信至。";
		JXZS[6][11]="主南方喊叫有贼，小儿牵牛至为应。"+HH+"作用后百日内生贵子，金鸡石上鸣，无故犬吠，二年后中科第。";
		JXZS[6][12]="主鸡鸣犬吠，老人着皮衣帽至，手拿铁器为应。"+HH+"作用后七日内有远人来借宿，遗下财物而去。";
		JXZS[7][1]="主有风雨，火从东方起，缺唇人至为应。"+HH+"作用后六十日内蛇犬咬人，刀刃伤人、见血光、破财。";
		JXZS[7][2]="主有北方木匠拿斧，树上生金花为应。"+HH+"作用后六十日进羽音人金银器，三年内火灾，主败家产，出人弄蛇戏犬。";
		JXZS[7][3]="主牛马喧，僧道拿伞盖至，有雷雨，喜鹊噪为应。"+HH+"作用后主贼人牵连，官讼破财，女人小产死凶。";
		JXZS[7][4]="主有人伐树，男人拿鼓，黄衣老人拿锄鎌过为应。"+HH+"作用后六十日内母鸡犬上屋，一年内少妇死凶。";
		JXZS[7][5]="主有人自西方拿金器来为应。"+HH+"作用后七日内进阴人财物，三年内大发。";
		JXZS[7][6]="主有黑牛拉车，猪上山、钟鼓声鸣为应。"+HH+"作用后二十日内进商音姓人财物，六十日内有女人下水，野物入宅，一年内生贵子，大发之兆。";
		JXZS[7][7]="主有人骑马至，冬月有雪，夏秋有鸦飞鸣为应。"+HH+"作用后五日内孕妇带疾行孝服哭泣，六十日内水边得古铜器，退财小口凶。";
		JXZS[7][8]="主有女人与僧道同行，东北方人携伞盖骑马为应。"+HH+"作用后因女人见狐狸退败大凶。";
		JXZS[7][9]="主有鹰捕鸟落地，及青衣人携伞盖至为应。"+HH+"作用后三年内大火焚宅，家业大败。";
		JXZS[7][10]="主东方有大小车连络数十辆行为应。"+HH+"作用后七十日内得女人首饰发财。";
		JXZS[7][11]="主有女人抱白布物至，西北方有鼓声为应。"+HH+"作用后东北方树打人喊叫，后六十日蛇蝎伤人，瘟疫死，大败凶。";
		JXZS[7][12]="主西方有钟声为应，山下人喊叫，作用后百日内，因救火得财大利。";
		JXZS[8][1]="主有风雨至，水畔鸡鸣，东南方有人带刀过为应。"+HH+"作用后百日内，主妇人离异，水姓人上门抵赖、退田产，后出人男盗女娼凶。";
		JXZS[8][2]="主青衣妇人提酒至，西方鼓声为应。"+HH+"作用后半年内进异方财物，一年内鹦鹉入宅，因口舌得财，三年后猫犬相咬，主发科吉。";
		JXZS[8][3]="主女人成对至或拿火来，童子拍手大笑为应。"+HH+"作用后六十日内，甑鸣，老翁死，百日内进六畜、女人，财宝自来，田蚕发，后因缺唇人争，婚姻事败。";
		JXZS[8][4]="主有老人持杖至，喜鹊鸣造为应。"+HH+"作用后七日内有人送铜铁器物，六十日内因女人得进六畜，赌博赢，官禄至吉。";
		JXZS[8][5]="主有白衣男女同行，或孕妇抱小儿为应。"+HH+"作用后有人送活物至，大吉。";
		JXZS[8][6]="主有二犬相争，野人负薪，吏人拿伞过为应。"+HH+"作用后六十日得外方人财物，南方人送鱼至，一年内生贵子，发富贵吉。";
		JXZS[8][7]="主西方黄色禽鸟飞来，僧道与儒士同行为应。"+HH+"作用后四十日得贵人财宝，紫衣人进宅，生贵子吉。";
		JXZS[8][8]="主有白鸟自西南方飞来，北方钟鼓声为应，风雨至。"+HH+"作用后七日，外女人送白衣物或白纸物来，主六畜兴旺。";
		JXZS[8][9]="主大风雨陡至，人打鼓，僧道着黄衣为应。"+HH+"作用后七日内，女人被火烧，荡败凶。";
		JXZS[8][10]="主僧道尼姑持火自西南方来，北方钟鼓声为应。"+HH+"作用后七十日内得官员财物，进牛马，喜信至，大吉，钱财丰美大利。";
		JXZS[8][11]="主有女人抱布来，西北方鼓声，北方树木伤人为应。"+HH+"作用后六十日内蛇咬人，凶。若有老人与小儿同至，即解祸为福。";
		JXZS[8][12]="主西方磬鸣，人拿火喊叫为应。"+HH+"作用后一年内因救火得财大利。";
		JXZS[9][1]="主有锣声自西北来，三、五人掌火伐木为应。"+HH+"作用后一年内主有残病人抵赖破家，三年内自刎、小儿因汤火灾伤。";
		JXZS[9][2]="主东北方师巫僧道至，锣声鸣为应。"+HH+"作用后一月内火烧房屋，一年内犬作人言，百怪俱见，死亡大败凶。";
		JXZS[9][3]="主东方有兵马来，及捕鱼人持网过为应。"+HH+"作用后女人路上拾得财物，六十日内进寡妇田产，龙雷折屋凶。";
		JXZS[9][4]="主有提灯笼过或持米来，雷鸣为应。"+HH+"作用后应六十日内进女人财宝发家。";
		JXZS[9][5]="主西北方女人携物来，鸡上树为应。"+HH+"作用后人七十日，野物进宅，大发财产。";
		JXZS[9][6]="主有人抱文书、持伞盖至，或抱锡磁器为应。"+HH+"作用后六十日内得异姓人财产，南方人送活物来，一年内生贵子，发达。";
		JXZS[9][7]="主有人自南方来，着红衣或骑马持文书至为应。"+HH+"作用后六十日内被木石打死，及自缢、人命官司凶。";
		JXZS[9][8]="主有怀孕妇过，西北方鼓声为应。"+HH+"作用后九十日内家主淹死，一年内瘟疫大败。";
		JXZS[9][9]="主有孕妇哭泣，西方钟鼓声，僧道拿物过为应。"+HH+"作用后七十日内大凶。";
		JXZS[9][10]="主西方有人吵闹、鸟鹊鸣噪、白衣女人过为应。"+HH+"作用后主小口、女人足疾，百日内因唇舌得财。";
		JXZS[9][11]="主有女人持瓦器或铁物怒骂为应。"+HH+"作用后百日内因词讼破财。";
		JXZS[9][12]="主有女人掌火来为应。"+HH+"作用后有疯癞人上门抵赖，身死破财。";

		SHENJ[1] = new String[]{"太岁","中性星，遇吉星吉、遇凶星凶、被盖头为官灾星；"+HH+
				"太岁压运起祸端，伤财惹气心不甘。惊天动地祸来临，是是非非把人缠。他人闲事切勿管，未雨绸缪且安然。"+HH+
				"太岁运年多忧愁，口舌临门不自由，疾病缠身小人侵，婚姻钱财莫强求。运逢太岁难行舟，劝君持重莫远游。","太"};
		SHENJ[2] = new String[]{"青龙","吉星、贵人星、文凭星、驿马星、婚姻星、事业星，旺、见吉星、中性星盖头吉，凶星盖头空亡弱极为小人星；"+HH+
				"青龙是喜神，大喜有几重，荷花生贵子，门前应挂红。"+HH+
				"青龙入命大吉祥，创业谋事有人帮，添人进口生贵子，家中喜事一桩桩。官运亨通财运好，即使有祸不为殃。","青"};
		SHENJ[3] = new String[]{"丧门","小凶星，死人星、破财星、小人星、疾病星、弱和空亡吉；"+HH+
				"丧门是哭星，落泪有几行。丧门运年心不安，求财望喜多枉然，"+HH+
				"不是伤人就损财，忧思重重整一年，不有内孝有外孝，犯着丧门泪涟涟。","丧"};
		SHENJ[4] = new String[]{"六合","吉星、贵人星、财运星、婚姻星、文凭星、寿元星、子女星、凶星盖头空亡弱极犯小人；"+HH+
				"六合见六合，必定喜事逢。有妻生贵子，无妻娶娇娥。"+HH+
				"六合入命大吉昌，万事顺随人丁旺，多得亲友来辅助，纵有逆风不起浪，求财谋利皆如意，添喜进财时运强。","六"};
		SHENJ[5] = new String[]{"官符","中性星、配吉神事业星、配吉星为财运星婚姻星、配凶星有官灾；"+HH+
				"官符为红鸾，有喜在当年。少惹是非事，免祸在身边。"+HH+
				"官符入命令人忧，是非口舌无止休，平地也会起风波，忧思如麻不断头，财帛易散物易损，犯了官符难自由。","官"};
		SHENJ[6] = new String[]{"小耗","小凶星、破财星、疾病星、配吉星为子女星；"+HH+
				"时运多颠倒，做事不牢靠。金银多耗散，家财遭鬼盗。"+HH+
				"小耗之年多烦恼，是非口舌几多招，官非易起气易惹，金银财钱易损耗，东奔西跑无定处，办事不遂多阻挠。","小"};
		SHENJ[7] = new String[]{"大耗","大凶星、破财星、又称岁破；"+HH+
				"大耗定不祥，父母有人伤。今年财要损，朋友来反目。背运有人伤，落井会下石。"+HH+
				"年逢岁破祸非轻，官司窃骗极易生，不是破财遭凶事，就是体弱身染病，若与白虎连一起，凶丧孝服灾更重。","大"};
		SHENJ[8] = new String[]{"朱雀","大凶星、小人星、官灾星；"+HH+
				"朱雀压运凶，口舌是非多。内外来磨磋，小人当前横。事事犯啰唆，有理无人理。有冤无处诉，还要背黑锅。"+HH+
				"朱雀入命口舌生，风波扰得心不宁，求名求财皆不利，凡事多磨事少成，幸喜紫薇当头照，逢凶化吉保太平。","朱"};
		SHENJ[9] = new String[]{"白虎","大凶星、官灾星、被盖头有血光、配吉星为驿马、弱为疾病星；"+HH+
				"白虎当头坐，无灾也有祸。铁罗汉落井，有力难施展。白虎下山来，又遭口舌运，又遭凶灾气。"+HH+
				"白虎入命最凶险，血光伤疾度难关，更有内外孝服事，天灾横祸需防范，白虎之年心难安，一年四季不消闲。","白"};
		SHENJ[10] = new String[]{"贵神","吉星、贵人星、事业星、婚姻星、寿元星、凶星盖头空亡弱极犯小人；"+HH+
				"贵神压运事吉祥，财源广进喜又和。春不见喜秋也见，财喜双全不用说。男遇贵神天赐祥，女见贵神喜事多。"+HH+
				"贵神入命福寿长，财运亨通身安康，善与人交受人敬，高官厚禄名远扬，凡事都有贵人帮，运逢贵神心欢畅。","贵"};
		SHENJ[11] = new String[]{"吊客","小凶星、死人星、小人星、配吉星驿马；"+HH+
				"吊客压运事有凶，定有是非闹灾行。男犯吊客主不顺，女犯吊客有灾星。"+HH+
				"吊客流年也为凶，四方亲人不太平，求财谋利难如意，晦气会有几多重，岁逢吊客心不安，旧愁去了新愁添。","吊"};
		SHENJ[12] = new String[]{"病符","小凶星、疾病星、旺配凶星有血光；"+HH+
				"病符压运很难强，事要三思免祸殃。病魔缠身使人忧，三灾八难难得躲。"+HH+
				"病服入命恶重重，疾病缠身家不宁，办事处事心不顺，朝朝暮暮愁云生，凭你是个硬神汉，也得脱上皮几层。","病"};
		
		cp(GUA,GUA2);
		cp(WH,WH2);
		cp(SHEN,SHEN2);
		cp(XING,XING2);
		cp(MEN,MEN2);
		cp(GAN,GAN2);
		cp(ZI,ZI2);
		cp(SHENJ,SHENJ2);
		cp(JXZS,JXZS2);
	}

	public static final void cp(String[][] source, String[][] dest) {
		for(int i=0; i<Math.min(source.length, dest.length); i++) {
			for(int j=0; j<Math.min(source[i].length, dest[i].length); j++) {
				dest[i][j] = source[i][j];
			}
		}
	}
}